[{"title": "Curious City", "episodes": "The common stereotype for Midwesterners is that we’re polite, friendly...and passive-aggressive. But is there any truth to that? Reporter Andrew Merriweather goes looking for the answer.Illinois passed a new law last month that sets a deadline for the state to replace all of its toxic lead service lines -- those pipes that deliver drinking water to our homes and park fountains. Curious City’s Monica Eng fills us in on how long it's going to take to get rid of all the lead lines.Last year we met Elmhurst gardener Nicole Virgil, who was fighting for the right to put up a hoop house in her garden. A hoop house is an inexpensive way to help extend the growing season. It protects the crops from the wind and snow and can keep the soil from freezing.  Virgil took her fight all the way to the state legislature. Curious City’s Monica Eng tells us what happened next.Little-known fact: in Chicago, you don’t need to be an elected official to propose legislation to City Council. But does this process really work? Has anyone ever done it?  WBEZ city politics reporter Claudia Morell investigates. Along the way she speaks to a former governor and a cab driver who have tested it out for themselves.If you hear church bells ring in the Chicago-area, it’s likely they’re automated. Some bell systems are pneumatic or electronic. Others pipe digital hymns through amplifiers. But do real people ever ring real bells? That’s the question we’re exploring in this week’s episode. And the answer is yes! We head to five different spots, each with its own sound, unique history and distinct community.In 1969, Chicago was home to one of history’s most high-profile trials. Known as the Trial of the Chicago 8 — and sometimes the Trial of the Chicago 7 — the trial pitted anti-war protesters against the federal government. Eight men were accused of conspiring to incite a riot during protests that took place in Chicago during the Democratic National Convention of 1968. Outside the courtroom, protesters and onlookers gathered.  Some chanted to free the men.  Some came with signs and posters of protest and solidarity. In this episode, reporter Arionne Nettles explores the intersection of art and protest movements as she tries to track down the artist behind one of these posters."}, {"title": "Art History", "episodes": ""}, {"title": "The Cardone Zone", "episodes": ""}, {"title": "The \"What is Money?\" Show", "episodes": ""}, {"title": "FYI - For Your Innovation", "episodes": ""}, {"title": "Cum Town", "episodes": "okay pal sure, \"go\" pee pee then. right in my mouth why dont youthey a mak-uh us a gay, they make us looka like a gay man to raff at ushowdy bitchhey do u guys think stav would f**k cruellaand its like wa wa but for people with downs syndrome. how about that u f****n pieces of shitwhat am I like f****n 40 years old now f**k"}, {"title": "Armchair Expert Mondays with Dax Shepard", "episodes": ""}, {"title": "Rick & Bubba Show", "episodes": ""}, {"title": "Experts on Expert with Dax Shepard", "episodes": ""}, {"title": "Japanese podcast for beginners (Nihongo con Teppei‪)‬", "episodes": ""}, {"title": "The Clinical Problem Solvers", "episodes": "Rabih and Reza discuss learning during the process of clinical reasoning on VMR.  Download CPSolvers App here Patreon website RLR website   VMR sign upSimone and Lindsey present a case to Dr. Kirsten Austad, followed by a discussion about women in leadership and “the double bind”  Dr. Kristen Austed Kirsten Austad MD, MPH is an Assistant Professor of Family Medicine at Boston University School of Medicine and a hospitalist at Boston Medical Center. She earned her undergraduate degree in English Literature… Read More »Episode 184: Wdx #11- Clinical Unknown with Dr. Kirsten AustadBronson presents a clinical unknown to Mohit, Kai, and Lindsey. Want to test your learning? Take our Episode Quiz  Mohit Harsh Mohit is a current Chief Resident in the Department of Internal Medicine at WashU. He is from Huntington, West Virginia and attended Marshall University School of Medicine in his hometown. He loves clinical… Read More »Episode 183: Human Dx with Lindsey – cough and rashSue Ellen presents a clinical unknown to Nick, Jennifer, and Dan Schema Nicholas Hornstein Nicholas Hornstein is a PGY-3 at UCLA Ronald Reagan Medical Center. He was born and raised in Los Angeles, earned his undergraduate degree from Brandeis University, and graduated from Columbia University with an MD and a PhD in Computational Biology. He… Read More »Episode 182: Human Dx with Dan – AMS and lower extremity weaknessSummary In this special episode of the Antiracism in Medicine Series, originally recorded for the 2021 Society of General Internal Medicine Annual Meeting, the CPSolvers Antiracism team discusses what must be done to make medical education more antiracist. The conversation spans stages of academic medical career progression, ranging from recruitment to training to retention. The… Read More »Episode 181: Antiracism in Medicine Series – Episode 9 – Moving Towards Antiracism in Medical EducationRabih moderates as an interactive, international virtual morning report community discusses a case of fever Fever Overview Schema Inflammation Thought Train Schema Want to test your learning? Take our episode quiz here Dr. Hernán Carrillo Hernán Carrillo is Head of the Internal Medicine Department at Las Higueras Hospital in Talcahuano, Chile. He’s also an Assistant… Read More »Episode 180: Clinical Unknown – Global VMR"}, {"title": "Talk To Me In Korean - Core Grammar Lessons Only", "episodes": "Check how much you can understand from studying with Level 10 lessons of TalkToMeInKorean! To make the conversation more realistic, we have added some new words and expressions that did not get covered in Level 10 yet. https://talktomeinkorean.comDownload the lesson notes for this episode at talktomeinkorean.comDownload the lesson notes for this episode at talktomeinkorean.comDownload the lesson notes for this episode at talktomeinkorean.comDownload the lesson notes for this episode at talktomeinkorean.comDownload the lesson notes for this episode at talktomeinkorean.com"}, {"title": "GrowCast", "episodes": "Good friend of the show Jinx from Jinxproof's Dank Bank drops by the podcast for an episode about his new drops, Oklahoma growing, and more! Jinx talks about some of the selections he has just released, and goes on to share a teaser about doing some work with one of the parents (Gooberry) of his world famous 9 Pound Hammer strain. Jinx goes on to talk about growing in Oklahoma and the work he is doing with Carter Creek Cannabis, emphasizing the importance of regenerative practices focused on getting quality medicine in the hands of Oklahoma patients. He also talks about some possible Carter Creek only lines... Jinx discusses his thoughts on breeding with his strains, and gives an update on some of the less than honorable companies who have been using his logo and likeness without authorization. Jinx also discusses what he and his lovely wife Rose have planned for the foreseeable future, including conventions and meetups across the US! ---Proud partners of Rimrock Analytical, fast and easy sex testing! Use code growcast for free shipping on your tests, easy and fast collection process, cull your male seedlings! Visit www.rimrockanalytical.com and use code growcast for free shipping!!!--- ---Proud partners of Plant Revolution! www.plantrevolution.com try their new King Crab beneficial bacteria today! Increase nutrient uptake, photosynthesis, soil breakdown, and more! This product will be a game changer for you in ANY cultivation setup!--- ---Proud partners of Rain Science Grow Bags the best containers for growing! No more inferior pots and overwatering- use code growcast for 10% off at www.rainsciencegrowbags.com---Today's episode features the Queen of GrowCast Grower's Chat herself: Marybeth Sanchez! Today she is here to talk about soil microbes- but we aren't focusing on the fungi and bacteria as usual... Today Marybeth covers some of the other types of living micro organisms we find in soil. From beneficial protozoa, to unwanted algae, it's important to understand how these microbes differ, and which ones are desirable. Marybeth discusses under which conditions these microbes (good and bad) thrive, with some species preferring a more anaerobic, low oxygen environment. Marybeth also talks about soil composition, actinomycetes versus traditional bacteria, and more. ---Rimrock Analytical, fast and easy sex testing! Use code growcast for free shipping on your tests, easy and fast collection process, cull your males quickly! Visit www.rimrockanalytical.com and use code growcast for free shipping!!!--- ---Proud partners of Plant Revolution! www.plantrevolution.com try their new King Crab beneficial bacteria today! Increase nutrient uptake, photosynthesis, soil breakdown, and more! This product will be a game changer for you in ANY cultivation setup!--- ---WE LOVE AC INFINITY! industry ventilation leaders www.acinfinity.com use promo code growcast15 for 15% off the BEST grow fans in the game, plus sexy tents too!---GrowCast Team Member Rhizo Rich is back on the line for an episode all about using common sense in your grow. Whether it's choosing organic soil vs bottled nutrients, or going LED vs HID- using your common sense can save you a lot of time, hassle, and headache down the road. Jordan and Rich discuss how it's important to cultivate according to your own values, goals, and desires- but how we have to balance that with the reality of our own unique individual cultivation situations. Jordan talks about improving systems, and how important it is to not repeat the same inefficient processes over and over due to laziness. Rhizo Rich also talks about the wide array of brand new genetics he's adding to his garden- as well as some of the strains he's taking a close look at as possible breeding candidates... ---WE LOVE AC INFINITY! industry ventilation leaders www.acinfinity.com use promo code growcast15 for 15% off the BEST grow fans in the game, plus sexy tents too!--- ---Proud parters of Photontek- top of the line, efficient and powerful LED grow lights- use code growcast at www.photontek-lighting.com to save 5% off your high-end full spectrum grow lights! www.photontek-lighting.com code growcast--- ---Proud partners of Plant Success www.plant-success.com try their new King Crab beneficial bacteria today! This product will be a game changer for you in ANY cultivation setup!---Today's episode is a breeder feature! This time we are highlighting Predicative Breeding, a feminized photoperiod focused breeder from the east coast. Predicative talks about his most prolific work, the well known New England Rock Candy, and all the cultivars that he has crossed out since. He discusses why he's so fond of feminized cannabis, highlighting the need for feminization for low plant count growers. The conversation turns towards stability and Predicative talks about how feminized genetics have changed over the years, due the best practices of reversals changing. He also highlights how important selection and stabilization is to him as a breeder, emphasizing how little intersexing within a well stabilized feminized line. Visit www.pbreeding.com to learn more! ---WE LOVE AC INFINITY! industry ventilation leaders www.acinfinity.com use promo code growcast15 for 15% off the BEST grow fans in the game!--- ---Proud parters of Photontek- top of the line, efficient and powerful LED grow lights- use code growcast at www.photontek-lighting.com to save 5% off your high-end full spectrum grow lights! www.photontek-lighting.com code growcast--- ---Proud partners of Plant Success www.plant-success.com try their new King Crab today! Highly concentrated beneficial bacteria to boost your buds!---Today we have brand new guest Matt from Total Harvest Control soil on the line- as well as other THC team members! Matt joins the show to talk about the importance of soil aeration, how he formulated his brand of soil, and more! He discusses the many different aerating inputs that are available, and the benefits and drawbacks of each. Matt talks about why he prefers rice hulls in his mix and as a top cover, highlighting the sustainability and effectiveness- and also emphasizes the relatively fast breakdown of the silica in rice hulls. The conversation turns towards soil cover, and Matt gives his opinion on using play sand as a top cover. The THC team also chimes in on soil availability north of the border in Canada, and how the Canadian grower market relates to the United States cultivation scene... ---Proud partners of Microbe Life Hydro, creators of photo plus, nourish L and more! Use code MLHGROWCAST to save 10% one time at www.microbelifehydro.com uplevel your garden with Microbe Life microbes!!! www.microbelifehydro.com --- ---Proud parters of Photontek- top of the line, efficient and powerful LED grow lights- use code growcast at www.photontek-lighting.com to save 5% off your high-end full spectrum grow lights! www.photontek-lighting.com code growcast---**HUGE SHOUTOUT to the member who won the Terp Fi3nd Baller Pack raffle, and DONATED BACK several packs to give away to members. They wish to remain anonymous, but you know who you are, SO THANK YOU!!!** Fi3nd of the show and prolific breeder of fire Terp Fi3nd returns to GrowCast! Today he's here to talk all about his new drops of White Cherry Wedding Cake crosses, as well as future projects, and more. Terp gives a breakdown on his new WCWC line, goes into detail into the crosses available, and describes what growers can expect from them. The conversation turns towards cultivation and Terp gives his thoughts on proper grow climate, increased levels of humidity, and different phenotypical expressions that varying climates can bring. He also discusses the dry and cure process, and how natural environment plays a role. Terp Fi3nd also talks about getting his website and mailing list set up, and the many vaulted packs he will slowly be releasing over the coming weeks... Visit www.terpfi3nd.com to check out his brand new site and more! ---NEW PARTNER ALERT! Rimrock Analytical, fast and easy sex testing! Use code growcast for free shipping on your tests, easy and fast collection process, cull your males quickly! Visit www.rimrockanalytical.com and use code growcast for free shipping!!!--- ---Proud parters of Photontek- top of the line, efficient and powerful LED grow lights- use code growcast at www.photontek-lighting.com to save 5% off your high-end full spectrum grow lights! www.photontek-lighting.com code growcast--- ---Proud partners of Rain Science Grow Bags the best containers for growing! No more inferior pots and overwatering- use code growcast for 10% off at www.rainsciencegrowbags.com---"}, {"title": "Rebel Robin: Surviving Hawkins", "episodes": "Robin Buckley's sophomore year at Hawkins High School started well enough, but recently things have been getting complicated. She finally accepts Mr. Hauser's offer to spend her lunch period in his classroom. He's her favorite teacher after all, and he seems to really care about his students. But can she trust him with the details of \"Operation Croissant\"?Coming June 29th, from Netflix and Atypical Artists, the first Stranger Things fiction podcast! Starring Maya Hawke as Robin and Sean Maher (Firefly) as Mr. Hauser, her favorite teacher. There's a new monster in Hawkins, Indiana, and Robin will need Mr. Hauser's help to defeat it. But why is he so willing to help her? And what's the secret he's hiding from her?Follow us now so you don't miss a thing! The six episode season start on June 29th. And for more of Robin’s backstory, be sure to order the companion novel, Stranger Things: Rebel Robin, wherever books are sold."}, {"title": "A Voice From Darkness", "episodes": "Dr. Ryder answers Sawyer's question about the obscure document: The Ratcatcher's Hymn.To hear more of our monthly Patreon exclusive episodes, or ask Dr. Ryder your own question, join our Patreon:https://www.patreon.com/vfdarknessKristin Holland as Dr. Malcolm RyderShow artwork by Trevin WyantWritten & Produced by Jac RhysFollow us:Twitter: @vfdarknessInstagram: vfdarknessBuy us a ko-fi: https://ko-fi.com/vfdarknessTranscript available here.Andy (The Countdowns) leaves another voicemail for Dr. Ryder.Nick Koyama as AndyKristin Holland as Dr. Malcolm RyderShow artwork by Trevin WyantFollow us on:Twitter: @vfdarknessInstagram: vfdarknessSupport us:Patreon: patreon.com/vfdarknessKo-fi: ko-fi.com/vfdarknessIf you enjoy our show, please consider rating and reviewing us wherever you heard us.Dr. Rider answers a question about The Unwelcome Riders.To hear the full episode, join our patreon: http://patreon.com/vfdarknessNew episodes out monthly. Kristin Holland as Dr. Malcolm RyderWritten and Produced by Jac RhysShow artwork by Trevin WyantMalcolm takes a call from his sister.Kristin Holland as Dr. Malcolm RyderBonnie Bogovich as Professor Amelia RyderIf you enjoy Kristin's performance, check out his other series, Nocturnal Transmissions.If you want to support our show and hear exclusive episodes, consider supporting our Patreon: https://www.patreon.com/vfdarknessWritten and Produced by Jac RhysA listener asks Dr. Ryder if he's ever visited the fabled Chicago bar.To hear the full episode, and future Patreon-exclusive episodes, subscribe here: https://www.patreon.com/vfdarknessNew episodes will be released on our main feed soon as well.Kristin Holland as Dr. Malcolm RyderWritten and Produced by Jac RhysTo help prepare you for the launch of our second season, here's a brief summary of events that took place during our first.We have a new episode available on our Patreon: https://www.patreon.com/vfdarknessWe'll have new exclusive episodes available there monthly.But we'll also be back with more episodes here on our main feed shortly.Thank you for listening."}, {"title": "The NoSleep Podcast", "episodes": "It’s Episode 12 of Season 16. Our correspondence signals the end of times.   “Dictionary for the Apocalypse: Section N” written by C Devlin (Story starts around 00:06:15)   TRIGGER WARNING! Produced by: Phil Michalski Cast: Narrator – Jessica McEvoy “Love in the Apocalypse” written by Austin Gragg (Story starts around 00:49:20) Produced by: Phil Michalski Cast: Narrator – Nikolle Doolin, Tan – Kyle Akers, Bell – Wafiyyah White, Niall – Atticus Jackson “The Last Day of Summer” written by Shawn W. Foley (Story starts around 01:10:10)   TRIGGER WARNING! Produced by: Phil Michalski Cast: Narrator – Mike DelGaudio “Sirens” written by Bill Schwarz (Story starts around 01:19:45) Produced by: Jeff Clement Cast: Narrator – Graham Rowat, Glenn – Jeff Clement “Flesh & Blood” written by Jerry W McKinney (Story starts around 01:49:30)   TRIGGER WARNING! Produced by: Jesse Cornett Cast: Jessie – Atticus Jackson, Pa – Jesse Cornett, Sarah – Sarah Ruth Thomas      This episode is sponsored by: HelloFresh – With HelloFresh, you get fresh, pre-measured ingredients and mouthwatering seasonal recipes delivered right to your door. Skip trips to the grocery store and count on HelloFresh to make home cooking easy, fun, and affordable ñ and that’s why it’s America’s #1 meal kit!. Go to HelloFresh.com/nosleep14 and use code nosleep14 for up to 14 free meals plus free shipping! ShipStation – ShipStation makes it super easy to manage and ship all your orders from all your sales channels faster, cheaper and more efficiently. You can import orders from any sales channel and ship with any carrier using their deeply discounted rates. Go to shipstation.com and click the microphone icon at the top of the page. Enter code NOSLEEP to get a 60-day free trial.      Click here to learn more about The NoSleep Podcast team   Click here to learn more about C Devlin         Executive Producer & Host: David Cummings Musical score composed by: Brandon Boone “Dictionary for the Apocalypse: Section N” illustration courtesy of Jörn Audio program ©2021 – Creative Reason Media Inc. – All Rights Reserved – No reproduction or use of this content is permitted without the express written consent of Creative Reason Media Inc. The copyrights for each story are held by the respective authors.It’s Episode 11 of Season 16. Our correspondence shines darkness onto our screens.   “The Bleak Stars” written by Alexander Hay (Story starts around 00:05:30)   TRIGGER WARNING! Produced by: Phil Michalski Cast: Narrator – David Ault, David Cummings as Himself “She Looked at Me” written by A.J. Harvey (Story starts around 00:25:30) Produced by: Phil Michalski Cast: Crystal – Wafiyyah White, Terry – Atticus Jackson, Burk – Mike DelGaudio, Rob – Graham Rowat, Elizabeth Dunham – Mary Murphy “The Hidden Television Channel” written by Mr. Michael Squid (Story starts around 00:46:25)   TRIGGER WARNING! Produced by: Jeff Clement Cast: Narrator – Kyle Akers, Ryan – Dan Zappulla, Host – Graham Rowat, Dan – Atticus Jackson “A Night at the Movies” written by T. Michael Argent (Story starts around 01:01:00) Produced by: Phil Michalski Cast: Narrator – Sarah Ruth Thomas, Travis – Dan Zappulla, Dr. Andersson – Mike DelGaudio, Ticket seller – Mary Murphy, Atkinson – David Ault, Man in film – Peter Lewis, Woman in film – Nikolle Doolin “A Voice Exhumed” written by Joe Prosit (Story starts around 01:36:00) Produced by: Jesse Cornett Cast: Narrator – Jesse Cornett, Phoebe – Nichole Goodnight, Steven – Atticus Jackson      This episode is sponsored by: Betterhelp – Betterhelp’s mission is making professional counseling accessible, affordable, convenient – so anyone who struggles with life’s challenges can get help, anytime, anywhere. Get started today and get 10% off your first month by going to betterhelp.com/nosleep Caliper CBD – Caliper CBD is a fast, easy way to use CBD. With precise 20 mg doses of dissolvable powder which mix quickly and flavorlessly into any food or drink, you’ll experience all the benefits of CBD without the hassles of oils or tinctures. Get 20% off your first order when you use promo code NOSLEEP at trycaliper.com/nosleep      Click here to learn more about The NoSleep Podcast team   Click here to learn more about Mr. Michael Squid   Click here to learn more about T. Michael Argent        Executive Producer & Host: David Cummings Musical score composed by: Brandon Boone “The Hidden Television Channel” illustration courtesy of Thea Arnman Audio program ©2021 – Creative Reason Media Inc. – All Rights Reserved – No reproduction or use of this content is permitted without the express written consent of Creative Reason Media Inc. The copyrights for each story are held by the respective authors.It’s Episode 10 of Season 16. Our correspondence marks a special anniversary.   “Hum” written by William Stuart (Story starts around 00:03:40)   TRIGGER WARNING! Produced by: Phil Michalski Cast: Tommy – Kyle Akers, Jared – Elie Hirschman, Tommy Gibson – Matthew Bradford, Hum – Peter Lewis, Mom – Sarah Ruth Thomas, Dad – Graham Rowat, Uncle Joe – Mike DelGaudio “The Devil’s Dice” written by Mr. Michael Squid (Story starts around 00:30:40) Produced by: Phil Michalski Cast: Narrator – Atticus Jackson “Final Investment” written by Melissa Mason (Story starts around 00:46:40) Produced by: Jeff Clement Cast: Narrator – Jeff Clement, Jeff – Graham Rowat, Mrs. Turner – Nikolle Doolin “I Will Always Love You” written by Veronica Carhill (Story starts around 01:21:10)   TRIGGER WARNING! Produced by: Phil Michalski Cast: Narrator – Sarah Ruth Thomas, Fairy of Love – Sarah Ruth Thomas, Patience – VR, Fairy of Chaos – Sarah Ruth Thomas “The Hand You’re Dealt” written by Frank Oreto (Story starts around 01:52:05) Produced by: Jesse Cornett Cast: Narrator – Jesse Cornett, Crane – Mick Wingert, Rod – Atticus Jackson, Lodden – David Cummings, Fitzhugh – David Ault, Knock – Peter Lewis “Someone Special” written by Paula Hammond (Story starts around 02:40:15)   TRIGGER WARNING! Produced by: Phil Michalski Cast: Narrator – Mary Murphy, Louis – Peter Lewis, 911 dispatcher – Atticus Jackson      Click here to learn more about The NoSleep Podcast team   Click here to learn more about William Stuart   Click here to learn more about Mr. Michael Squid         Executive Producer & Host: David Cummings Musical score composed by: Brandon Boone “Final Investment” illustration courtesy of Miggea Audio program ©2021 – Creative Reason Media Inc. – All Rights Reserved – No reproduction or use of this content is permitted without the express written consent of Creative Reason Media Inc. The copyrights for each story are held by the respective authors.The NoSleep Podcast celebrates its 10th Anniversary with this special bonus episode    “A Party for Marty” written by S.H. Cooper (Story starts around 00:05:15)   TRIGGER WARNING! Produced by: Phil Michalski Cast: Nathalia – Wafiyyah White, Marty – Peter Lewis, Daniel – Dan Zappula, Harmony – Sarah Olivia, Andre – Atticus Jackson “Tempus Edax Rerum” written by Olivia White (Story starts around 00:26:50) Produced by: Phil Michalski Cast: Haldon Wintermahr – Graham Rowat, Leonard Wintermahr – Jeff Clement, Ora Ananke – Sarah Thomas, Genevieve Wintermahr – Erin Lillis, Eugene Knightstone – David Ault, Dead Former Maid – Alexandra Cruz, Virgil Wintermahr – Jeff Clement, Muriel Wintermahr – Erika Sanderson, Anya Wintermahr – Jessica McEvoy, Homeless Man – David Cummings “Fulton High School’s Commencement Ceremony” written by A.C. McAnelly (Story starts around 00:56:56) Produced by: Phil Michalski Cast: Nick – Kyle Akers, Morgan – Nichole Goodnight, Mayor Tomlinson – Graham Rowat, Mom – Nikolle Doolin, James – James Cleveland, Todd – Elie Hirshman, Brother – Atticus Jackson, GowRow – Atticus Jackson    Click here to learn more about The NoSleep Podcast team   Click here to learn more about S.H. Cooper   Click here to learn more about Olivia White   Click here to learn more about A.C. McAnelly          Executive Producer & Host: David Cummings Musical score composed by: Brandon Boone 10th Anniversary illustration courtesy of Jen Tracy Audio program ©2021 – Creative Reason Media Inc. – All Rights Reserved – No reproduction or use of this content is permitted without the express written consent of Creative Reason Media Inc. The copyrights for each story are held by the respective authors.It's Episode 09 of Season 16. Our correspondence changes to the darker side.   \"Messages from School\" written by Jackson Arthur (Story starts around 00:05:00) Produced by: Phil Michalski Cast: Narrator - David Cummings, Denise Drake - Wafiyyah White, Mr. Zenith - Mick Wingert, Dispatcher - Nikolle Doolin, Janet Pervey - Mary Murphy, Grandma - Erika Sanderson, Adam - Erika Sanderson, Mr. Black - Graham Rowat \"The Closet\" written by Jacob Woislaw (Story starts around 00:19:50) Produced by: Phil Michalski Cast: Narrator - Graham Rowat, Max - Samuel Daniels, Amanda - Kristen DiMercurio, Raymond - Kyle Akers \"The Changing Room\" written by S.H. Cooper (Story starts around 00:39:25) Produced by: Jeff Clement Cast: Narrator - Nichole Goodnight, Dad - Jeff Clement, Grandma - Nikolle Doolin, Elena - Sarah Olivia \"Crash\" written by Rebecca Wilcox (Story starts around 00:50:35)   TRIGGER WARNING! Produced by: Phil Michalski Cast: Narrator - Mary Murphy \"Things Are Gonna Get Ugly\" written by Seth Borgen (Story starts around 01:00:15) Produced by: Jesse Cornett Cast: Narrator - Atticus Jackson, Simon - Kyle Akers, Sallie-Cathy - Nichole Goodnight, Tommy - Peter Lewis, Mom - Nikolle Doolin, Dad - Mike DelGaudio \"The Nightmare Liberated\" written by Dave Kavanaugh (Story starts around 01:47:45)   TRIGGER WARNING! Produced by: Phil Michalski Cast: Narrator - Erin Lillis, Major Skeans - Mick Wingert, Dr. Carson - Atticus Jackson, Young officer - Kyle Akers, Andrew - Peter Lewis      This episode is sponsored by: Betterhelp - Betterhelp's mission is making professional counseling accessible, affordable, convenient - so anyone who struggles with life's challenges can get help, anytime, anywhere. Get started today and get 10% off your first month by going to betterhelp.com/nosleep Quip - Quip is the good habits company for oral health. With their leading-edge electric toothbrush combined with dentist-recommend scheduled replacement plans for brush heads, toothpaste, floss, and now their new mouthwash! And if you go to getquip.com/nosleep5 you'll get $5 off a Mouthwash Starter Kit, which includes a refillable dispenser and a 90-dose supply of Quip's 4x concentrated formula.    Click here to learn more about The NoSleep Podcast team   Click here to learn more about Samuel Daniels   Click here to learn more about Jacob Woislaw   Click here to learn more about S.H. Cooper   Click here to learn more about Seth Borgen      Executive Producer & Host: David Cummings Musical score composed by: Brandon Boone \"Messages from School\" illustration courtesy of Mark Pelham Audio program ©2021 - Creative Reason Media Inc. - All Rights Reserved - No reproduction or use of this content is permitted without the express written consent of Creative Reason Media Inc. The copyrights for each story are held by the respective authors.Welcome to our fourth foray into fear with the ghastly tales we call Sleepless Decompositions. “AL5” written by Pam Puck (Story starts around 00:05:00)   TRIGGER WARNING! Produced by: Phil Michalski Cast: Narrator – Kristin DiMercurio, Leah – Erin Lillis, Maria – Danielle McRae, Christine – Sarah Ruth Thomas, Customer – Nikolle Doolin, Doctor – Dan Zappulla, News Anchor – Graham Rowat, Voice – Erin Lillis “Bone Crack” written by G.O. Undeath (Story starts around 00:37:45) Produced by: Phil Michalski Cast: Narrator – Matt Bradford, Emily – Mary Murphy, Psychiatrist – Elie Hirschman, Nurse – Alexis Bristowe “A Hungry Mouth to Feed” written by Jason Washer (Story starts around 00:53:15)   TRIGGER WARNING! Produced by: Jesse Cornett Cast: Narrator – Mike DelGaudio, Orson – Jeff Clement, Audrey – Nichole Goodnight, Doctor Ashford – Mick Wingert, Evelyn – Tanja Milojevic, Nurse – Wafiyyah White, Woman – Alexandra Cruz Hernandez “Cook Your Bloody Heart Out” written by Magda Knight (Story starts around 01:36:05)   TRIGGER WARNING! Produced by: Jeff Clement Cast: Anya – Erika Sanderson    This episode is sponsored by: Caliper CBD – Caliper CBD is a fast, easy way to use CBD. With precise 20 mg doses of dissolvable powder which mix quickly and flavorlessly into any food or drink, you’ll experience all the benefits of CBD without the hassles of oils or tinctures. Get 20% off your first order when you use promo code NOSLEEP at trycaliper.com/nosleep ShipStation – ShipStation makes it super easy to manage and ship all your orders from all your sales channels faster, cheaper and more efficiently. You can import orders from any sales channel and ship with any carrier using their deeply discounted rates. Go to shipstation.com and click the microphone icon at the top of the page. Enter code NOSLEEP to get a 60-day free trial.      Click here to learn more about The NoSleep Podcast team   Click here to learn more about Pam Puck   Click here to learn more about Jason Washer   Click here to learn more about Magda Knight      Executive Producer & Host: David Cummings Musical score composed by: Brandon Boone “Sleepless Decompositions” illustration courtesy of Kelly Turnbull   Audio program ©2021 – Creative Reason Media Inc. – All Rights Reserved – No reproduction or use of this content is permitted without the express written consent of Creative Reason Media Inc. The copyrights for each story are held by the respective authors."}, {"title": "The Elder Scrolls Podcast with FudgeMuppet", "episodes": ""}, {"title": "Horror Hill: A Horror Anthology and Scary Stories Series Podcast", "episodes": "In this episode of Horror Hill, we bring you the second part (and the thrilling conclusion of) a feature-length tale from author Kevin David Anderson, performed by host and narrator Jason Hill, That smell of diesel exhaust, the heat ripples rising off the asphalt, the distant rumble of rolling thunder getting ever, ever closer. It can only mean one thing: Dale and Earl are trucking into town, and all those things that go bump in the night best bump on down line. Kevin David Anderson’s dark knights of the road are back in business.To watch the podcast on YouTube: http://bit.ly/ChillingEntertainmentYTDon’t forget to subscribe to the podcast for free wherever you're listening or by using this link: https://bit.ly/HorrorHillPodcastIf you like the show, telling a friend about it would be amazing! You can text, email, Tweet, or send this link to a friend: https://bit.ly/HorrorHillPodcast  Learn more about your ad choices. Visit megaphone.fm/adchoicesIn tonight's episode of Horror Hill, Dale and Earl return to chew bubble-gum and... Well, I can't remember the rest but they are definitely getting low on gum. From fan favorite and friend of the show, Kevin David Anderson, get ready for Part 1 of a rip roaring two part series. It's time to hitch a ride to terror town with The Midnight Men. Shall we?To watch the podcast on YouTube: http://bit.ly/ChillingEntertainmentYTDon’t forget to subscribe to the podcast for free wherever you're listening or by using this link: https://bit.ly/HorrorHillPodcastIf you like the show, telling a friend about it would be amazing! You can text, email, Tweet, or send this link to a friend: https://bit.ly/HorrorHillPodcast   Learn more about your ad choices. Visit megaphone.fm/adchoicesIn this episode of Horror Hill, we bring you yet another terrifying tale from author and show favorite, Luciano Marano, performed by host and narrator, Jason Hill, and concerns some of the less savory elements of the creative process and the lengths to which some novelists will go to break a writer's block. So dip a finger into this dark inkwell of imagination but know that even if you wash it off, it will still leave you... changed. Shall we?Learn more about your ad choices. Visit megaphone.fm/adchoicesIn this episode of Horror Hill, we bring you a terrifying feature-length tale from author Jonathan Wojcik, performed by host and narrator Jason Hill, a story that is the horror fiction equivalent of red meet, fresh off the grill, for Memorial Day. A tale juicy, rare and dripping with fear, USDA stamped and just marginally approved for human consumption. Want a bite?   Learn more about your ad choices. Visit megaphone.fm/adchoicesIn this episode of Horror Hill, we bring you two terrifying tales from authors Stephen Miller and N.M. Brown, performed by host and narrator Jason Hill.Learn more about your ad choices. Visit megaphone.fm/adchoicesIn this episode of Horror Hill, we bring you a terrifying tale from author Michael Paige, performed by host and narrator Jason Hill, which was written exclusively for this program, and which calls to mind our host's dayjob at a hospital, and the odd happenings that can happen during the third shift.Learn more about your ad choices. Visit megaphone.fm/adchoices"}, {"title": "King Falls AM", "episodes": "Hitting your feeds now is a little something from the not-so-distant past (but feels like forever-ago) in FEBRUARY. Come hang out and hopefully forget about these strange days for an hour or so. Recorded February 1st at the wonderful PodUK 2020 in Birmingham, UK, come join Noah, Trent, Eric & Kyle as they take live listener questions, get their cardio for the month during a rambunctious Lipton Lightning Round and write Episode 101 with a little help from their friends. Stay safe, wash those hands, sending love wherever you are!Kyle, Eric, Noah and Trent give a King Falls AM, Make Believe Show & Patreon update in light of COVID-19.FULL SPOILERS!!!Join Trent, Noah, Eric & Kyle for a Beyond The Falls examining Christmas (Baby Please Come Home),  Phase Two & the much-needed hiatus.The Sammy & Ben Show’s 4th Christmas Special. Please stay tuned after the credits.Sheriff Troy gets some much needed help from a new batch of deputies and a certain passage from Death By Damnation has our heroes up in arms.Come watch Beyond The Falls Live: 2 at PodUK 2020, in Birmingham, UK on February, 1st 2020.Additional events include a Meet 'n Greet with Kyle, Eric Noah & Trent, PodUK panels, workshops, and Q&As from King Falls AM, as well as the other esteemed podcasts and speakers."}, {"title": "Atlantic: A Scottish Story", "episodes": "1897 - The end of the year approaches as the island prepares for Hogmanay celebrations and the arrival of John McKenzie, 'The January Man'. Fiadh questions Ms Cameron’s plans for Hirta and Quinn has a decision to make.1963 - Boarding a ferry to Skye, Quinn continues his journey home.Featuring:Kirsty Findlay as Evie MccormickSebastian Lim-Seet and David Hayman as Quinn WhyteBlythe Duff as Fiadh MccormickKate Dickie as Ms CameronJohn Kielty as Carey WhyteLawrence Smith as Arlo MccormickJohn Macaulay as John McKenzieBlair Anderson as Thomas CrawfordEleanor Gilmour as Ferry OperatorAinsley Hamill as The Voice Of HirtaLive Musicians:Sally Simpson, Matthew Howells, Marissa Waite and John KieltyAtlantic: A Scottish Story was written and created by Scott Gilmour & Claire McKenzie.Produced by Noisemaker and The Big Light. For more information about the cast, band and creative team, go to: www.thebiglight.com/atlantic1963 - An islander makes his way home after a lifetime across the sea.1897 - Evie and Quinn prepare for the arrival of a new schoolmistress on Hirta and find a feathered friend in the process. Ms Cameron makes her presence felt in parliament. Carey braces the island for change. Quinn considers his and Evie’s place on Hirta.Featuring:Kirsty Findlay as Evie MccormickSebastian Lim-Seet and David Hayman as Quinn WhyteBlythe Duff as Fiadh MccormickKate Dickie as Ms CameronJohn Kielty as Carey WhyteLawrence Smith as Arlo MccormickAinsley Hamill as The Voice Of HirtaLive Musicians:Sally Simpson, Matthew Howells, Marissa Waite and John KieltyAtlantic: A Scottish Story was written and created by Scott Gilmour & Claire McKenzie.Produced by Noisemaker and The Big Light. For more information about the cast, band and creative team, go to: www.thebiglight.com/atlanticSt Kilda now lies deserted, but it was once home to one of the hardiest and most remarkable communities anywhere in the world. For hundreds of years, islanders endured extraordinary conditions and built a unique society. That was until the 29th August 1930, when the entire island boarded a ship and left. Forever.This series tells that story, through the eyes of two young islanders and the paths they both choose. It's a story about home, heritage and belonging, all stretched across the shores of the Atlantic.Subscribe now to be the first to receive each episode.For more information about Atlantic: A Scottish Story, visit: www.thebiglight.com/atlantic"}, {"title": "A Podcast with Charlie Swenson - To Hell and Back", "episodes": ""}, {"title": "The Randi Rhodes Show", "episodes": ""}, {"title": "Rose Heights Church", "episodes": ""}, {"title": "More Plates More Dates", "episodes": ""}, {"title": "History of Japan", "episodes": "This week, we're traveling the breadth of Japanese history to answer a seemingly simple question: why is it that so very many of us have heard of haiku? What is so special about this style of poetry, and how did it come to have such global appeal? Show notes here.This week, we're covering the transformation of the collapsed LTCB into the revived Shinsei (\"New Life\") Bank, and the motley cast of American investors and Japanese executives who made this once unthinkable financial future a reality. What led to decades of fiscal tradition being scrapped, and what have the impacts of this choice been? Show notes here.This week: a combination of political scandals, tabloid journalism, institutional inertia, and of course the goddamn Swiss lead to the long, slow, death of LTCB. Show notes  here.This week, we're returning to the era of the bubble economy and its aftermath with an up close look at the failure of one of Japan's most prominent banks: the Long Term Credit Bank of Japan, or LTCB. First: how did LTCB dig itself so deeply into an economic hole? Show notes  here.This week, we're wrapping up our month on piracy by looking at how the image of \"Japanese pirates\" became so prevalent in Korea and China, and what we actually know about all the pirating that was going on during this time. Show notes here.This week, we're talking about how Hideyoshi finally tamed Japan's pirates, and why that makes them so hard to understand from a historical perspective. Show notes  here."}, {"title": "Historical Figures", "episodes": ""}, {"title": "Chompers", "episodes": ""}, {"title": "Mojo In The Morning", "episodes": ""}, {"title": "More Mojo Podcast", "episodes": ""}, {"title": "Tabletop Champions - Real Play D&D 5E (DND 5e‪)‬", "episodes": ""}, {"title": "Anime Addicts Anonymous", "episodes": "The Anime Addicts are joined by members of the Jojo's Bizarre Podcast to discuss a bit of Jojo's Bizarre Adventure!  We also have a spirited discussion about vacationing in Japan and finally, we review the anime 86.-------------------------------------------------------Time Markers:-Big News of the Week: 7:40-Main Topic: AAA x JOJO:  20:30-News Break:  57:00-Living Big in Japan:  1:03:30-Review:  86:  1:15:45-------------------------------------------------------You can support the podcast in the following ways:Sign up at: http://www.aaapodcast.com/joinSend a donation at: https://www.aaapodcast.com/donateSign up at Patreon: https://www.patreon.com/AAAPodcastThank you for your generosity and kindness.------------------------------------------------------You can also join our Discord Channel at:https://discordapp.com/invite/jFyUqgk------------------------------------------------------The Anime Addicts announe their selections from the Summer 2021 season!  What 21 animes will we select from Summer for impressions?We also review the isekai epic Re Zero Season 2 Part 2.-------------------------------------------------------Time Markers:-Big News of the Week: 5:00-Main Topic: Summer 2021 Selections:  18:30-News Break:  1:15:00-Review:  Re Zero Season 2 Part 2: 1:20:45-------------------------------------------------------You can support the podcast in the following ways:Sign up at: http://www.aaapodcast.com/joinSend a donation at: https://www.aaapodcast.com/donateSign up at Patreon: https://www.patreon.com/AAAPodcastThank you for your generosity and kindness.------------------------------------------------------You can also join our Discord Channel at:https://discordapp.com/invite/jFyUqgk------------------------------------------------------The Anime Addicts discuss what anime they have been watching!  Some great viewing recommendations for you are in store!We also review the Studio Bones original anime, Sk8 the Infinity.-------------------------------------------------------Time Markers:-Big News of the Week: 6:20-Main Topic: What Have We Been Watching?: 19:20-News Break:  57:40-Caroline's Game Corner:  1:06:20-Mailbag:  1:20:00-Review:  Sk8 the Infinity:  1:26:00-------------------------------------------------------You can support the podcast in the following ways:Sign up at: http://www.aaapodcast.com/joinSend a donation at: https://www.aaapodcast.com/donateSign up at Patreon: https://www.patreon.com/AAAPodcastThank you for your generosity and kindness.------------------------------------------------------You can also join our Discord Channel at:https://discordapp.com/invite/jFyUqgk------------------------------------------------------The Anime Addicts are joined by Spencer from the Blake and Spencer Get Jumped Podcast!  https://linktr.ee/bandsgetjumpedWe discuss a round of Shonen Super Fight in honor of our shonen guest!   The debate gets heated!  Finally, we review the anime Yuru Camp Season 2. --------------------------------------Time Markers:-Big News of the Week: 7:30-Main Topic: Shonen Super Fight:  17:00-News Break:  46:30-Does Mitsugi's Mom Know:  53:15-Mailbag:  56:00-Review:  Yuru Camp Season 2:  1:03:20-------------------------------------------------------You can support the podcast in the following ways:Sign up at: http://www.aaapodcast.com/joinSend a donation at: https://www.aaapodcast.com/donateSign up at Patreon: https://www.patreon.com/AAAPodcastThank you for your generosity and kindness.------------------------------------------------------You can also join our Discord Channel at:https://discordapp.com/invite/jFyUqgk------------------------------------------------------The Anime Addicts mess around with some anime and Japan themed monopoly boards, play a game of Does Mitsugi's Mom Know and review the questionable anime from Winter 2021, Jobless Reincarnation.--------------------------------------Time Markers:-Big News of the Week: 7:45-Main Topic: Anime Monopoly:  22:00-News Break:  1:00:30-Does Mitsugi's Mom Know:  1:08:00-Mailbag:  1:21:45-Review:  Jobless Reincarnation:  1:26:00-------------------------------------------------------You can support the podcast in the following ways:Sign up at: http://www.aaapodcast.com/joinSend a donation at: https://www.aaapodcast.com/donateSign up at Patreon: https://www.patreon.com/AAAPodcastThank you for your generosity and kindness.------------------------------------------------------You can also join our Discord Channel at:https://discordapp.com/invite/jFyUqgk------------------------------------------------------The Anime Addicts talk about the anime Ex-Arm after having suffered through about 25% of it.  Wow.  We also review the anime Horimiya and of course we talk about the death of the much loved manga creator Kentaro Miura.--------------------------------------Time Markers:-Big News of the Week: 7:30-Main Topic: Ex-Armageddon:  24:30-News Break:  55:25-Unexplored Pictures:  1:03:20-Mailbag:  1:10:30-Review:  Horimiya:  1:14:25-------------------------------------------------------You can support the podcast in the following ways:Sign up at: http://www.aaapodcast.com/joinSend a donation at: https://www.aaapodcast.com/donateSign up at Patreon: https://www.patreon.com/AAAPodcastThank you for your generosity and kindness.------------------------------------------------------You can also join our Discord Channel at:https://discordapp.com/invite/jFyUqgk------------------------------------------------------"}, {"title": "Peer to Peer", "episodes": ""}, {"title": "Latest Mixes", "episodes": ""}, {"title": "Joe Bonamassa's Live from Nerdville Podcast", "episodes": ""}, {"title": "Interdependence", "episodes": ""}, {"title": "GSP In The Mix", "episodes": ""}, {"title": "Knowing Faith", "episodes": ""}, {"title": "Bio Eats World", "episodes": ""}, {"title": "The Nurse Practitioner - The Nurse Practitioner Podcast", "episodes": ""}, {"title": "Psychedelics Today", "episodes": ""}, {"title": "The Dark Side Of", "episodes": ""}, {"title": "Radio Ambulante", "episodes": "¿Alguna vez soñaste con conocer a tu dios?  Para los fieles de la Iglesia Maradoniana, hablar con Diego era como subir al cielo. A sus nueve años, Mariano lo vivió de la manera más inesperada y frente a todo su país. Pero eso tendría consecuencias.⇣En nuestro sitio web puedes leer una transcripción del episodio. También preparamos una página con contenido extra para complementar la historia. ⇣Este es el último episodio de la décima temporada. Esperamos que la hayas disfrutado y que las historias hayan sido buena compañía. A partir de la próxima semana inicia la etapa de producción de nuestra undécima temporada. Y queremos que sea una temporada con más episodios. Para eso necesitamos tu ayuda. Súmate hoy a Deambulantes, nuestras membresías. Tu contribución va a financiar directamente las nuevas historias y nos va a permitir publicar más de ellas al año. ¡Gracias por apoyarnos!⇣Aunque Radio Ambulante estará en modo producción, te recomendamos escuchar El hilo, nuestro segundo podcast. Seguiremos publicando nuevos episodios todos los viernes, contando la historia detrás de las noticias más urgentes de la región.La historia del secuestro aéreo más largo y asombroso de América Latina.  En los setenta, secuestrar aviones en Colombia era una tarea fácil. Tanto que ya era rutina: los pilotos no se sorprendían ni la tripulación oponía resistencia. Pero el secuestro del vuelo HK-1274 se salió de control y tuvo en suspenso a todo el continente.⇣En nuestro sitio web puedes leer una transcripción del episodio. ⇣Quedan pocos cupos para la primera #FiestaRadioAmbulante de 2021. Son las mejores fiestas del ciberespacio: confírmalo con alguna de las miles de personas que han bailado en las anteriores. Puedes registrarte aquí. ⇣Si te has preguntado cómo puedes ayudar a Radio Ambulante, te invitamos a que conozcas Deambulantes, nuestras membresías. Tu donación, no importa el monto, nos permitirá avanzar en la producción de la próxima temporada. Y si no puedes hacer una contribución económica en este momento, puedes ayudarnos muchísimo recomendándole nuestras historias a quienes todavía no nos escuchan. Queremos llegar a un millón de reproducciones en abril y tu ayuda nos permitirá alcanzarlo. ¡Gracias!Cuando era niña, Lidia soñaba con ver el mundo desde la cima de una montaña. Pero no sería fácil para una mujer aymara como ella.  Históricamente, a las indígenas en Bolivia no se les ha permitido hacer muchas cosas. Entre ellas, escalar montañas. Pero un grupo de cinco mujeres aymaras se propuso lograrlo.⇣En nuestro sitio web puedes leer una transcripción del episodio. ⇣El próximo sábado 24 de abril haremos la primera #FiestaRadioAmbulante del año. Si quieres conectarte con miles de ambulantes en todo el mundo a escuchar y bailar la mejor música latinoamericana, regístrate acá. Son cupos limitados.Quizá ya nadie recuerde que hubo un día en que El Salvador amaneció casi sin muertos. Un día de 2012, El Salvador no tuvo homicidios. Los índices de violencia eran tan altos que 24 horas sin asesinatos era como si amaneciera sin sol. Por eso nadie se explicaba cómo, de repente, el conflicto eterno entre pandillas se redujo y el país tuvo una temporada casi sin muertos.Esta es una coproducción entre Radio Ambulante y El Faro. ⇣En nuestro sitio web puedes leer una transcripción del episodio. ⇣Nuestra décima temporada está llegando a su final y desde ya estamos preparando la que sigue. Únete hoy a la comunidad de Deambulantes y ayúdanos a seguir haciendo el mejor periodismo en audio en español. En tus manos está la sostenibilidad y la independiencia de Radio Ambulante. ¡Gracias desde ya!Alexis Figueroa está dispuesto a hacer lo que para muchos sería impensable con tal de conseguir el autógrafo de una celebridad.  En este episodio lo seguimos en su intento de conseguir el que le falta: la firma de una estrella de rock en franca decadencia que se la he escapado por más de una década.  ¿Lo logrará o se estrellará en el intento? ⇣ En nuestro sitio web puedes leer una transcripción del episodio. Or you can also read this English translation.⇣Únete hoy a Deambulantes y ayúdanos a costear el periodismo que hacemos. Puedes contribuir desde un dólar y permitir que sigamos contando historias desde toda la región. ¡Gracias en nombre de todo el equipo!A Carolina nunca le había gustado el fútbol, pero estaría en medio de un caso que conmocionó al deporte en su país.  Carolina Rozo empezó su trabajo como fisioterapeuta en la sub-17 de la selección femenina de Colombia pensando que era la oportunidad de su vida. Pronto se dio cuenta que no iba a ser lo que esperaba.⇣En nuestro sitio web puedes leer una transcripción del episodio. ⇣Súmate hoy a Deambulantes, nuestras membresías. Puedes contribuir desde un dólar y recibirás a cambio un año de beneficios especiales. Pero lo más importante: gracias a tu apoyo podremos producir nuevos episodios y mantener Radio Ambulante gratuito para que cualquier persona en el mundo pueda disfrutarlo. ¡Gracias!"}, {"title": "Be There in Five", "episodes": "A personal update from Kate, your resident Childless Millennial. TW: infertility, miscarriage.—Support our sponsors:Allform is offering 20% off all orders for our listeners at Allform.com/bethereinfiveGo to Framebridge.com and use promo code BETHEREINFIVE to save an additional 15% off your first orderGet 10% off your first order with my promo code BETHEREINFIVE at OSEAmalibu.comIn this second installment, Kate reads hilarious, heartbreaking, and sometimes traumatizing stories from listeners' most memorable summers at Church camps, suburban pools, and more. Enjoy!patreon.com/bethereinfiveFollow Kate on instagram at instagram.com/bethereinfiveSUPPORT OUR SPONSORSAs a listener, you’ll get 10% off your first month by visiting BetterHelp.com/bethereinfiveTo experience the best sheets you’ve ever felt, choose Boll & Branch. You can try them worry-free for 30 nights, with free shipping and returns. And my listeners get an exclusive 15% off your first set of sheets with promo code bethereinfive at bollandbranch.com.Start feeling better with Feals. Become a member today by going to Feals.com/bethereinfive and you'll get 50% off your first order with free shippingGo to Nutrafol.com and entering the promo code BETHEREINFIVE to save FIFTEEN DOLLARS OFF your first month’s subscription plus FREE shipping on EVERY order-- this is their best offer ANYWHERE and it is only available to US customers for a limited timeThis week, Kate shares her own musings along with listener stories about all things nostalgic summertime. Primarily focused on suburban pool culture and summer camp tales, these stories made her laugh, cry, gasp, and long for simpler times when her only agenda was to eat snack bar chicken tenders, scope for megahotties, and wait for a hot summer's day to melt into a thunderstormy afternoon complete with sandwiches, dry clothes, and the Disney channel. Fair warning, a lot of the camp stories are quite religious and intense, but would you expect a Beth's version of a hot girl summer from yesteryear to be any different? Enjoy!SUPPORT OUR SPONSORS:Back by popular demand, receive Bacon for Life! Right now, new members can get bacon for life when they sign up. Just go to ButcherBox.com/BETHEREINFIVECLEAR is the absolute BEST way to help you get back to what you love! They have locations in over 35 airports across the country making it safer, easier, and. faster to reunite with loved ones or take that much-needed vacation. It works great with Pre-Check, too! And right now, for a limited time, you can get your first two months of CLEAR for FREE.  Go to CLEARme.com/BETHEREINFIVE and use code BETHEREINFIVEHelix is offering up to $200 dollars off ALL mattress orders AND 2 free pillows for our listeners at HelixSleep.com/BETHEREINFIVERitual is offering my listeners 10% off during your first 3 months. Visitritual.com/BETHEREINFIVE to start your Ritual todayThis week, Kate’s sister is live for the first time from her new place in sunny California and they have a fun, lighthearted convo about nostalgia and pop culture that covers the following topics:90s bedroom decor, Spencer Gifts coutureThe coolest cars as a teenagerStorm chasing career ambitions inspired by tornado moviesInfluencers & tumbler/adult sippy cups sweeping the nationA questionable segment going through the notes app in our phonesKelly’s drafts of Bumble repliesThe phenomenon of “Dirty Sodas” in UtahGoing undercover to an Herbalife loaded tea nutrition shopGhost KitchensGoing through our search historyBethenny’s HBO showFriends ReunionKUWTKMaking Kelly guess if lyrics are country or written by KateKelly’s advice on life & career as a type A gal on a type Be showAnd so much more! Enjoy!FOLLOW KATE: instagram.com/bethereinfiveTickets go live tomorrow for new live show in Chicago, Track Five  on July 24- check Kate’s instagram at 12 CST, Patreon pre-sale at 11 CST (patreon.com/bethereinfive)SUPPORT OUR SPONSORSAs a listener, you’ll get 10% off your first month by visiting BetterHelp dot com slash bethereinfiveOrder online and get 25% off when you go to LIQUID IV DOT COM and use code BETHEREINFIVE at checkout.Allform is offering twenty percent off all orders for our listeners at Allform.com/bethereinfiveExplore your creativity at Skillshare.com/BETHEREINFIVE and get a free trial of Premium Membership!Source for Stanley cup segment:https://shopthebuyguide.com/blog//the-story-of-the-cupIn part 2 of this quarter's series where Kate answers listener voicemails, she covers a lot of ground with a wide range of topical depth. This episode covers:-A discussion of the 'Troubled Teen' industry and the under the radar abuse of boot camps/wilderness therapy camps/conversion therapy programs that con parents into thinking that legitimate therapeutic treatment is being provided to their children.-An overview of what happened with Chrissy Teigen & Courtney Stoddard and a diatribe about the complexities and propaganda of cancel culture vs. general accountability-A nostalgic detour through official hot girl shoes at different points in Kate's life (remember when Sambas were like Loubs?)-Lauren Conrad: Mob boss or BFF? A thinkpiece on the term 'loyalty' on reality television-True Life: A listener called into the real Delilah. This is her story.-Then, an answer that is so long, half is (already recorded) and needs to be put on Patreon, where Kate responds to a 2 part voicemail from a listener struggling with purpose, contentment, comparison, job satisfaction, and ongoing disappointment due to deviating from their original goals in life. Enjoy!Stay tuned for the overflow content on patreon this weekend: patreon.com/bethereinfiveFollow kate on instagram: instagram.com/bethereinfiveHOTLINE: 312.379.9676SUPPORT OUR SPONSORS:Helix is offering up to $200 dollars off ALL mattress orders AND 2 free pillows for our listeners atHelixSleep.com/BETHEREINFIVE.Go to HelloFresh.com/bethereinfive12 and use code bethereinfive12 for 12 free meals, including free shipping!You can try OSEA risk-free for 30 days and get free shipping on orders over $50. They even send free samples with every order! Get 10% off your first order with my promo code BETHEREINFIVE at OSEAmalibu.com.Go to Zocdoc.com/BETHEREINFIVE and download the Zocdoc app to sign-up for FREE and book a top-rated doctor.WORKS CITED:https://www.youthrights.org/issues/medical-autonomy/the-troubled-teen-industry/https://www.hrc.org/resources/the-lies-and-dangers-of-reparative-therapyhttps://www.thetrevorproject.org/get-involved/trevor-advocacy/50-bills-50-states/about-conversion-therapy/https://www.thecut.com/2021/05/courtney-stodden-chrissy-teigen-told-me-to-kill-myself.htmlhttps://www.fastcompany.com/3057545/why-millennial-women-are-burning-outhttps://www.buzzfeednews.com/article/annehelenpetersen/millennials-burnout-generation-debt-workA two part episode! This week, Kate had so many interesting voicemails, she broke it up into two parts. In part 1, she answers some of the lighter fare, such as:-How would she define a Hot Girl Summer? and other musings about the pursuit of hotness in our youth, feat. yet another country music tangent.-How does she feel about Swifties calling Olivia Rodrigo a snake because she sent a PR package to Kim K?-Where the hell do you make real friends as an adult? How does she feel about shopping dates? feat. an unsolicited dressing room soliloquy-What's her dream fictional tv/movie location for a dinner party and the corresponding dream fictional cast? feat. an inevitable Gilmore Girls tangent-What's the deal with women who with public platforms being accused of attention-seeking behavior?-Does Kate know she's perpetuated Country Apple erasure in the context of B&BW scents?-Tune in for part 2 as she tackles heavier topics, e.g. the troubled teen industry, MOH drama, feelings of failure, Chrissy Teigen, managing parental expectations, and more! SUPPORT OUR SPONSORSTo get 15% off your next gift, go to UNCOMMONGOODS.com/bethereinfive. Don’t miss out on this limited time offer! Uncommon Goods. As a listener, you’ll get 10% off your first month by visiting BetterHelp.com/bethereinfiveGo to Framebridge.com and use promo code BETHEREINFIVE to save an additional 15% off your first order.Support our show by going to Nutrafol.com and entering the promo code BETHEREINFIVE to save FIFTEEN DOLLARS OFF your first month’s subscription plus FREE shipping on EVERY order"}, {"title": "IN HINDZSIGHT", "episodes": ""}, {"title": "The Pat McAfee Show 2.0", "episodes": ""}, {"title": "radiofreeredoubt", "episodes": ""}, {"title": "The RTFM Show‪!‬", "episodes": ""}, {"title": "The Clearing", "episodes": ""}, {"title": "LOVE MURDER", "episodes": ""}, {"title": "Kingpins", "episodes": ""}, {"title": "Secret Societies", "episodes": ""}, {"title": "On the Media", "episodes": "It's been noted that Trump’s Big Lie and the violence it produced is reminiscent of the Lost Cause of the Confederacy — a potent narrative of grievance after the Civil War recasting the South’s stand as heroic and patriotic. Undergirded by racism, the Lost Cause apologia would stymie Reconstruction, justify decades of lynching and throughout the South, and prove as impossible to uproot as Kudzu.When it comes to art identified with the Lost Cause of the Confederacy, “The Night They Drove Old Dixie Down” by The Band may be pop culture’s most celebrated, and misunderstood, contribution. Despite its charged subject matter, the song is rock-and-roll canon, listed as one of the best of all time by Time Magazine and Rolling Stone.On paper, its lyrics read as if lifted from the Lost Cause playbook: a nostalgic retelling of the end of the Civil War history seen through the eyes of a downtrodden Southern farmer, laden with grief but not a trace of white supremacy. But the song is not what it seems, or what it seemed when it was first loosed upon the world. The Band’s lead guitarist Robbie Robertson, a Canadian, hadn’t logged much time in the South when he penned “The Night They Drove Old Dixie Down” in 1969. But in the ensuing decades, some have claimed it as a Neo-Confederate anthem. This uncomfortable fact led Early James, a songwriter from Alabama, to alter the lyrics when he performed the song at an annual The Band tribute concert last summer. Inspired by last summer's racial reckoning, James sang about toppling Confederate monuments. According to Jack Hamilton, Slate pop critic and author of Just Around Midnight: Rock and Roll and the Racial Imagination, the meaning behind the song is both more and less complex than many fans know.June 28th marks the anniversary of a mass shooting that took place inside a newsroom in Annapolis, Maryland, killing five journalists. On this week's On the Media, an intimate portrait of the staff of the Capital Gazette in the immediate aftermath of the death of their colleagues — and then over the next several years as they contend with a corporate takeover, buyouts, and the loss of their newsroom. Reported by Chris Benderev of NPR's Embedded.Part 1: The Attack. Listen.Part 2: The Aftermath. Listen.Part 3: The Layoffs. Listen.Music in this week's show:Time Is Late — Marcos Ciscar feat. Joakim JohanssonWe Insist — Zoë KeatingIn the 1800s, New Bedford, Massachusetts was the world’s “center of whaling.” More than half of the world’s whaling ships in the 1840s came from New Bedford. The small city was so emblematic of a New England whaling town that it served as the setting for Herman Melville’s novel Moby Dick. According to the New York Times, it was then the richest city per capita on the continent.  Now, more than a fifth of its approximately 95,000 citizens live in poverty. But this exceptional historic town is representative of a phenomenon happening in small towns across the United States. It’s local daily newspaper, The Standard-Times, has been bought by Gannett, a hedge fund-backed news conglomerate and stripped down to barebones. It’s become what’s known as a “ghost newspaper,\" called such for its trimmed down staff and scant original reporting. The mayor of New Bedford was quoted in the New York Times saying: “It used to be that I couldn’t sneeze without having to explain myself. Now, I have to beg people to show up at my press conferences. Please, ask me questions!” A year and a half ago, a small group of concerned community members gathered to try to address this dearth of local journalism. The result? A new, non-profit news outlet called The New Bedford Light. Brooke talks to Barbara Roessner, the founding editor of The New Bedford Light, about the challenges facing the fledgling outlet and the benefits that local journalism brings to the civic health of a community.New reports show that the Trump Department of Justice spied on reporters. But that’s just a small part of a much longer story, going back decades. This week, we examine when and why the government surveils journalists. And, following their first meeting this week, is there a headline beyond “Putin and Biden talked to each other?” Plus, on the 50th anniversary of the Pentagon Papers, how the story’s biggest lessons were lost to time. 1. Alexey Kovalev [@Alexey__Kovalev], investigative editor at Meduza, on what Russian and American media got right and wrong about Putin and Biden's first meeting. Listen.2. Matt Apuzzo [@mattapuzzo], New York Times reporter, on how the government seizes journalists’ records and chills speech under guise of protecting national security. Listen.3. Kurt Andersen [@KBAndersen], host of Nixon At War, says Watergate might have been Nixon's downfall, but the Vietnam War was his real undoing. Listen.4. The late Les Gelb, the man who supervised the team that compiled the Pentagon Papers, explains how the media misinterpreted the documents. Listen.Music:Tymperturbably Blue by Duke EllingtonFergus River Roundelay by Gerry O’BeirneWhispers of a Heavenly Death by John ZornTrance Dance by John ZornMiddlesex Times by Michael AndrewsTribute to America (Medley) by The O’Neill Brothers GroupOver the last couple of weeks we’ve taken on some of the battles in the ongoing culture war. The granddaddy of them all is cancel culture. Michael Hobbes, co-host of the podcast You’re Wrong About, told us that there isn’t a situation that has been labeled a cancellation that couldn’t benefit from a more accurate word to describe what had happened. So and so was fired...such and such was met with disagreement on twitter. Cancel need not apply.He also explained on his own podcast with Sarah Marshall that there were a few pivotal events along the way that led to the term cancel culture becoming the moral panic that it is today. One of them was the 2015 release of Jon Ronson’s book “So You’ve Been Publicly Shamed.” A series of case studies of people who were canceled before we started using that word.Trump may be out of office, but the GOP's campaign to limit voting rights, free speech, and reproductive rights is still in full-swing. On this week’s On the Media, where do you focus your attention when there are little fires everywhere? Plus, a look at a chilling new look for America: the \"authoritarian mullet\" — culture war in the front, the destruction of democracy in the back. And, how critical race theory became a right-wing bogeyman. 1. Jay Rosen [@jayrosen_nyu], professor of journalism at New York University and media critic for PressThink, on why journalists should still be in \"emergency mode.\" Listen.2. Jake Grumbach [@JakeMGrumbach], assistant professor of political science at the University of Washington, on how Republican state lawmakers reduce \"democratic performance\" when they take power. Listen.3. Ryan P. Delaney [@rpatrickdelaney], education reporter for St. Louis Public Radio, on a Missouri school district's debate over Critical Race Theory, and Adam Harris [@AdamHSays], staff writer at The Atlantic, on how conservatives constructed the critical race theory boogeyman. Listen.Music:Little Motel - Modest Mouse Auld Lang Syne  - Salsa Celtica L’Illusionista - Nino Rota  Paperback Writer - Quartetto d'Archi Dell'orchestra Sinfonica di Milano Guiseppe VerdiMilestones - Bill Evans TrioGoing Home - Hank Jones & Charlie Haden  (post at 2:24 or 3:07)Quizás, Quizás, Quizás - Ramón Solé (back time this)In the Bath - Randy Newman"}, {"title": "Hold The Line Podcast", "episodes": ""}, {"title": "American Conservative University", "episodes": ""}, {"title": "Today in Focus", "episodes": "A legal arrangement set up in the wake of a mental health crisis has left Britney Spears with little control of her personal or professional affairs. Laura Snapes and Sam Levin describe how she’s challenging the situation in court. Help support our independent journalism at theguardian.com/infocusApple Daily was a beacon of free speech. Now it has been forced to close by China’s sweeping national security law. Does its demise signal a new chapter in Hong Kong?. Help support our independent journalism at theguardian.com/infocusMaya Wolfe-Robinson visits the Labour-held West Yorkshire seat of Batley and Spen, which votes in an increasingly heated byelection tomorrow. Help support our independent journalism at theguardian.com/infocusBoris Johnson has a new health secretary this week after the resignation of the man tasked with leading the government’s Covid response. But there are plenty of unanswered questions, says Jonathan Freedland. Help support our independent journalism at theguardian.com/infocusHarriet Gibsone tells the scary, sad, and surprisingly funny story of going through early menopause – and hoping for a baby. Help support our independent journalism at theguardian.com/infocusFrom a leadership fiasco to the ‘sausage wars’, the Democratic Unionist party’s stance on Brexit has forced it to contend with a new – perhaps even existential – set of problems. What will they mean for the region’s future?. Help support our independent journalism at theguardian.com/infocus"}, {"title": "Worldly", "episodes": "A special repost from the folks at Today, Explained! While the Worldly team is out enjoying the holiday weekend in the States, TEX host Sean Rameswaram helps walk you through what’s going with Brexit right now — chatting with The Atlantic’s Tom McTague about where things are at right now in the UK/EU divorce. They explain (among other things) why it’s taking so look, how Prime Minister Boris Johnson has handled certain things well, and how it’s inflaming old tensions in Northern Ireland.Learn more about your ad choices. Visit podcastchoices.com/adchoicesZack, Jenn, and Alex discuss the European soccer dustup over Hungary’s new anti-LGBTQ law. They explain what the Hungarian law does, how the country’s increasingly authoritarian leader Viktor Orbán is using it — and soccer — to further his anti-democratic political aims, why the EU opposes the measure so strongly, and how all of this spilled over into Europe’s marquee soccer tournament. Also, the Worldly team says goodbye to Alex.References:The Guardian explains Hungary’s anti-LGBTQ law.Alex wrote for Vox about how the Germany-Hungary soccer match highlighted the European fight over the law.The Conversation notes that Orbán’s government is pushing anti-LGBTQ issues to shore up support for next year’s election.The New York Times writes that the ongoing continental spat over the law is turning into a culture war.You can find out more about what George Orwell said about sports and politics at the Orwell Foundation.Here's the Washington Post piece piece Zack read from.And this is the Hungarian Conservative article Zack cited.Jenn recommends listening to this On Point episode about Hungary and the decline of democracy.Hosts:Zack Beauchamp (@zackbeauchamp), senior correspondent, VoxJennifer Williams (@jenn_ruth), senior foreign editor, VoxAlex Ward (@AlexWardVox), senior reporter, White House, VoxConsider contributing to Vox:If you value Worldly’s work, please consider making a contribution to Vox:bit.ly/givepodcastsMore to explore:Subscribe for free to Today, Explained, Vox’s daily podcast to help you understand the news, hosted by Sean Rameswaram.About Vox:Vox is a news network that helps you cut through the noise and understand what's really driving the events in the headlines.Follow us:Vox.comNewsletter: Vox SentencesLearn more about your ad choices. Visit podcastchoices.com/adchoicesZack, Jenn, and Alex discuss President Joe Biden’s big trip to Europe, where he met with the other leaders of the G7 and NATO countries as well as with Russian President Vladimir Putin. The gang examine what Biden actually accomplished on his trip, discuss the furor that erupted on Political Science Twitter over a comment Biden made during a press conference, and debate whether the Putin meeting was as important as the media hype made it out to be. Also, Worldly makes an important announcement.References:If you want to look at all the fact sheets from Biden’s Europe trip, it’s worth perusing the White House’s Briefing Room website.Alex wrote about the perils of the Biden-Putin summit and the big bet Biden made.And here’s the tweet Alex sent, where you can then see the reactions from political scientists.It’s worth looking back at this past Vox piece on the 2018 G7.Back in 2018, Zack wrote a good Vox piece on America’s alliances.Hosts:Zack Beauchamp (@zackbeauchamp), senior correspondent, VoxJennifer Williams (@jenn_ruth), senior foreign editor, VoxAlex Ward (@AlexWardVox), senior reporter, White House, VoxConsider contributing to Vox:If you value Worldly’s work, please consider making a contribution to Vox: bit.ly/givepodcastsMore to explore:Subscribe for free to Today, Explained, Vox’s daily podcast to help you understand the news, hosted by Sean Rameswaram.About Vox:Vox is a news network that helps you cut through the noise and understand what's really driving the events in the headlines.Follow us:Vox.comNewsletter: Vox SentencesLearn more about your ad choices. Visit podcastchoices.com/adchoicesNow & Then is a new podcast from CAFE hosted by award-winning historians Heather Cox Richardson and Joanne Freeman. Every Tuesday, Heather and Joanne use their encyclopedic knowledge of US history to bring the past to life. Together, they make sense of the week in news by discussing the people, ideas, and events that got us here today.Learn more: https://cafe.com/now-and-then/Listen on Spotify: https://open.spotify.com/show/6wDS3Y2t0RyQ3ncCUxiNs6?si=nx7w7exNRZ-AWHLv9T1qZg&dl_branch=1Listen on Apple: https://podcasts.apple.com/us/podcast/id1567665859Learn more about your ad choices. Visit podcastchoices.com/adchoicesZack and Jenn talk about the horrifying discovery of the remains of 215 children at a so-called “residential school” in Canada. They talk about the history of these schools, which were a centerpiece of Canada’s long-running effort to wipe out Indigenous culture and identity, and how the discovery of the children’s bodies is forcing a political reckoning with this history among white Canadians. Then they compare how Canada is handling this issue to the way that other countries like the US, Germany, and Japan have dealt with their own histories of atrocity — and how that shapes both politics inside those countries and their relations with other states today.References:You can read the final report from Canada’s Truth and Reconciliation Commission here or on the Commission’s website, where you can find additional information and resources on the commission and the residential school system, including more about the Missing Children Project.And here are the 94 “calls to action” from the report, if you want to check those out in particular. This is the op-ed by Jody Wilson-Raybould that Zack mentioned.This is the infamous 1892 “Kill the Indian...save the man” speech by Richard Pratt, the US military officer who founded the Indian Industrial School at Carlisle, Pennsylvania, which became a model for similar forced-assimilation schools in the US and Canada.Here’s more on the lawsuit seeking reparations for the cultural impact of the residential schools, which the Canadian government is currently fighting against.And here’s more on the Pope’s comments about the discovery at the Kamloops school, which notably do not include an apology for the Catholic church’s role in running that and many of the other residential schools.Jenn mentioned the “birth alerts” that were only ended in British Columbia in 2019. You can read more about that here. This is a good article contrasting Germany’s and Japan’s national approaches to reconciling with their past atrocities. And here’s more about the ongoing tensions between Japan and South Korea over Japan’s wartime use of Korean sex slaves known as “comfort women.”  You can read the full text of the bill apologizing “to all Native Peoples on behalf of the United States,” which President Barack Obama quietly signed into law in 2009, here, and read more about why many were disappointed by it here and here. And you can read the report from the Maine Wabanaki-State Child Welfare Truth & Reconciliation Commission here. Hosts:Zack Beauchamp (@zackbeauchamp), senior correspondent, VoxJennifer Williams (@jenn_ruth), senior foreign editor, VoxAlex Ward (@AlexWardVox), White House reporter, VoxConsider contributing to Vox:If you value Worldly’s work, please consider making a contribution to Vox: bit.ly/givepodcastsMore to explore:Subscribe for free to Today, Explained, Vox’s daily podcast to help you understand the news, hosted by Sean Rameswaram.About Vox:Vox is a news network that helps you cut through the noise and understand what's really driving the events in the headlines.Follow us:Vox.comNewsletter: Vox SentencesLearn more about your ad choices. Visit podcastchoices.com/adchoicesZack, Jenn, and Alex discuss the political earthquake happening in Israel that could soon see longtime Prime Minister Benjamin Netanyahu ousted from power by a shaky coalition of far-right, centrist, leftist, and Islamist parties. They explain how this unlikely coalition came together, why it could easily fall apart, and what the possible end of the Netanyahu era means for the future of Israel and its conflict with the Palestinians.References:Zack wrote a piece for Vox in 2020 about the war on Israeli democracy.You can find the Yair Lapid quote Alex read over at Foreign Policy.The Times of Israel has a good (and short!) profile of Naftali Bennett.The Associated Press reports the coalition wants a quick vote to confirm the government.Haaretz has a smart piece on how Netanyahu unwittingly sowed the seeds of his political demise.Politico featured a piece by experts detailing what the new Israeli government could mean for US President Joe Biden.The Jerusalem Post features the comment Jenn mentioned, where Bennett talks about killing Arabs.Hosts:Zack Beauchamp (@zackbeauchamp), senior correspondent, VoxJennifer Williams (@jenn_ruth), senior foreign editor, VoxAlex Ward (@AlexWardVox), White House reporter, VoxConsider contributing to Vox:If you value Worldly’s work, please consider making a contribution to Vox: bit.ly/givepodcastsMore to explore:Subscribe for free to Today, Explained, Vox’s daily podcast to help you understand the news, hosted by Sean Rameswaram.About Vox:Vox is a news network that helps you cut through the noise and understand what's really driving the events in the headlines.Follow us:Vox.comNewsletter: Vox SentencesLearn more about your ad choices. Visit podcastchoices.com/adchoices"}, {"title": "The World and Everything In It", "episodes": ""}, {"title": "Sermons – Voddie Baucham Ministries", "episodes": ""}, {"title": "The Potter's House At One LA", "episodes": ""}]