[{"title": "Pure Trance Radio Podcast with Solarstone", "producer": "This Is Distorted", "genre": "Music", "rating": 4.7, "num_ratings": 214, "num_episodes": 324, "description": "A weekly podcast of progressive and uplifting Pure Trance music, presented by Solarstone.", "link": "https://podcasts.apple.com/us/podcast/pure-trance-radio-podcast-with-solarstone/id270338166"}, {"title": "The Joe Budden Podcast", "producer": "The Joe Budden Network", "genre": "Music", "rating": 4.6, "num_ratings": 5600, "num_episodes": 207, "description": "Tune into Joe Budden and his friends. Follow along the crazy adventures of these very random friends.", "link": "https://podcasts.apple.com/us/podcast/the-joe-budden-podcast/id1535809341"}, {"title": "The Vinyl Guide", "producer": "The Vinyl Guide", "genre": "Music", "rating": 4.7, "num_ratings": 339, "num_episodes": 294, "description": "Nate is a record collector, music lover and vinyl maniac. Join him on his journey to discuss, share and review all things related to vinyl records. We feature stories about and interviews with musicians, artists and people of knowledge in the area of vinyl records. Additionally we share information on desirable pressings of records, how to tell a $5 pressing from a $500 pressing and care and maintenance for your cratedigging hobby.  Subscribe and share with your record-nerd friends. Cheers!", "link": "https://podcasts.apple.com/us/podcast/the-vinyl-guide/id1048766030"}, {"title": "Rolling Stone Music Now", "producer": "Rolling Stone", "genre": "Music", "rating": 4.1, "num_ratings": 659, "num_episodes": 270, "description": "The writers and editors of Rolling Stone take you inside the biggest stories in music. Featuring interviews with our favorite artists; what's playing in the office; expert insight on the week's biggest music news; and much more.", "link": "https://podcasts.apple.com/us/podcast/rolling-stone-music-now/id1078431985"}, {"title": "Don Diablo Presents Hexagon Radio", "producer": "This Is Distorted", "genre": "Music", "rating": 4.9, "num_ratings": 261, "num_episodes": 333, "description": "Join Don Diablo and his little electronic buddy Hex for a weekly journey in to the unknown.. Playing an eclectic selection of music from the best new house to the whole spectrum of electronica, Hexagon Radio is a 60min sonic adventure full of exclusive ReHex tracks, Flashback classics and a showcase for new talent in #DemoDay.", "link": "https://podcasts.apple.com/us/podcast/don-diablo-presents-hexagon-radio/id963859436"}, {"title": "Say Less With Kaz, Lowkey and Rosy", "producer": "Kazeem Famuyide", "genre": "Music", "rating": 4.8, "num_ratings": 224, "num_episodes": 105, "description": "\"Say Less\" Is a life, sports, music, and culture podcast hosted by Kazeem Famuyide, Nile \"Lowkey\" Ivey and Rosy.", "link": "https://podcasts.apple.com/us/podcast/say-less-with-kaz-lowkey-and-rosy/id1503772303"}, {"title": "Rock N Roll Archaeology", "producer": "Osiris Media", "genre": "Music", "rating": 4.8, "num_ratings": 165, "num_episodes": 20, "description": "An episodic overview of the history of Rock Music. Think of it as a college level Rock N Roll 101 course...or if you prefer, a multi-part audio documentary. We take in the music, culture and technology of the second half of the 20th Century to prove how significant and how much impact this art movement had to the times, while still resonating today. It’s carefully researched, fully scripted and highly produced...a little bit academic in tone, because we do our homework. But we throw in a lot of fun too: music, storytelling, commentary and quotes, lots of sound design. The series is presented in chronological order, and we take our time making these, really trying to get the history right. Rock N Roll Archaeology is the world's first HD Podcast and a proud part of Pantheon - the podcast network for music lovers.", "link": "https://podcasts.apple.com/us/podcast/rock-n-roll-archaeology/id1448931658"}, {"title": "The Imbalanced History of Rock and Roll", "producer": "The Imbalanced History of Rock and Roll", "genre": "Music", "rating": 4.6, "num_ratings": 52, "num_episodes": 124, "description": "This is a podcast that was created to discuss the humongous tree of music known as Rock and Roll. There are thousands of branches. There is so much information out there with even more to be learned. Together, we are going to have fun talking about our passion, the Imbalanced History of Rock and Roll. Between Ray and Markus, we have 50+ years of rock and roll radio experience and a thirst to know more! With your input we want to begin to balance the imbalanced. We look forward to connecting and sharing with you as we dig deep into the music. Proud part of Pantheon - the podcast network for music lovers.", "link": "https://podcasts.apple.com/us/podcast/the-imbalanced-history-of-rock-and-roll/id1456552351"}, {"title": "The Harry Styles Podcast", "producer": "The Harry Styles Podcast", "genre": "Music", "rating": 4.7, "num_ratings": 110, "num_episodes": 10, "description": "Welcome to The Harry Styles Podcast! If you miss Harry's voice, this is your place. Interviews, live performances, covers, acoustic songs, ASMR and more.", "link": "https://podcasts.apple.com/us/podcast/the-harry-styles-podcast/id1541212650"}, {"title": "Hit Parade | Music History and Music Trivia", "producer": "Slate Magazine", "genre": "Music", "rating": 4.8, "num_ratings": 1500, "num_episodes": 87, "description": "What makes a song a smash? Talent? Luck? Timing? All that—and more. Chris Molanphy, pop-chart analyst and author of Slate’s “Why Is This Song No. 1?” series, tells tales from a half-century of chart history. Through storytelling, trivia and song snippets, Chris dissects how that song you love—or hate—dominated the airwaves, made its way to the top of the charts and shaped your memories forever.", "link": "https://podcasts.apple.com/us/podcast/hit-parade-music-history-and-music-trivia/id1291058235"}, {"title": "Songwriter Theory: Learn Songwriting And Write Meaningful Lyrics and Songs", "producer": "Joseph Vadala", "genre": "Music", "rating": 4.4, "num_ratings": 28, "num_episodes": 140, "description": "Let's learn songwriting! Learn to write impactful and meaningful songs by writing great melodies, lyrics that move your listeners, and arrangements and chord progressions that evoke the right emotions.Do you want to write emotional and powerful melodies? Learn to write incredible melodies, regardless of your musical background.Do you wish you could write incredible lyrics that move your listeners? Learn how to write great lyrics that are worthy of being framed and hung up on your wall.Want to make full, rich arrangements that sound fully professional? Learn how to arrange in a way that makes your song shine.Do you sometimes have trouble finding inspiration or staying productive? Learn how to find, maintain and regain inspiration as well as remain productive in your creative processes.Do you ever get overwhelmed by songwriting?Do you find yourself getting into creative ruts?Do you wish your songwriting efficiency was better?If you want asimpleguide to learn to get past the overwhelm of songwriting, thisshow is for you!So let's learn how to songwrite with music theory, lyric writing, creative productivity, inspiration, and more!Anyone who's ever had feelings or thoughts can become a songwriter, so let's dive deep into our inner creator and learn how to write songs!If you want to dive even deeper, gograb my free guide on 10 proven ways to start writing a song in under an hour here: http://songwritertheory.com/free-guide/", "link": "https://podcasts.apple.com/us/podcast/songwriter-theory-learn-songwriting-write-meaningful/id1446684931"}, {"title": "Lost Notes", "producer": "KCRW", "genre": "Music", "rating": 4.7, "num_ratings": 570, "num_episodes": 33, "description": "A collection of the greatest music stories never told. This season the poet and cultural critic Hanif Abdurraqib explores a single year: 1980 - the brilliant, awkward and sometimes heartbreaking opening to a monumental decade in popular music.", "link": "https://podcasts.apple.com/us/podcast/lost-notes/id1368608676"}, {"title": "AOKI'S HOUSE", "producer": "Steve Aoki", "genre": "Music", "rating": 4.6, "num_ratings": 263, "num_episodes": 406, "description": "Acclaimed DJ and producer Steve Aoki hosts his own electronic dance music podcast featuring all the latest hot dance tracks.", "link": "https://podcasts.apple.com/us/podcast/aokis-house/id575308520"}, {"title": "Deep Energy Podcast", "producer": "Jim Butler", "genre": "Music", "rating": 4.1, "num_ratings": 600, "num_episodes": 624, "description": "Deep Energy Podcast is a podcast of ambient and new age music for Sleep, Meditation, Relaxation, Massage, Yoga, Reiki and Therapy.", "link": "https://podcasts.apple.com/us/podcast/deep-energy-podcast/id511265415"}, {"title": "Dad Bod Rap Pod", "producer": "Dad Bod Rap Pod", "genre": "Music", "rating": 4.9, "num_ratings": 107, "num_episodes": 177, "description": "Hip-hop discussion podcast from an MC, a writer, and a record collector featuring interviews with well-respected figures from rap's past and present. A Stony Island Audio experience.", "link": "https://podcasts.apple.com/us/podcast/dad-bod-rap-pod/id1369624840"}, {"title": "CLUBLIFE", "producer": "BNN", "genre": "Music", "rating": 4.8, "num_ratings": 6000, "num_episodes": 5, "description": "Subscribe to CLUBLIFE by Tiësto for an hour of the best club tracks from around the world with your favorite DJ. For more info about Tiësto please visit www.tiesto.com See acast.com/privacy for privacy and opt-out information.", "link": "https://podcasts.apple.com/us/podcast/clublife/id251507798"}, {"title": "Lightning Bugs: Conversations with Ben Folds", "producer": "Kast Media | Ben Folds", "genre": "Music", "rating": 5.0, "num_ratings": 335, "num_episodes": 13, "description": "Join us in celebrating and commiserating with some of the world's foremost creatives about their endlessly various artistic processes. Not just in the arts, but in science, medicine, politics, technology, and more. Together we will figure out ways to maintain a spirit of curiosity and innovation in our everyday lives. NY Times best-selling author and musician Ben Folds hosts a podcast focused on enlightening conversations each week with guests. You can submit your questions to Ben here: https://www.speakpipe.com/BenFoldsAnd check out the YouTube channel here: https://www.youtube.com/channel/UC9ix6szTyjg3vmx1sIj-Vfw", "link": "https://podcasts.apple.com/us/podcast/lightning-bugs-conversations-with-ben-folds/id1554519768"}, {"title": "Rory & Mal Show", "producer": "Rory & Mal Show", "genre": "Music", "rating": 4.8, "num_ratings": 4600, "num_episodes": 3, "description": "New stories, new laughs, new random hot takes that no one asked for... New Rory & Mal.", "link": "https://podcasts.apple.com/us/podcast/rory-mal-show/id1572182022"}, {"title": "Aly & Fila pres. Future Sound Of Egypt Radio", "producer": "Aly & Fila", "genre": "Music", "rating": 4.7, "num_ratings": 247, "num_episodes": 193, "description": "Stream / Buy our brand new album 'It's All About The Melody' FSOE.lnk.to/IAATMAlbum Spotify https://FSOE.lnk.to/AFSpotifyApple Music https://FSOE.lnk.to/AFAppleMusicAmazon Music https://FSOE.lnk.to/AFAmazonMusicGet your own FSOE Merchandise 👉🏼 https://www.futuresoundofegypt.com/shopAs hot as the Sahara and standing every bit as tall as the pyramids, Aly & Fila are one of the worlds most in demand Trance & Progressive artists. Tune into Future Sound of Egypt Radio - Every Wednesday, direct from Cairo.", "link": "https://podcasts.apple.com/us/podcast/aly-fila-pres-future-sound-of-egypt-radio/id434317270"}, {"title": "The Matt Walsh Show", "producer": "The Daily Wire", "genre": "News", "rating": 4.8, "num_ratings": 12300, "num_episodes": 786, "description": "Fed up with the talking heads? Matt gives you a no-holds-barred take on today’s cultural, religious, and political issues. Monday thru Friday.", "link": "https://podcasts.apple.com/us/podcast/the-matt-walsh-show/id1367210511"}, {"title": "Foundering", "producer": "Bloomberg", "genre": "News", "rating": 4.5, "num_ratings": 800, "num_episodes": 155, "description": "Foundering is an award-winning, serialized podcast from the journalists at Bloomberg Technology. Each season, Foundering brings you inside a different high-stakes drama from the technology industry, where its companies are wielding unprecedented capital and power.", "link": "https://podcasts.apple.com/us/podcast/foundering/id1161880916"}, {"title": "Tea Time UNFILTERED With Lovelyti", "producer": "Lovelyti", "genre": "News", "rating": 4.9, "num_ratings": 2200, "num_episodes": 268, "description": "Spilling tea on hip-hop, pop culture, and the latest trending topics on social media.Tea Time With Lovelyti UNFILTERED will feature entertainment news, the latest information, and candid conversations about a multitude of topics, concerning young women and men across the globe.", "link": "https://podcasts.apple.com/us/podcast/tea-time-unfiltered-with-lovelyti/id1494079836"}, {"title": "\"YOUR WELCOME\" with Michael Malice", "producer": "Gas Digital Network", "genre": "News", "rating": 4.8, "num_ratings": 1200, "num_episodes": 22, "description": "Michael Malice brings his unique perspective–and plenty of sick burns–as he discusses everything from north Korea to American politics and culture with a bevy of guests.The newest 15 episodes are always free, but if you want access to all the archives, watch live, chat live, access to the forums, and get the show 5 days before it comes out everywhere else - you can subscribe now at gasdigitalnetwork.com and use the code YWMM to save 15% on the entire network, 2 week free trial.", "link": "https://podcasts.apple.com/us/podcast/your-welcome-with-michael-malice/id1389660155"}, {"title": "WSJ Your Money Briefing", "producer": "The Wall Street Journal", "genre": "News", "rating": 4.1, "num_ratings": 1200, "num_episodes": 20, "description": "Your Money Briefing is your personal-finance and career checklist, with the news that affects your money and what you do with it. From spending and saving to investing and taxes, the Wall Street Journal’s finance reporters and experts break down complicated money questions every weekday to help you make better decisions about managing your money. Hosted by J.R. Whalen.", "link": "https://podcasts.apple.com/us/podcast/wsj-your-money-briefing/id152024419"}, {"title": "The New Yorker: Politics and More", "producer": "The New Yorker", "genre": "News", "rating": 4.2, "num_ratings": 2200, "num_episodes": 150, "description": "A weekly discussion about politics, hosted by The New Yorker's executive editor, Dorothy Wickenden.", "link": "https://podcasts.apple.com/us/podcast/the-new-yorker-politics-and-more/id268213039"}, {"title": "The Ben Ferguson Podcast", "producer": "iHeartRadio", "genre": "News", "rating": 4.8, "num_ratings": 3000, "num_episodes": 241, "description": "If you hate the liberal media & ANTIFA but love president Trump than this is the podcast for you. Ben Ferguson brings you the commentary on the news that the biased media will not cover.", "link": "https://podcasts.apple.com/us/podcast/the-ben-ferguson-podcast/id1386375601"}, {"title": "The Daily Zeitgeist", "producer": "iHeartRadio", "genre": "News", "rating": 4.6, "num_ratings": 4200, "num_episodes": 1544, "description": "There’s more news and less comprehension today than any historical period that didn’t involve literal witch trials, and trying to stay on top of it all can feel like playing a game of telephone with 30 people, except everyone’s speaking at the same time and like a third of them are openly racist for some reason. From Cracked co-founder Jack O’Brien, THE DAILY ZEITGEIST is stepping into that fray with some of the funniest and smartest comedic and journalistic minds around. Jack and co-host Miles Gray spend up to an hour every weekday sorting through the events and stories driving the headlines, to help you find the signal in the noise, with a few laughs thrown in for free.", "link": "https://podcasts.apple.com/us/podcast/the-daily-zeitgeist/id1289384685"}, {"title": "Rumble with Michael Moore", "producer": "Michael Moore", "genre": "News", "rating": 4.7, "num_ratings": 8000, "num_episodes": 198, "description": "Academy Award-winning filmmaker and political provocateur Michael Moore offers his subversive and humorous take on the issues of the day and talks to a wide range of people from comedians and politicians to the people who’ve tried to kill him. Plus various mischief with Mike’s friends, family and the neighbors who don’t work for the NSA.", "link": "https://podcasts.apple.com/us/podcast/rumble-with-michael-moore/id1490354763"}, {"title": "Uncancellable", "producer": "Christian Walker", "genre": "News", "rating": 4.5, "num_ratings": 905, "num_episodes": 2, "description": "Uncancellable is an anti-woke, pro-common sense podcast focusing on bringing the fun back to pop culture.", "link": "https://podcasts.apple.com/us/podcast/uncancellable/id1573626967"}, {"title": "X22 Report", "producer": "X22 Report", "genre": "News", "rating": 4.7, "num_ratings": 3100, "num_episodes": 100, "description": "X22 Report is a daily show that will cover issues surrounding the economic collapse. Join me and many others to fight for what is rightfully ours. Website: x22report.com", "link": "https://podcasts.apple.com/us/podcast/x22-report/id1507444393"}, {"title": "The Newsmax Daily with Rob Carson", "producer": "Newsmax", "genre": "News", "rating": 4.8, "num_ratings": 224, "num_episodes": 70, "description": "The Newsmax Daily with Rob Carson gives you a humorous and entertaining analysis of current news from Newsmax’s top team of experts, as well as exclusive interviews with influential hard-hitting guests. Rob Carson’s background includes comedic writing for the legendary Rush Limbaugh, and it truly shows in this fast-paced, fun podcast. This is the best and most entertaining briefing on today’s news you’ll need to brighten your day!", "link": "https://podcasts.apple.com/us/podcast/the-newsmax-daily-with-rob-carson/id1559799362"}, {"title": "Mea Culpa with Michael Cohen", "producer": "Audio Up", "genre": "News", "rating": 4.8, "num_ratings": 6000, "num_episodes": 85, "description": "Michael Cohen, the former attorney and personal fixer for Donald J. Trump, once vowed to take a bullet for the President. But that was before the country was brought to its knees by the President’s own lies and personal madness. Now, imprisoned in his home, his life, reputation and livelihood destroyed, Cohen is on a mission to right the wrongs he perpetuated on behalf of his boss. Mea Culpa with Michael Cohen, is a raw and unfiltered shining a light into the dark corners of our current American Apocalypse. Tune in weekly for a candid conversation with the New York Times best-selling author and self-proclaimed “gangster lawyer,” as he sets to dismantle the Trump legacy and finds the truth and nothing but the truth. 485302", "link": "https://podcasts.apple.com/us/podcast/mea-culpa-with-michael-cohen/id1530639447"}, {"title": "Pop Alarm", "producer": "Betches Media", "genre": "News", "rating": 5.0, "num_ratings": 120, "num_episodes": 22, "description": "Every morning on Pop Alarm, host Dylan Hafer is delivering the pop culture news you need to start the day. From breaking celebrity stories to the latest in music, movies, and TV, Pop Alarm will make you feel pop cultured in five minutes or less.", "link": "https://podcasts.apple.com/us/podcast/pop-alarm/id1568521275"}, {"title": "Newshour", "producer": "BBC", "genre": "News", "rating": 4.4, "num_ratings": 637, "num_episodes": 17, "description": "Interviews, news and analysis of the day’s global events.", "link": "https://podcasts.apple.com/us/podcast/newshour/id356157099"}, {"title": "Steve Deace Show", "producer": "Blaze Podcast Network", "genre": "News", "rating": 4.9, "num_ratings": 5500, "num_episodes": 999, "description": "Principled conservatism with a snarky twist served up daily.", "link": "https://podcasts.apple.com/us/podcast/steve-deace-show/id481087877"}, {"title": "On the Media", "producer": "WNYC", "genre": "News", "rating": 4.7, "num_ratings": 7400, "num_episodes": 120, "description": "The Peabody Award-winning On the Media podcast is your guide to examining how the media sausage is made. Host Brooke Gladstone examines threats to free speech and government transparency, cast a skeptical eye on media coverage of the week’s big stories and unravel hidden political narratives in everything we read, watch and hear.", "link": "https://podcasts.apple.com/us/podcast/on-the-media/id73330715"}, {"title": "The News & Why It Matters", "producer": "Blaze Podcast Network", "genre": "News", "rating": 4.8, "num_ratings": 4300, "num_episodes": 726, "description": "Sara Gonzales and all your favorite personalities from BlazeTV get together for a roundtable rundown of today’s top stories.", "link": "https://podcasts.apple.com/us/podcast/the-news-why-it-matters/id1408958605"}, {"title": "Deadline: White House", "producer": "NBC News", "genre": "News", "rating": 4.6, "num_ratings": 4300, "num_episodes": 7, "description": "Drawing on years of experience as communications chief for President George W. Bush and senior advisor for the McCain-Palin campaign, Nicolle Wallace provides political insight and clarity on where the decision-makers stand on complex issues. Join her for analysis and discussion with the key newsmakers every weekday.", "link": "https://podcasts.apple.com/us/podcast/deadline-white-house/id1367201919"}, {"title": "Checks and Balance", "producer": "The Economist", "genre": "News", "rating": 4.5, "num_ratings": 969, "num_episodes": 75, "description": "The Economist unlocks American politics, tackling a new theme each week and digging into the data, ideas, and history shaping the country at this dramatic moment.John Prideaux, The Economist's US editor, hosts with Charlotte Howard, New York bureau chief, and Washington correspondent Jon Fasman.Correspondents from across the US and the rest of the world plus expert guests - politicians, pollsters, professors - join the in-depth reporting and discussion every Friday.", "link": "https://podcasts.apple.com/us/podcast/checks-and-balance/id1494037881"}, {"title": "The Teacher's Pet", "producer": "The Australian", "genre": "News", "rating": 4.5, "num_ratings": 6500, "num_episodes": 20, "description": "Lyn and Chris Dawson appear to have the perfect marriage. He's a star footballer and popular high school teacher. She's a devoted wife and mother. They share a beautiful home above Sydney's northern beaches. But when Lyn goes missing, dark secrets are buried. This is no fairytale, but a sordid story of strangely close twin brothers, teenage student lovers, and probable murder. The Australian's Hedley Thomas digs deep into a cold case which has been unsolved for 36 years, uncovering startling new evidence.", "link": "https://podcasts.apple.com/us/podcast/the-teachers-pet/id1385379989"}, {"title": "This Week with George Stephanopoulos", "producer": "ABC News", "genre": "News", "rating": 3.2, "num_ratings": 1300, "num_episodes": 5, "description": "\"This Week with George Stephanopoulos\" is ABC News’ pre-eminent Sunday morning discussion program, featuring newsmaker interviews and panel discussions and debates on a wide range of global issues and commentary, putting into unique perspective the preceding week’s news, and often setting the stage for the week ahead.", "link": "https://podcasts.apple.com/us/podcast/this-week-with-george-stephanopoulos/id91959525"}, {"title": "The Sean Hannity Show", "producer": "Sean Hannity", "genre": "News", "rating": 4.0, "num_ratings": 8400, "num_episodes": 1726, "description": "Sean Hannity is a multimedia superstar, spending four hours a day every day reaching out to millions of Americans on radio, television and the Internet.", "link": "https://podcasts.apple.com/us/podcast/the-sean-hannity-show/id1112194905"}, {"title": "WSJ Tech News Briefing", "producer": "The Wall Street Journal", "genre": "News", "rating": 4.3, "num_ratings": 1200, "num_episodes": 20, "description": "Tech News Briefing is your guide to what people in tech are talking about. Every weekday, we’ll bring you breaking tech news and scoops from the pros at the Wall Street Journal, insight into new innovations and policy debates, tips from our personal tech team, and exclusive interviews with movers and shakers in the industry.", "link": "https://podcasts.apple.com/us/podcast/wsj-tech-news-briefing/id74844126"}, {"title": "The Missing Cryptoqueen", "producer": "BBC", "genre": "News", "rating": 4.6, "num_ratings": 668, "num_episodes": 12, "description": "Dr Ruja Ignatova persuaded millions to join her financial revolution. Then she disappeared. Why? Jamie Bartlett presents a story of greed, deceit and herd madness.", "link": "https://podcasts.apple.com/us/podcast/the-missing-cryptoqueen/id1480370173"}, {"title": "The Lincoln Project", "producer": "The Lincoln Project", "genre": "News", "rating": 4.5, "num_ratings": 4000, "num_episodes": 41, "description": "Trump may be gone but American politics is still in crisis. The Lincoln Project has sparked a nationwide movement to restore our democracy. This podcast is hosted by co-founder Reed Galen and he is regularly joined by our political experts and guests that helped defeat Trump and continue the mission to stamp out Trumpism and the seditionists who backed him. The podcast discusses today’s political challenges, our vision for the future and how all Americans can be part of our pro-democracy movement.", "link": "https://podcasts.apple.com/us/podcast/the-lincoln-project/id1551582052"}, {"title": "The Megyn Kelly Show", "producer": "Devil May Care Media", "genre": "News", "rating": 4.8, "num_ratings": 19400, "num_episodes": 122, "description": "The Megyn Kelly Show is your home for open, honest and provocative conversations with the most interesting and important political, legal and cultural figures today. No BS. No agenda. And no fear.", "link": "https://podcasts.apple.com/us/podcast/the-megyn-kelly-show/id1532976305"}, {"title": "QAnon Anonymous", "producer": "Julian Feeld, Travis View & Jake Rockatansky", "genre": "News", "rating": 4.3, "num_ratings": 2900, "num_episodes": 281, "description": "The QAnon Anonymous Podcast chops & screws the best conspiracy theories of the post-truth era. Your hosts Jake, Julian, and Travis dredge up wild beliefs from online fever swamps, engage QAnon followers in irregular warfare, and trip over deranged historical facts that make conspiracy theories sound sane.", "link": "https://podcasts.apple.com/us/podcast/qanon-anonymous/id1428209307"}, {"title": "Hodgetwins", "producer": "Keith & Kevin Hodge", "genre": "News", "rating": 4.9, "num_ratings": 4400, "num_episodes": 223, "description": "The Hodgetwins known for their political humor from social media discuss current political events in the greatest country ever created.  Support this podcast: https://anchor.fm/hodgetwins/support", "link": "https://podcasts.apple.com/us/podcast/hodgetwins/id1486221160"}, {"title": "NBC Meet the Press", "producer": "NBC News", "genre": "News", "rating": 3.6, "num_ratings": 3100, "num_episodes": 27, "description": "NBC News' Meet the Press is the longest-running television show in history, celebrating its 70th anniversary. If it's Sunday, it's Meet the Press with Chuck Todd.", "link": "https://podcasts.apple.com/us/podcast/nbc-meet-the-press/id74840240"}, {"title": "Fox News Radio Newscast", "producer": "FOX News Channel", "genre": "News", "rating": 3.7, "num_ratings": 3800, "num_episodes": 1, "description": "The latest news from the fastest growing radio news network, FOX News Radio. Listen to the power of FOX News on radio! Updated hourly!", "link": "https://podcasts.apple.com/us/podcast/fox-news-radio-newscast/id209991975"}, {"title": "Candace", "producer": "The Daily Wire", "genre": "News", "rating": 4.5, "num_ratings": 5900, "num_episodes": 19, "description": "Don’t miss Candace, the Daily Wire’s new show starring conservative lightning rod, Candace Owens. Join us weekly as Candace delves into the political and cultural issues of the day with her signature blend of intelligence and humor. Candace features celebrity interviews and panel discussions with the world’s most influential thought leaders and cultural mavens. To get access to the full show, become a member at dailywire.com/subscribe and use code CANDACE to get 25% off.", "link": "https://podcasts.apple.com/us/podcast/candace/id1556687660"}, {"title": "The Fifth Column - Analysis, Commentary, Sedition", "producer": "Michael Moynihan (Vice), Matt Welch (Reason), and Kmele Foster (Freethink)", "genre": "News", "rating": 4.7, "num_ratings": 1800, "num_episodes": 249, "description": "From their enclave in midtown Manhattan, Michael Moynihan (Vice), Matt Welch (Reason), and Kmele Foster (Freethink) dissect the news, interrogate guests, and question just about everything. The topics are broad, the insights are deep, and the jokes are off color. Reform the system, or burn it to the ground? They discuss... @wethefifth www.wethefifth.com See acast.com/privacy for privacy and opt-out information.", "link": "https://podcasts.apple.com/us/podcast/the-fifth-column-analysis-commentary-sedition/id1097696129"}, {"title": "Post Reports", "producer": "The Washington Post", "genre": "News", "rating": 4.3, "num_ratings": 3700, "num_episodes": 674, "description": "Post Reports is the daily podcast from The Washington Post. Unparalleled reporting. Expert insight. Clear analysis. Everything you’ve come to expect from the newsroom of The Post. For your ears. Martine Powers is your host, asking the questions you didn’t know you wanted answered. Published weekdays by 5 p.m. Eastern time.", "link": "https://podcasts.apple.com/us/podcast/post-reports/id1444873564"}, {"title": "Bad Faith", "producer": "Briahna Joy Gray & Virgil Texas", "genre": "News", "rating": 4.6, "num_ratings": 2000, "num_episodes": 90, "description": "America's only podcast. //with Briahna Joy Gray, former National Press Secretary for Bernie Sanders' Presidential campaign //and Virgil Texas //Subscribe for exclusive premium episodes at patreon.com/badfaithpodcast /@badfaithpod / badfaithpodcast at gmail dot com", "link": "https://podcasts.apple.com/us/podcast/bad-faith/id1531192509"}, {"title": "American Party Podcast", "producer": "Tetherball Academy Media", "genre": "News", "rating": 4.9, "num_ratings": 1100, "num_episodes": 41, "description": "The American Party isn’t meant to be a political party. Rather, it is meant to be a rejection of the idea of binary politics. Our party, the American Party, is one that everybody is part of just by being born in this country. You’re automatically part of the American Party, and you’re subject to no rules from us except this: follow the truth and do what’s best for America.", "link": "https://podcasts.apple.com/us/podcast/american-party-podcast/id1536338060"}, {"title": "Newt's World", "producer": "Gingrich 360", "genre": "News", "rating": 4.6, "num_ratings": 5200, "num_episodes": 279, "description": "Join former House Speaker, professor, historian, and futurist Newt Gingrich as he shares his lifetime of knowledge and access to the world’s most interesting minds in a new series that covers all aspects of our society. From history to health, national security to science, Newt offers stories, conversations, and context to uncover new perspectives, knowledge and insight. This podcast isn’t about politics; it’s about exploring the past, present, and future to understand where we’ve been and where we’re going. Welcome to Newt’s World, a podcast for independent thinkers.", "link": "https://podcasts.apple.com/us/podcast/newts-world/id1452065072"}, {"title": "Apple News Today", "producer": "Apple News", "genre": "News", "rating": 3.6, "num_ratings": 3900, "num_episodes": 248, "description": "Join Shumita Basu and Duarte Geraldino every weekday morning as they guide you through some of the most fascinating stories in the news — and how the world’s best journalists are covering them.", "link": "https://podcasts.apple.com/us/podcast/apple-news-today/id1473872585"}, {"title": "The Handoff", "producer": "The Handoff", "genre": "News", "rating": 3.4, "num_ratings": 1800, "num_episodes": 3, "description": "The love viewers witness between CNN’s Don Lemon and Chris Cuomo in the handoff between their shows each night is real. Now they’re stepping out from behind the anchor desk for a weekly conversation where nothing is off limits. With no broadcast clock to hold them back, Chris and Don talk politics and get personal. Every Thursday, exclusively on Apple Podcasts.", "link": "https://podcasts.apple.com/us/podcast/the-handoff/id1571581184"}, {"title": "Bannon's War Room", "producer": "WarRoom.org", "genre": "News", "rating": 4.6, "num_ratings": 8000, "num_episodes": 200, "description": "WAR ROOM: 2020 with Stephen K. Bannon, Raheem Kassam, and more.", "link": "https://podcasts.apple.com/us/podcast/bannons-war-room/id1485351658"}, {"title": "On Our Watch", "producer": "NPR", "genre": "News", "rating": 4.4, "num_ratings": 1200, "num_episodes": 7, "description": "You know the refrain. With each new scandal involving law enforcement, another horrific video of misconduct, evidence of assault, or act of fatal negligence, police officials tell the public: \"We're investigating.\"But what really happens inside those internal investigations that promise accountability?For decades, the process for how police police themselves has been inconsistent, if not opaque. In some states, like California, these proceedings were completely hidden behind a wall of official secrecy. After a new police transparency law unsealed scores of internal affairs files, NPR and KQED reporters set out to examine these cases and the shadow world of police discipline. Hosted by KQED Criminal Justice reporter Sukey Lewis, On Our Watch brings listeners into the rooms where officers are questioned and witnesses are interrogated to find out who this system is really protecting. Is it the officers, or the public they've sworn to serve? New episodes on Thursdays.", "link": "https://podcasts.apple.com/us/podcast/on-our-watch/id1567098962"}, {"title": "Uncommon Knowledge", "producer": "Hoover Institution", "genre": "News", "rating": 4.8, "num_ratings": 1100, "num_episodes": 100, "description": "For more than two decades the Hoover Institution has been producing Uncommon Knowledge with Peter Robinson, a series hosted by Hoover fellow Peter Robinson as an outlet for political leaders, scholars, journalists, and today’s big thinkers to share their views with the world. Guests have included a host of famous figures, including Paul Ryan, Henry Kissinger, Antonin Scalia, Rupert Murdoch, Newt Gingrich, and Christopher Hitchens, along with Hoover fellows such as Condoleezza Rice and George Shultz.“Uncommon Knowledge takes fascinating, accomplished guests, then sits them down with me to talk about the issues of the day,” says Robinson, an author and former speechwriter for President Reagan. “Unhurried, civil, thoughtful, and informed conversation– that’s what we produce. And there isn’t all that much of it around these days.”The show started life as a television series in 1997 and is now distributed exclusively on the web over a growing network of the largest political websites and channels. To stay tuned for the latest updates on and episodes related to Uncommon Knowledge, follow us on Facebook and Twitter. For more than two decades the Hoover Institution has been producing Uncommon Knowledge with Peter Robinson, a series hosted by Hoover fellow Peter Robinson as an outlet for political leaders, scholars, journalists, and today’s big thinkers to share their views with the world. Guests have included a host of famous figures, including Paul Ryan, Henry Kissinger, Antonin Scalia, Rupert Murdoch, Newt Gingrich, and Christopher Hitchens, along with Hoover fellows such as Condoleezza Rice and George Shultz.“Uncommon Knowledge takes fascinating, accomplished guests, then sits them down with me to talk about the issues of the day,” says Robinson, an author and former speechwriter for President Reagan. “Unhurried, civil, thoughtful, and informed conversation– that’s what we produce. And there isn’t all that much of it around these days.”The show started life as a television series in 1997 and is now distributed exclusively on the web over a growing network of the largest political websites and channels. To stay tuned for the latest updates on and episodes related to Uncommon Knowledge, follow us on Facebook and Twitter.", "link": "https://podcasts.apple.com/us/podcast/uncommon-knowledge/id1378389941"}, {"title": "Crimetown", "producer": "Gimlet Media", "genre": "News", "rating": 4.7, "num_ratings": 13700, "num_episodes": 52, "description": "Welcome to Crimetown, a series produced by Marc Smerling and Zac Stuart-Pontier in partnership with Gimlet Media. Each season, we investigate the culture of crime in a different city. In Season 2, Crimetown heads to the heart of the Rust Belt: Detroit, Michigan. From its heyday as Motor City to its rebirth as the Brooklyn of the Midwest, Detroit’s history reflects a series of issues that strike at the heart of American identity: race, poverty, policing, loss of industry, the war on drugs, and our universal desire for a savior. Detroit’s a tough town, and its residents are even tougher. They’ve weathered riots, a drug epidemic, political scandal, and innumerable other hardships, but they’re still here—and they have stories to tell.", "link": "https://podcasts.apple.com/us/podcast/crimetown/id1170959623"}, {"title": "Stu Does America", "producer": "Blaze Podcast Network", "genre": "News", "rating": 4.9, "num_ratings": 4500, "num_episodes": 308, "description": "Stu Burguiere dissects and debunks leftist propaganda with a lethal blend of wit, wisdom, and mockery.", "link": "https://podcasts.apple.com/us/podcast/stu-does-america/id1490615866"}, {"title": "Morning Joe", "producer": "NBC News", "genre": "News", "rating": 4.0, "num_ratings": 6300, "num_episodes": 117, "description": "Join Joe Scarborough, Mika Brzezinski, and Willie Geist, for in-depth and informed discussions that help drive the day's political conversation. Top newsmakers, Washington insiders, journalists, and cultural influencers, come together on Morning Joe for unparalleled insight and analysis around the day's biggest stories.", "link": "https://podcasts.apple.com/us/podcast/morning-joe/id974299441"}, {"title": "Code Switch", "producer": "NPR", "genre": "News", "rating": 4.6, "num_ratings": 12700, "num_episodes": 292, "description": "What's CODE SWITCH? It's the fearless conversations about race that you've been waiting for! Hosted by journalists of color, our podcast tackles the subject of race head-on. We explore how it impacts every part of society — from politics and pop culture to history, sports and everything in between. This podcast makes ALL OF US part of the conversation — because we're all part of the story. \"We're talking to people who have been marginalized and underrepresented for so long, who are so hungry to see themselves represented fully and with nuance and complexity,\" says Shereen Marisol Meraji, co-host of Code Switch, Apple Podcasts' first-ever Show of the Year for 2020. \"People recognize that, because we had been having these conversations for so many years in advance, we're a trusted place where they could go to better understand all the stories about race filling up their newsfeeds and social channels.\" Their weekly podcast launched in 2016 but truly came into its own during this historic, transformative year, as Meraji and co-host Gene Demby examine issues of racial, ethnic, and cultural identity through frank one-on-one discussions and incisive non-fiction. In a year dominated by discourse about race, this indispensable show furthered them by providing powerful and timely insight, offering diverse and empathetic personal perspectives to a broad audience. \"There are certain lenses that we are bringing into, both as journalists and the people that we're bringing to these stories,\" Demby says. \"But also, we are specific people with specific fascinations and broad curiosity. If we're telling these stories, you should assume that they're going to look and sound like us.\"", "link": "https://podcasts.apple.com/us/podcast/code-switch/id1112190608"}, {"title": "The Beat with Ari Melber", "producer": "NBC News", "genre": "News", "rating": 4.7, "num_ratings": 2800, "num_episodes": 7, "description": "Ari Melber delivers the biggest political and news stories of the day, with interviews and original reporting from around the nation. An Emmy-winning journalist, attorney and former Senate staffer, Melber cuts through the spin and the noise to tell you what's really happening. Real news, every night.", "link": "https://podcasts.apple.com/us/podcast/the-beat-with-ari-melber/id1364113251"}, {"title": "The David Pakman Show", "producer": "David Pakman", "genre": "News", "rating": 4.6, "num_ratings": 1800, "num_episodes": 12, "description": "The nationally syndicated progressive talk radio and television program hosted by David Pakman", "link": "https://podcasts.apple.com/us/podcast/the-david-pakman-show/id402050558"}, {"title": "Money Talks from Economist Radio", "producer": "The Economist", "genre": "News", "rating": 4.3, "num_ratings": 696, "num_episodes": 318, "description": "Our editors and correspondents give their authoritative take on the markets, the economy and the world of business. Published every Wednesday on Economist Radio.", "link": "https://podcasts.apple.com/us/podcast/money-talks-from-economist-radio/id420929545"}, {"title": "The Michael Knowles Show", "producer": "The Daily Wire", "genre": "News", "rating": 4.8, "num_ratings": 21200, "num_episodes": 867, "description": "Bask in the simple joys of being right. The Michael Knowles Show cuts through the madness of our politics and culture, analyzing the top stories of the day. Monday through Friday. If you like The Michael Knowles Show, become a member TODAY with promo code: KNOWLES and enjoy the exclusive benefits for 10% off at https://www.dailywire.com/knowles", "link": "https://podcasts.apple.com/us/podcast/the-michael-knowles-show/id1266577963"}, {"title": "NBC Nightly News with Lester Holt", "producer": "NBC News", "genre": "News", "rating": 4.0, "num_ratings": 1600, "num_episodes": 50, "description": "Listen to \"NBC Nightly News,\" providing reports and analysis of the day's most newsworthy national and international events. This audio podcast, updated each weekday evening by NBCNews.com, brings you the day's show in its entirety. For more from \"Nightly News\", visit http://www.nbcnews.com/nightly-news", "link": "https://podcasts.apple.com/us/podcast/nbc-nightly-news-with-lester-holt/id75462585"}, {"title": "This Week in Tech (Audio‪)‬", "producer": "TWiT TV", "genre": "News", "rating": 3.9, "num_ratings": 2600, "num_episodes": 10, "description": "Your first podcast of the week is the last word in tech. Join the top tech pundits in a roundtable discussion of the latest trends in high tech.Records live every Sunday at 5:15pm Eastern / 2:15pm Pacific / 21:15 UTC.", "link": "https://podcasts.apple.com/us/podcast/this-week-in-tech-audio/id73329404"}, {"title": "Slightly Offensive with Elijah Schaffer", "producer": "Blaze Podcast Network", "genre": "News", "rating": 5.0, "num_ratings": 3700, "num_episodes": 174, "description": "Elijah Schaffer provides a hilarious yet thought-provoking perspective on the most controversial and relevant stories from around the world with his signature unfiltered commentary — always slightly offensive but completely engaging.", "link": "https://podcasts.apple.com/us/podcast/slightly-offensive-with-elijah-schaffer/id1450057169"}, {"title": "The Ben Shapiro Show", "producer": "The Daily Wire", "genre": "News", "rating": 4.5, "num_ratings": 125100, "num_episodes": 352, "description": "Tired of the lies? Tired of the spin? Are you ready to hear the hard-hitting truth in comprehensive, conservative, principled fashion? The Ben Shapiro Show brings you all the news you need to know in the most fast moving daily program in America. Ben brutally breaks down the culture and never gives an inch! Monday thru Friday.", "link": "https://podcasts.apple.com/us/podcast/the-ben-shapiro-show/id1047335260"}, {"title": "Political Gabfest", "producer": "Slate Magazine", "genre": "News", "rating": 4.5, "num_ratings": 7400, "num_episodes": 422, "description": "Voted “Favorite Political Podcast” by Apple Podcasts listeners. Stephen Colbert says \"Everybody should listen to the Slate Political Gabfest.\" The Gabfest, featuring Emily Bazelon, John Dickerson, and David Plotz, is the kind of informal and irreverent discussion Washington journalists have after hours over drinks.", "link": "https://podcasts.apple.com/us/podcast/political-gabfest/id158004641"}, {"title": "The Eric Metaxas Show", "producer": "Salem Podcast Network", "genre": "News", "rating": 4.6, "num_ratings": 2200, "num_episodes": 20, "description": "The Show About Everything!  The Eric Metaxas Show offers compelling perspective on American culture, political life, and stories making news around the corner and across the globe.Heard on leading radio stations from coast-to-coast, The Eric Metaxas Show taps the unique talent of one of America’s best known authors, commentators, TV personalities and public speakers for radio unlike anything ever heard before: compelling, compassionate and interactive as Eric and his listeners seek answers to life’s toughest questions together.", "link": "https://podcasts.apple.com/us/podcast/the-eric-metaxas-show/id991156680"}, {"title": "Undisclosed", "producer": "Undisclosed", "genre": "News", "rating": 4.2, "num_ratings": 8800, "num_episodes": 409, "description": "The Undisclosed podcast investigates wrongful convictions, and the U.S. criminal justice system, by taking a closer look at the perpetration of a crime, its investigation, the trial, and ultimate verdict... and finding new evidence that never made it to court.", "link": "https://podcasts.apple.com/us/podcast/undisclosed/id984987791"}, {"title": "Krystal Kyle & Friends", "producer": "Krystal", "genre": "News", "rating": 4.8, "num_ratings": 895, "num_episodes": 27, "description": "Krystal Ball, cohost of Breaking Points podcast, and Kyle Kulinski, host of Secular Talk, dive into politics, philosophy and random BS with people they like.", "link": "https://podcasts.apple.com/us/podcast/krystal-kyle-friends/id1547098165"}, {"title": "Dark Secret Place", "producer": "KFI AM 640 (KFI-AM)", "genre": "News", "rating": 4.7, "num_ratings": 957, "num_episodes": 333, "description": "Get all the news, politics and in-depth military talk that you literally can't find anywhere else on radio with the Dark Secret Place with Bryan Suits!  Listen live every Saturday night from 8-11 PM Pacific Time on KFI AM 640 and iHeartRADIO.", "link": "https://podcasts.apple.com/us/podcast/dark-secret-place/id1243133549"}, {"title": "The Jesse Kelly Show", "producer": "Jesse Kelly Show", "genre": "News", "rating": 4.8, "num_ratings": 887, "num_episodes": 829, "description": "Unfiltered and Unapologetic, Jesse Kelly is the greatest mind of the 21st century now on demand. From history to politics to pizza The Jesse Kelly Show has it all in a no nonsense kind of way. Whether you're a veteran like Jesse, or just a good ol fashion red blooded American, the show has something for everyone. “Jesse Kelly brings intelligence, unique insight, and cutting humor to the world of political commentary.” — Jesse Kelly", "link": "https://podcasts.apple.com/us/podcast/the-jesse-kelly-show/id1506063411"}, {"title": "All In with Chris Hayes", "producer": "NBC News", "genre": "News", "rating": 4.5, "num_ratings": 3800, "num_episodes": 9, "description": "The biggest news and political stories of the day with a commitment to in-depth reporting that consistently seeks to hold our leaders accountable.", "link": "https://podcasts.apple.com/us/podcast/all-in-with-chris-hayes/id1314170606"}, {"title": "Fearless with Jason Whitlock", "producer": "Blaze Podcast Network", "genre": "News", "rating": 4.9, "num_ratings": 616, "num_episodes": 3, "description": "Celebrated journalist Jason Whitlock and “Uncle Jimmy” protect the realm of common sense and challenge the groupthink mandated by elites. Listen Monday through Friday for the most fearless conversation at the crossroads of culture, faith, sports, and comedy.", "link": "https://podcasts.apple.com/us/podcast/fearless-with-jason-whitlock/id1569056584"}, {"title": "Deconstructed", "producer": "The Intercept", "genre": "News", "rating": 4.8, "num_ratings": 3900, "num_episodes": 141, "description": "Each week The Intercept’s Washington, D.C. bureau brings you one important or overlooked story from the political world. Bureau Chief Ryan Grim and a rotating cast of journalists, politicians, academics and historians tell you what the rest of the media are missing.", "link": "https://podcasts.apple.com/us/podcast/deconstructed/id1354611827"}, {"title": "D23 Inside Disney", "producer": "Disney", "genre": "News", "rating": 4.4, "num_ratings": 322, "num_episodes": 96, "description": "Get the inside scoop on all the latest Disney news, and hear from the talented people who are making it all happen. From the fascinating talents in front of the camera to the creative minds behind the scenes, we are taking you Inside Disney.", "link": "https://podcasts.apple.com/us/podcast/d23-inside-disney/id1477239212"}, {"title": "Reveal", "producer": "The Center for Investigative Reporting", "genre": "News", "rating": 4.7, "num_ratings": 6300, "num_episodes": 200, "description": "From prisons to protests, immigration to the environment, Peabody Award-winning Reveal goes deep into the pressing issues of our times. The Atlantic says “the experience of each episode is akin to a spoonful of sugar, even when it’s telling a story about Richard Spencer’s cotton farms or a man’s final days as a heroin addict.” Reveal is a project of  The Center for Investigative Reporting and is co-produced with PRX.  The show is hosted by Al Letson and partners with reporters and newsrooms around the world, including The Washington Post, ProPublica, APM, The Marshall Project and The Investigative Fund. Reveal is a Pulitzer Prize finalist and has won many broadcast journalism awards, including a duPont and three national Emmys.", "link": "https://podcasts.apple.com/us/podcast/reveal/id886009669"}, {"title": "Ruthless", "producer": "Comfortably Smug, Josh Holmes, Michael Duncan", "genre": "News", "rating": 4.7, "num_ratings": 2600, "num_episodes": 80, "description": "A variety progrum. Smug, Holmes, and Duncan bring next generation conservative talk to the next level with RUTHLESS. There is no shelter for anyone as the trio provide a lighter analysis of the news (and fake news) of the day. Produced by Bobcat Media LLC.", "link": "https://podcasts.apple.com/us/podcast/ruthless/id1535384390"}, {"title": "The Intelligence", "producer": "The Economist", "genre": "News", "rating": 4.5, "num_ratings": 1700, "num_episodes": 621, "description": "Get a daily burst of global illumination from The Economist’s worldwide network of correspondents as they dig past the headlines to get to the stories beneath—and to stories that aren’t making headlines, but should be.", "link": "https://podcasts.apple.com/us/podcast/the-intelligence/id1449631195"}, {"title": "In the Bubble with Andy Slavitt: Our Shot", "producer": "Lemonada Media", "genre": "News", "rating": 4.6, "num_ratings": 2700, "num_episodes": 133, "description": "Andy Slavitt, President Biden’s Senior Advisor on COVID-19, is back from the White House to his chair on the award-winning In the Bubble podcast. Just as he took us through the pandemic, this 10-week series called Our Shot is about leading us out. It’s an insider’s guide for getting closure on what happened, how we emerge, and what must come next. Andy is joined each week by Dr. Lisa Fitzpatrick, who takes you places we couldn't go during the pandemic. Special guests include leaders we rarely get to see drop their guard the way they do on this podcast. Andy gives listeners information and inspiration from his bubble every Monday and Wednesday.", "link": "https://podcasts.apple.com/us/podcast/in-the-bubble-with-andy-slavitt-our-shot/id1504128553"}, {"title": "The Economist Morning Briefing", "producer": "The Economist", "genre": "News", "rating": 4.1, "num_ratings": 593, "num_episodes": 4, "description": "Delivered before breakfast, The Economist Morning Briefing tells you what’s on the global agenda in the coming day, what to look out for in business, finance and politics and, most importantly, what to make of it.Please subscribe to The Economist for full access to print, digital and audio editions, including the full Economist Morning Briefing:https://www.economist.com/briefingoffer Digital subscribers to The Economist should log in at https://briefing.economist.com for access to the full Economist Morning Briefing.", "link": "https://podcasts.apple.com/us/podcast/the-economist-morning-briefing/id1487173754"}, {"title": "Bloomberg Businessweek", "producer": "Bloomberg", "genre": "News", "rating": 3.7, "num_ratings": 220, "num_episodes": 2000, "description": "Carol Massar and Tim Stenovec bring together the latest news from the world of business and finance and the interesting stories of global technology, politics, economics and more by harnessing the power of Bloomberg Businessweek reporters and editors.", "link": "https://podcasts.apple.com/us/podcast/bloomberg-businessweek/id393107187"}, {"title": "Reliable Sources with Brian Stelter", "producer": "CNN", "genre": "News", "rating": 3.2, "num_ratings": 1100, "num_episodes": 201, "description": "Reliable Sources examines how journalists do their jobs and how the media affect the stories they cover in this weekly CNN program. Full video episodes available in the iTunes store.", "link": "https://podcasts.apple.com/us/podcast/reliable-sources-with-brian-stelter/id466789756"}, {"title": "The New Abnormal", "producer": "The Daily Beast", "genre": "News", "rating": 4.7, "num_ratings": 6200, "num_episodes": 186, "description": "Blunt truth and dark humor for a world in chaos. A Daily Beast podcast hosted by Molly Jong-Fast. Tune in every Tuesday and Friday. Become a Beast Inside member to enjoy bonus episodes every Sunday: http://newabnormal.thedailybeast.com/", "link": "https://podcasts.apple.com/us/podcast/the-new-abnormal/id1508202790"}, {"title": "Breaking Points with Krystal and Saagar", "producer": "Breaking Points", "genre": "News", "rating": 4.9, "num_ratings": 4200, "num_episodes": 13, "description": "Breaking Points is a fearless anti-establishment multi-week Youtube and Podcast which holds the powerful to account hosted by Krystal Ball and Saagar Enjeti", "link": "https://podcasts.apple.com/us/podcast/breaking-points-with-krystal-and-saagar/id1570045623"}, {"title": "The Charlie Kirk Show", "producer": "PodcastOne", "genre": "News", "rating": 4.7, "num_ratings": 31400, "num_episodes": 763, "description": "Mobilizing students on 2,000 college and high school campuses across the country, Charlie has your inside scoop on the biggest news of the week and what's really going on behind the headlines. The founder of Turning Point USA and Twitter's 5th most engaged personality sits down with some of the biggest newsmakers of our time to talk politics, pop-culture, sports, and a little bit of everything else - all from his signature no holds barred, right-of-center, freedom-loving point of view.", "link": "https://podcasts.apple.com/us/podcast/the-charlie-kirk-show/id1460600818"}, {"title": "The Victor Davis Hanson Show", "producer": "Victor Davis Hanson and Jack Fowler", "genre": "News", "rating": 5.0, "num_ratings": 610, "num_episodes": 13, "description": "This is the Victor Davis Hanson Show. Victor is the Martin and Illie Anderson Senior Fellow at the Hoover Institution and the Wayne & Marcia Buske Distinguished Fellow in History at Hillsdale College. Victor's co-host Jack Fowler is the Director for the Center for Civil Society at American Philanthropic. Podcasting twice weekly, Victor and Jack discuss current political and social events and ideas in \"The Traditionalist\" and current and past cultural trends in \"The Classicist.\"", "link": "https://podcasts.apple.com/us/podcast/the-victor-davis-hanson-show/id1570380458"}, {"title": "PBS NewsHour - Full Show", "producer": "PBS NewsHour", "genre": "News", "rating": 4.5, "num_ratings": 1600, "num_episodes": 30, "description": "Listen to the complete PBS NewsHour, specially formatted as a podcast. Published each night by 9 p.m., our full show includes every news segment, every interview, and every bit of analysis as our television broadcast. Is this not what you're looking for? Don't miss our other podcasts for our individual segments, Brooks and Capehart, Politics Monday, Brief but Spectacular, and more. Find them in iTunes or in your favorite podcasting app. PBS NewsHour is supported by - https://www.pbs.org/newshour/about/funders", "link": "https://podcasts.apple.com/us/podcast/pbs-newshour-full-show/id394432287"}, {"title": "Who? Weekly", "producer": "Who? Weekly", "genre": "News", "rating": 4.9, "num_ratings": 3600, "num_episodes": 537, "description": "A podcast dedicated to deciphering and celebrating pop culture's greatest (and not-so-greatest) Whos and Thems. Everything you need to know about celebrities you don't. Hosted by Bobby Finger and Lindsey Weber.", "link": "https://podcasts.apple.com/us/podcast/who-weekly/id1076377547"}, {"title": "The Larry Elder Show", "producer": "Salem Podcast Network", "genre": "News", "rating": 4.9, "num_ratings": 1700, "num_episodes": 110, "description": "Known to his listeners as the “Sage from South Central,” Larry Elder engages political and cultural leaders in meaningful debates over race, government, personal responsibility and education, elevating the talk radio genre.", "link": "https://podcasts.apple.com/us/podcast/the-larry-elder-show/id1502474233"}, {"title": "Conspiracyland", "producer": "Yahoo News", "genre": "News", "rating": 4.2, "num_ratings": 1600, "num_episodes": 23, "description": "Conspiracyland Season 3 — \"The Secret Lives and Brutal Death of Jamal Khashoggi\" — is an eight episode series, hosted by Yahoo News' Chief Investigative Correspondent Michael Isikoff, that investigates the grisly state-sponsored assassination of Saudi Arabia's most prominent journalist after he dared to criticize the country's powerful Crown Prince Mohammed bin Salman, or MBS. Isikoff has uncovered new details about the murder, including notes based on confessions by the assassins during secret Saudi interrogations. The series also presents new evidence of MBS' role in directing a global campaign of surveillance targeting Saudi dissidents, including a plot to plant spies inside Twitter to steal personal details about his critics. At the center of the saga is Khashoggi — a man of many secrets who once was close friends with Osama bin Laden and later was assigned special intelligence-collecting missions by the Saudi government only to become in his later years a fearless voice for democracy and freedom of speech. The series is based on more than 50 interviews with friends, colleagues, and lovers of Khashoggi, as well as senior U.S. and Saudi officials, including former Secretary of State John Kerry, former national security advisor John Bolton, former deputy national security advisor Ben Rhodes and former U.S. Ambassador to Saudi Arabia Joseph Westphal.", "link": "https://podcasts.apple.com/us/podcast/conspiracyland/id1471037693"}, {"title": "The Rubin Report", "producer": "Blaze Podcast Network", "genre": "News", "rating": 4.6, "num_ratings": 10400, "num_episodes": 420, "description": "Care about free speech? Tired of political correctness? Join Dave Rubin for real conversations, real news, and one-on-one interviews with some of the most intriguing names in America today as they break down politics and current events.", "link": "https://podcasts.apple.com/us/podcast/the-rubin-report/id1052842770"}, {"title": "Today, Explained", "producer": "Vox", "genre": "News", "rating": 4.4, "num_ratings": 7200, "num_episodes": 847, "description": "News comes at you fast. Join us at the end of your day to understand it. Today, Explained is your all killer, no filler, Monday to Friday news explainer hosted by Sean Rameswaram and featuring the finest reporters from the Vox Media Podcast Network and beyond.", "link": "https://podcasts.apple.com/us/podcast/today-explained/id1346207297"}, {"title": "Hold The Line Podcast", "producer": "Sean Feucht", "genre": "News", "rating": 4.9, "num_ratings": 2500, "num_episodes": 1, "description": "Hold the Line is a new movement focused on engaging with the church and young people across the country in a way that charges them to play an active role as citizens of this nation.Our mission is to Inform, Educate, and Inspire the next generation of leaders to take a stand for what is right.Our deeply held beliefs are falling out of line with the progressive agenda being forced upon America. It’s time to fight back!", "link": "https://podcasts.apple.com/us/podcast/hold-the-line-podcast/id1572540011"}, {"title": "The National Pulse", "producer": "The National Pulse", "genre": "News", "rating": 4.9, "num_ratings": 2100, "num_episodes": 55, "description": "Raheem Kassam hosts The National Pulse, real news and investigations podcast with investigative reporter Natalie Winters and guest hosts.", "link": "https://podcasts.apple.com/us/podcast/the-national-pulse/id1551541889"}, {"title": "Real Coffee with Scott Adams", "producer": "Scott Adams", "genre": "News", "rating": 4.6, "num_ratings": 430, "num_episodes": 626, "description": "Scott Adams discusses the latest happenings in the world through a persuasion filter. Support this podcast: https://anchor.fm/scott-adams00/support", "link": "https://podcasts.apple.com/us/podcast/real-coffee-with-scott-adams/id1494763610"}, {"title": "Real Time with Bill Maher", "producer": "HBO", "genre": "News", "rating": 4.1, "num_ratings": 13700, "num_episodes": 100, "description": "Download and watch full episodes of Real Time with Bill Maher including his New Rules and Overtime segments with his guest panelists. New episodes of Real Time with Bill Maher air Fridays at 10, only on HBO.", "link": "https://podcasts.apple.com/us/podcast/real-time-with-bill-maher/id98746009"}, {"title": "The NPR Politics Podcast", "producer": "NPR", "genre": "News", "rating": 4.5, "num_ratings": 22600, "num_episodes": 1062, "description": "Every weekday, NPR's best political reporters are there to explain the big news coming out of Washington and the campaign trail. They don't just tell you what happened. They tell you why it matters. Every afternoon.", "link": "https://podcasts.apple.com/us/podcast/the-npr-politics-podcast/id1057255460"}, {"title": "NPR News Now", "producer": "NPR", "genre": "News", "rating": 4.3, "num_ratings": 9500, "num_episodes": 1, "description": "The latest news in five minutes. Updated hourly.", "link": "https://podcasts.apple.com/us/podcast/npr-news-now/id121493675"}, {"title": "The Daily Beans", "producer": "Starburns Audio", "genre": "News", "rating": 4.8, "num_ratings": 1900, "num_episodes": 616, "description": "The Daily Beans is a women-owned and operated progressive news podcast for your morning commute brought to you by the Webby award-winning hosts of Mueller, She Wrote. Get your social justice and political news with just the right amount of snark.", "link": "https://podcasts.apple.com/us/podcast/the-daily-beans/id1473747182"}, {"title": "Fear & Malding", "producer": "Kast Media | Hasan Piker & Will Neff", "genre": "News", "rating": 5.0, "num_ratings": 2100, "num_episodes": 9, "description": "On Fear & Malding Hasan Piker and Will Neff look at recent events from a left-leaning, satirical point of view. In an era where real life events transcend any comedic writing, Fear & Malding attempts to make sense of the senseless mania by looking at the material reasons behind actions, and offers historical perspective when necessary. Hasan and Will refuse to shy away from asking important questions like \"Are democratic politicians intergalactic space vampires?\", \"Does Nancy Pelosi smell like sulfur?\", and \"Is there a more valiant social justice cause than Intactivisim?\"", "link": "https://podcasts.apple.com/us/podcast/fear-malding/id1564531019"}, {"title": "Axios Re:Cap", "producer": "Axios", "genre": "News", "rating": 4.3, "num_ratings": 657, "num_episodes": 672, "description": "Each weekday afternoon, Axios' Dan Primack unpacks the biggest story of the day and why it matters. Dan and his guests - global business leaders, influential political operators, and reporters chasing huge scoops - take you inside the accelerating forces, technologies and trends that are remaking your world and work. About Axios: Axios is a digital media company launched in 2017. Axios - which means “worthy” in Greek - helps you become smarter, faster with news and information across politics, tech, business, media, science and the world. Subscribe to our newsletters at axios.com/newsletters and download our mobile app at axios.com/app About Dan Primack: Dan is the host of Axios Re:Cap. He is also a business editor at Axios and author of the daily Axios Pro Rata newsletter where he covers the world of dealmakers across VC, PE and M&A. Previously, he was a senior editor at Fortune magazine and Thomson Reuters.", "link": "https://podcasts.apple.com/us/podcast/axios-re-cap/id1412162689"}, {"title": "Pantsuit Politics", "producer": "Sarah & Beth", "genre": "News", "rating": 4.6, "num_ratings": 3800, "num_episodes": 607, "description": "Editors’ Notes: “I think there's a lot of valid, complicated, hard differences in America right now,” says Sarah Stewart Holland, co-host of Pantsuit Politics, a biweekly podcast in which she and longtime friend Beth Silvers tackle the ideological polarization in US politics head-on with nuanced, intelligent discussions. “I think what we try to do is say, 'We see it. We see how hard it is.' Sometimes, it's not a political question or a political solution as far as who you vote for or what party you are in and then the conversation's over, because there's really hard, complicated discussions to be had beyond just your political party.”Since the show started in 2015, the Kentucky-based Holland and Silvers sought to subvert the traditional left-right punditry of cable news to have what they describe as “grace-filled conversations” which are more community-driven and derive from their own shared values and friendship. Both women grew up in Kentucky, studied law, and are raising families. It’s in those shared experiences that they’re able to stay truthful with each other, but also with their listeners—many of whom appreciate their views regardless of the differences they might have. “We hear a lot of ‘You're like our political therapists, you're our internet moms,’” Silvers says. “That feels right to me, because I think there are a lot of people who listen to our show who rarely agree with my political perspective, but they just like something about being able to sit and hear the news with us and know that we care about their feelings even if they are different than ours. That feels like the most important thing we can do right now.”", "link": "https://podcasts.apple.com/us/podcast/pantsuit-politics/id1055348656"}, {"title": "The Journal‪.‬", "producer": "The Wall Street Journal", "genre": "News", "rating": 4.3, "num_ratings": 2900, "num_episodes": 301, "description": "The most important stories, explained through the lens of business. A podcast about money, business and power. Hosted by Kate Linebaugh and Ryan Knutson. The Journal is a co-production from Gimlet Media and The Wall Street Journal.", "link": "https://podcasts.apple.com/us/podcast/the-journal/id1469394914"}, {"title": "In the Dark", "producer": "American Public Media", "genre": "News", "rating": 4.6, "num_ratings": 24300, "num_episodes": 43, "description": "Serial investigative journalism from APM Reports, with host Madeleine Baran and a team of reporters. Season 1 looked at the abduction of Jacob Wetterling in rural Minnesota and the accountability of sheriffs in solving crime. Season 2 examined the case of Curtis Flowers, who was tried six times for the same crime. Also, a special report on Covid-19 in the Mississippi Delta.", "link": "https://podcasts.apple.com/us/podcast/in-the-dark/id1148175292"}, {"title": "Bloggingheads.tv: The Glenn Show", "producer": "Bloggingheads.tv", "genre": "News", "rating": 4.9, "num_ratings": 1400, "num_episodes": 89, "description": "Glenn Loury invites guests from the worlds of academia, journalism and public affairs to share insights on economic, political and social issues.", "link": "https://podcasts.apple.com/us/podcast/bloggingheads-tv-the-glenn-show/id505824976"}, {"title": "Q Clearance: The Hunt for QAnon", "producer": "iHeartRadio", "genre": "News", "rating": 4.2, "num_ratings": 819, "num_episodes": 14, "description": "An investigative podcast series that aims to uncover the true identity of QAnon", "link": "https://podcasts.apple.com/us/podcast/q-clearance-the-hunt-for-qanon/id1534027012"}, {"title": "Subliminal Jihad", "producer": "Subliminal Jihad", "genre": "News", "rating": 4.7, "num_ratings": 67, "num_episodes": 83, "description": "A podcast exploring deep politics, occult history, conspiracy, and ontological ops from a critical-paranoid perspective. Hosted by Khalid (@khalidbinyaqub) & Dimitri (@drposhlost).For access to premium episodes and the SJ Discord server, become a patron at patreon.com/subliminaljihad.", "link": "https://podcasts.apple.com/us/podcast/subliminal-jihad/id1527853287"}, {"title": "WSJ Minute Briefing", "producer": "The Wall Street Journal", "genre": "News", "rating": 4.3, "num_ratings": 441, "num_episodes": 20, "description": "The top business headlines from The Wall Street Journal, three times daily. Whether it’s the latest on overseas markets, economic news out of Washington or closing numbers from Wall Street, you'll be in the know in a flash.", "link": "https://podcasts.apple.com/us/podcast/wsj-minute-briefing/id1202441485"}, {"title": "Politicology", "producer": "Politicology", "genre": "News", "rating": 4.8, "num_ratings": 15000, "num_episodes": 117, "description": "Politics in America is transforming. We’re embarking on a new series to deepen our understanding of who we are, how we got here, and how we rebuild without repeating the mistakes of the past. Ron Steslow hosts academics, behavioral economists, social psychologists, politicos, philosophers, anthropologists, journalists, poets, and storytellers—and more—to discuss America’s political present and future and dive into the deeper problems we face as a nation. Email us questions or comments: podcast@politicology.com.", "link": "https://podcasts.apple.com/us/podcast/politicology/id1514968525"}, {"title": "MarketFoolery", "producer": "The Motley Fool", "genre": "News", "rating": 4.7, "num_ratings": 1600, "num_episodes": 1938, "description": "The Motley Fool's daily look at stocks in the news, the top business/investing stories, and occasional tangents.", "link": "https://podcasts.apple.com/us/podcast/marketfoolery/id413551999"}, {"title": "Face the Nation on the Radio", "producer": "CBS News", "genre": "News", "rating": 3.6, "num_ratings": 839, "num_episodes": 183, "description": "Margaret Brennan asks the biggest guests the smartest questions. Hear official Washington on the firing line, on your schedule.", "link": "https://podcasts.apple.com/us/podcast/face-the-nation-on-the-radio/id78911087"}, {"title": "The Glenn Beck Program", "producer": "Blaze Podcast Network", "genre": "News", "rating": 4.6, "num_ratings": 15000, "num_episodes": 1914, "description": "Storytelling, insight and compelling perspective on American culture and politics. Glenn Beck's quick wit, candid opinions and engaging personality have made this one of the most popular radio programs in America. Watch The Glenn Beck Radio Program, Monday through Friday, 9am - 12pm ET on BlazeTV. www.BlazeTV.com/Glenn", "link": "https://podcasts.apple.com/us/podcast/the-glenn-beck-program/id620967489"}, {"title": "Armstrong & Getty On Demand", "producer": "iHeartRadio", "genre": "News", "rating": 4.6, "num_ratings": 2300, "num_episodes": 2000, "description": "The official On-Demand podcast of The A&G Show!", "link": "https://podcasts.apple.com/us/podcast/armstrong-getty-on-demand/id1259438987"}, {"title": "WSJ Opinion: Potomac Watch", "producer": "The Wall Street Journal", "genre": "News", "rating": 4.1, "num_ratings": 1700, "num_episodes": 20, "description": "From the award-winning opinion pages of The Wall Street Journal, Paul Gigot, Kim Strassel and Bill McGurn discuss the latest from Washington. Get critical perspective and the analysis you need on developments from the nation’s capital. Join them every Tuesday, Wednesday and Friday.", "link": "https://podcasts.apple.com/us/podcast/wsj-opinion-potomac-watch/id971901464"}, {"title": "Consider This from NPR", "producer": "NPR", "genre": "News", "rating": 4.2, "num_ratings": 4000, "num_episodes": 371, "description": "Every weekday afternoon, the hosts of NPR's All Things Considered help you make sense of a major news story and what it means for you in 15 minutes. In participating regions, you'll also hear from local journalists about what's happening in your community.", "link": "https://podcasts.apple.com/us/podcast/consider-this-from-npr/id1503226625"}, {"title": "FT News Briefing", "producer": "Financial Times", "genre": "News", "rating": 4.6, "num_ratings": 269, "num_episodes": 687, "description": "A rundown of the most important global business stories you need to know for the coming day, from the newsroom of the Financial Times. Available every weekday morning.", "link": "https://podcasts.apple.com/us/podcast/ft-news-briefing/id1438449989"}, {"title": "1A", "producer": "NPR", "genre": "News", "rating": 4.3, "num_ratings": 3700, "num_episodes": 300, "description": "1A is home to the national conversation. The show frames the best debates with great guests in ways to make you think, share and engage.", "link": "https://podcasts.apple.com/us/podcast/1a/id1188724250"}, {"title": "The Dana Show with Dana Loesch", "producer": "Radio America", "genre": "News", "rating": 4.7, "num_ratings": 2200, "num_episodes": 1000, "description": "Each day Dana publishes 2 podcasts ... Dana's full daily show covering the issues of the day and The Absurd Truth: Dana’s daily dose of the weird, unusual and the hilarious.  Fifteen minutes of absurd fun 5 days a week.", "link": "https://podcasts.apple.com/us/podcast/the-dana-show-with-dana-loesch/id279620985"}, {"title": "Useful Idiots with Matt Taibbi and Katie Halper", "producer": "Useful Idiots, LLC | Cumulus Podcast Network", "genre": "News", "rating": 4.7, "num_ratings": 3800, "num_episodes": 102, "description": "Useful Idiots is an informative and irreverent politics podcast with journalist Matt Taibbi and podcaster/writer Katie Halper. Episodes feature on-the-road coverage of the 2020 campaign and exclusive interviews, with humor, commentary and dissection of the politics news of the week. Join Matt and Katie as they examine important stories that have slipped through the cracks and what the media got wrong – and laugh about whatever is left to laugh about.", "link": "https://podcasts.apple.com/us/podcast/useful-idiots-with-matt-taibbi-and-katie-halper/id1476110521"}, {"title": "The Documentary Podcast", "producer": "BBC", "genre": "News", "rating": 4.4, "num_ratings": 1400, "num_episodes": 300, "description": "Download the latest documentaries investigating global developments, issues and affairs.", "link": "https://podcasts.apple.com/us/podcast/the-documentary-podcast/id73802620"}, {"title": "Rough Translation", "producer": "NPR", "genre": "News", "rating": 4.8, "num_ratings": 7000, "num_episodes": 67, "description": "Rough Translation is a podcast about cultural mistranslations and what we can learn from them. Usually, we're heading to far off places to bring you stories that hit close to home. This spring, with the help NPR's Veterans Correspondent Quil Lawrence, we're taking on a cultural divide that's closer to home. One many Americans might not know is there.", "link": "https://podcasts.apple.com/us/podcast/rough-translation/id1268047665"}, {"title": "The Clay Travis and Buck Sexton Show", "producer": "iHeartRadio", "genre": "News", "rating": 4.5, "num_ratings": 6100, "num_episodes": 394, "description": "The Clay Travis and Buck Sexton Show.  Inspired by Rush Limbaugh, Clay Travis and Buck Sexton carry on a new form of broadcast excellence in the tradition of the late radio icon as they tackle the biggest stories in news, politics and current events with intelligence and humor. From the border crisis, to the madness of cancel culture and far-left missteps, Clay and Buck guide listeners through the latest headlines and hot topics with fun and entertaining conversations and opinions.", "link": "https://podcasts.apple.com/us/podcast/the-clay-travis-and-buck-sexton-show/id1498106610"}, {"title": "20/20", "producer": "ABC News", "genre": "News", "rating": 4.0, "num_ratings": 2200, "num_episodes": 32, "description": "ABC's 20/20 is the primetime news magazine program featuring newsmaker interviews, hard-hitting investigative reports, exclusives, compelling features and medical mysteries.", "link": "https://podcasts.apple.com/us/podcast/20-20/id987967575"}, {"title": "Wall Street Breakfast", "producer": "Seeking Alpha", "genre": "News", "rating": 4.0, "num_ratings": 628, "num_episodes": 1078, "description": "Seeking Alpha's Wall Street Breakfast brings you all the news you need to know for your market day. Released by 800am ET each morning, it is a quick listen that you can put on as you get ready to start your working day. We also publish a weekend Stocks to Watch podcast to prepare you for the week ahead.", "link": "https://podcasts.apple.com/us/podcast/wall-street-breakfast/id1358381502"}, {"title": "Verdict with Ted Cruz", "producer": "Ted Cruz", "genre": "News", "rating": 4.7, "num_ratings": 37200, "num_episodes": 81, "description": "Join Senator Ted Cruz and co-host Michael Knowles as they break down the most important news stories of the day and reveal what they mean for you. On \"Verdict with Ted Cruz,” you will go behind the scenes of the political debates that define our country.", "link": "https://podcasts.apple.com/us/podcast/verdict-with-ted-cruz/id1495601614"}, {"title": "60 Minutes", "producer": "CBS News", "genre": "News", "rating": 3.8, "num_ratings": 2100, "num_episodes": 313, "description": "Get the biggest scoops and best storytelling on television from 60 Minutes - on your schedule. Now you can listen to the show in its entirety every week. 60 Minutes is the most successful broadcast in television history with more than 80 Emmys under its belt. 60 Minutes is also the only show to obtain interviews with every American president from Richard Nixon to Donald Trump.", "link": "https://podcasts.apple.com/us/podcast/60-minutes/id81210923"}, {"title": "The Tom Woods Show", "producer": "Tom Woods", "genre": "News", "rating": 4.8, "num_ratings": 2700, "num_episodes": 750, "description": "Join New York Times bestselling author Tom Woods for your daily serving of liberty education! Guests include Ron Paul, Judge Andrew Napolitano, David Stockman, and hundreds more, with topics like war, the Federal Reserve, net neutrality, the FDA, Austrian economics, and many other subjects of interest to libertarians. Join us!", "link": "https://podcasts.apple.com/us/podcast/the-tom-woods-show/id716825890"}, {"title": "Serial", "producer": "WBEZ", "genre": "News", "rating": 4.5, "num_ratings": 67600, "num_episodes": 46, "description": "Serial is a podcast from Serial Productions, a New York Times company, hosted by Sarah Koenig. Serial unfolds one story - a true story - over the course of a whole season. The show follows the plot and characters wherever they lead, through many surprising twists and turns. Sarah won't know what happens at the end of the story until she gets there, not long before you get there with her. Each week she'll bring you the latest chapter, so it's important to listen in, starting with Episode 1. New episodes are released on Thursday mornings.", "link": "https://podcasts.apple.com/us/podcast/serial/id917918570"}, {"title": "Playbook Deep Dive", "producer": "POLITICO", "genre": "News", "rating": 4.1, "num_ratings": 1200, "num_episodes": 316, "description": "Welcome to Playbook Deep Dive, the stories behind the power. From Congress and the White House to bar stools and back rooms, POLITICO's top reporters and Playbook authors bring you the most compelling and confounding stories that explain what’s really going on in Washington.", "link": "https://podcasts.apple.com/us/podcast/playbook-deep-dive/id1111319839"}, {"title": "Please, Go On with James Hohmann", "producer": "The Washington Post", "genre": "News", "rating": 4.5, "num_ratings": 137, "num_episodes": 4, "description": "Washington Post columnist James Hohmann chats with the voices behind the viewpoints. Hohmann sits down each week with the author of a compelling or unexpected guest column for The Post’s Opinions section. Together, they unpack arguments that are shaping the public conversation about issues of importance. “Please, Go On” features marquee names, as well as everyday people with original perspectives. New episodes released Fridays.", "link": "https://podcasts.apple.com/us/podcast/please-go-on-with-james-hohmann/id1570905813"}, {"title": "Death in Ice Valley", "producer": "BBC", "genre": "News", "rating": 4.5, "num_ratings": 2500, "num_episodes": 16, "description": "An unidentified body. Who was she? Why hasn’t she been missed? A BBC World Service and NRK original podcast, investigating a mystery unsolved for almost half a century.", "link": "https://podcasts.apple.com/us/podcast/death-in-ice-valley/id1357695290"}, {"title": "The Times: Daily news from the L.A. Times", "producer": "Los Angeles Times", "genre": "News", "rating": 4.1, "num_ratings": 261, "num_episodes": 43, "description": "“The Times” is a podcast from the Los Angeles Times hosted by columnist Gustavo Arellano along with reporters from our diverse newsroom. Every weekday, our podcast takes listeners beyond the headlines, with our West Coast outlook on the world. News, entertainment, the environment, immigration, politics, the criminal justice system, the social safety net, food and culture — “The Times” exists at the epicenter of it all. Through interviews and original stories, “The Times” is the audio guide you need to understand the day’s news, the world and how California shapes it.  Listen everywhere podcasts are available.", "link": "https://podcasts.apple.com/us/podcast/the-times-daily-news-from-the-l-a-times/id1563351107"}, {"title": "The Trey Gowdy Podcast", "producer": "FOX News Channel", "genre": "News", "rating": 4.8, "num_ratings": 5800, "num_episodes": 86, "description": "Trey Gowdy former federal prosecutor and four term United States Congressman from South Carolina brings his one of a kind style to the podcast platform. Every week you’ll hear original commentaries and power player interviews. Don't be surprised if his former congressional colleagues stop by from time to time as well.", "link": "https://podcasts.apple.com/us/podcast/the-trey-gowdy-podcast/id1509074854"}, {"title": "Office Hours with Georgia Howe", "producer": "The Daily Wire", "genre": "News", "rating": 5.0, "num_ratings": 187, "num_episodes": 17, "description": "Welcome to Office Hours with Georgia Howe, The Daily Wire’s companion show to the famous PragerU “5-Minute Videos.” Every week, converted liberal and former teacher Georgia Howe hosts an in-depth discussion with a PragerU expert about their 5-minute video topic. Georgia’s journey from the political Left offers a unique perspective when asking guests about topics like Communist China, socialism, or Antifa. Watch her unravel the lies that are told in America’s classrooms and go beyond the basics with these PragerU experts to hear their powerful stories.", "link": "https://podcasts.apple.com/us/podcast/office-hours-with-georgia-howe/id1571387103"}, {"title": "The MeidasTouch Podcast", "producer": "MeidasTouch", "genre": "News", "rating": 4.9, "num_ratings": 2600, "num_episodes": 68, "description": "MeidasTouch's hard-hitting political ads have been watched by millions and were instrumental in winning the presidency and taking back the Senate. Now, listen as the brothers behind MeidasTouch provide commentary and try to make sense of the chaotic news cycle. Because truth is golden.  Support this podcast: https://anchor.fm/meidastouch/support", "link": "https://podcasts.apple.com/us/podcast/the-meidastouch-podcast/id1510240831"}, {"title": "Rudy Giuliani's Common Sense", "producer": "www.RudyGiulianiCS.com", "genre": "News", "rating": 4.3, "num_ratings": 2700, "num_episodes": 100, "description": "Rudy Giuliani gives insight on leadership, courage and the most pressing issues of our time.", "link": "https://podcasts.apple.com/us/podcast/rudy-giulianis-common-sense/id1505388703"}, {"title": "Talking Feds", "producer": "Harry Litman | L.A. Times Studios", "genre": "News", "rating": 4.8, "num_ratings": 2300, "num_episodes": 141, "description": "TALKING FEDS is a roundtable discussion that brings together prominent former government officials, journalists, and special guests for a dynamic and in-depth analysis of the most pressing questions in law and politics.", "link": "https://podcasts.apple.com/us/podcast/talking-feds/id1456045551"}, {"title": "The Buck Sexton Show", "producer": "Premiere Networks", "genre": "News", "rating": 4.8, "num_ratings": 4000, "num_episodes": 1340, "description": "Buck Sexton breaks down the latest headlines with a fresh and honest perspective! He speaks truth to power, and cuts through the liberal nonsense coming from the mainstream media. Interact with Buck by emailing him at teambuck@iheartmedia.com", "link": "https://podcasts.apple.com/us/podcast/the-buck-sexton-show/id1208232103"}, {"title": "The Daily", "producer": "The New York Times", "genre": "News", "rating": 4.5, "num_ratings": 79000, "num_episodes": 1260, "description": "This is what the news should sound like. The biggest stories of our time, told by the best journalists in the world. Hosted by Michael Barbaro. Twenty minutes a day, five days a week, ready by 6 a.m.", "link": "https://podcasts.apple.com/us/podcast/the-daily/id1200361736"}, {"title": "The Last Word with Lawrence O’Donnell", "producer": "NBC News", "genre": "News", "rating": 4.6, "num_ratings": 3700, "num_episodes": 5, "description": "Drawing upon his experience as a former chief of staff on the Senate Finance Committee and as an Emmy-winning executive producer and writer of ‘The West Wing,’ Lawrence O’Donnell examines the compelling and impactful political stories of the day. Join him every weeknight.", "link": "https://podcasts.apple.com/us/podcast/the-last-word-with-lawrence-odonnell/id1316084734"}, {"title": "Citations Needed", "producer": "Nima Shirazi and Adam Johnson", "genre": "News", "rating": 4.9, "num_ratings": 3100, "num_episodes": 180, "description": "Citations Needed is a podcast about the intersection of media, PR, and power, hosted by Nima Shirazi and  Adam Johnson.", "link": "https://podcasts.apple.com/us/podcast/citations-needed/id1258545975"}, {"title": "The Chuck ToddCast: Meet the Press", "producer": "NBC News", "genre": "News", "rating": 4.0, "num_ratings": 2000, "num_episodes": 272, "description": "Chuck Todd at his best – unscripted, informed and focused on what really matters in politics. Join Chuck each Wednesday as he talks with top reporters from the nation’s capital, plus exclusive sit-down interviews and on-the-ground dispatches from across the campaign trail.", "link": "https://podcasts.apple.com/us/podcast/the-chuck-toddcast-meet-the-press/id1156592336"}, {"title": "The Dispatch Podcast", "producer": "The Dispatch", "genre": "News", "rating": 4.7, "num_ratings": 1600, "num_episodes": 130, "description": "Host Sarah Isgur is joined by Steve Hayes, Jonah Goldberg, and David French for a weekly thoughtful discussion on politics, policy, and culture.", "link": "https://podcasts.apple.com/us/podcast/the-dispatch-podcast/id1493229344"}, {"title": "Cuomo Prime Time with Chris Cuomo", "producer": "CNN", "genre": "News", "rating": 4.0, "num_ratings": 2000, "num_episodes": 201, "description": "Cuomo Prime Time with Chris Cuomo gets after it with newsmakers in Washington and around the world through in-depth, one-on-one interviews and analysis of the latest breaking news.", "link": "https://podcasts.apple.com/us/podcast/cuomo-prime-time-with-chris-cuomo/id1393858741"}, {"title": "Bill O’Reilly’s No Spin News and Analysis", "producer": "Bill O'Reilly", "genre": "News", "rating": 3.5, "num_ratings": 9200, "num_episodes": 1357, "description": "No Spin. Just Facts. Always looking out for you. Head to BillOReilly.com for more analysis.", "link": "https://podcasts.apple.com/us/podcast/bill-oreillys-no-spin-news-and-analysis/id1126543994"}, {"title": "Commentary Magazine Podcast", "producer": "Ricochet.com", "genre": "News", "rating": 4.7, "num_ratings": 3100, "num_episodes": 500, "description": "Commentary is America's premier monthly magazine of opinion: General, yet Jewish. Highly variegated, with a unifying perspective.", "link": "https://podcasts.apple.com/us/podcast/commentary-magazine-podcast/id1081967784"}, {"title": "The Editors", "producer": "National Review", "genre": "News", "rating": 4.6, "num_ratings": 3300, "num_episodes": 323, "description": "A weekly discussion of current events with Rich Lowry, Charles C. W. Cooke, Michael Brendan Dougherty, and Jim Geraghty. The most recent ten episodes of this podcast are available on this feed; full archives are available to NRPLUS subscribers at NationalReview.com.", "link": "https://podcasts.apple.com/us/podcast/the-editors/id1150237453"}, {"title": "Stay Tuned with Preet", "producer": "CAFE", "genre": "News", "rating": 4.8, "num_ratings": 30600, "num_episodes": 368, "description": "Join former U.S. Attorney Preet Bharara as he breaks down legal topics in the news and engages thought leaders in a podcast about power, policy, and justice.", "link": "https://podcasts.apple.com/us/podcast/stay-tuned-with-preet/id1265845136"}, {"title": "American Conservative University", "producer": "American Conservative University", "genre": "News", "rating": 4.2, "num_ratings": 2100, "num_episodes": 499, "description": "All free!! All educational. All entertaining. All professionally recorded.No empty rhetoric here. Just entertaining learning.Choose from many different topics from the best talent around the world.Visit us at americanconservativeuniversity.com", "link": "https://podcasts.apple.com/us/podcast/american-conservative-university/id122415315"}, {"title": "POLITICO Dispatch", "producer": "POLITICO", "genre": "News", "rating": 4.4, "num_ratings": 303, "num_episodes": 371, "description": "We take you inside POLITICO, where journalists break news, work sources and pull back the curtain on politics and policy. Fast. Short. Daily.", "link": "https://podcasts.apple.com/us/podcast/politico-dispatch/id1500970749"}, {"title": "The Laura Ingraham Show", "producer": "PodcastOne", "genre": "News", "rating": 4.0, "num_ratings": 4500, "num_episodes": 100, "description": "The most-watched woman in the history of cable news takes her trademark no-holds barred political and cultural commentary to the world of podcasting with \"The Laura Ingraham Show,\" a part of the Quake Media network. A bestselling author, a breast cancer survivor, and the mother of three internationally-adopted children, Laura was the most listened-to woman in talk radio before making the move to podcasting. Laura has been a trailblazer across multiple media platforms, and she brings a unique perspective to this twice-weekly show thanks in part to her experiences as a white-collar criminal defense litigator and a Supreme Court law clerk. Want to hear episodes before everyone else? Subscribe at quakemedia.com/laura to join the Quake community.", "link": "https://podcasts.apple.com/us/podcast/the-laura-ingraham-show/id914065708"}, {"title": "The FOX News Rundown", "producer": "FOX News Channel", "genre": "News", "rating": 3.6, "num_ratings": 871, "num_episodes": 1330, "description": "The FOX News Rundown is a news-based daily morning podcast. Each morning, Jacqui Heinrich, Dave Anthony, Lisa Brady, Jessica Rosenthal and Chris Foster take a deep dive into the major and controversial stories of the day, tapping into the massive reporting resources of FOX News to provide a full picture of the news. You'll hear a contrast of perspectives you may not hear elsewhere while going far beyond the basic headlines. Each day The FOX News Rundown features insight from top newsmakers, along with FOX News reporters and contributors, plus a daily commentary on a significant issue of the day. Check us out each morning.", "link": "https://podcasts.apple.com/us/podcast/the-fox-news-rundown/id1303660358"}, {"title": "Pod Save the World", "producer": "Crooked Media", "genre": "News", "rating": 4.8, "num_ratings": 21500, "num_episodes": 229, "description": "“Pod Save America” cohost Tommy Vietor thought foreign policy was boring and complicated until he got the education of a lifetime working for President Obama’s National Security Council. On “Pod Save the World,” he and former deputy national security adviser Ben Rhodes break down the latest developments and bring you behind the scenes with the people who were there. New episodes every Wednesday.", "link": "https://podcasts.apple.com/us/podcast/pod-save-the-world/id1200016351"}, {"title": "KCRW's Left, Right & Center", "producer": "KCRW", "genre": "News", "rating": 4.1, "num_ratings": 3700, "num_episodes": 305, "description": "Left, Right & Center is KCRW’s weekly civilized yet provocative confrontation over politics, policy and pop culture.", "link": "https://podcasts.apple.com/us/podcast/kcrws-left-right-center/id73329771"}, {"title": "What A Day", "producer": "Crooked Media", "genre": "News", "rating": 4.7, "num_ratings": 10000, "num_episodes": 300, "description": "What A Day cuts through all the chaos and clickbait to help you understand what matters and how you can fix it—all in just 20 minutes. Comedian Akilah Hughes and reporter Gideon Resnick break down the biggest news of the day, share important stories you may have missed, and show you what “Fox & Friends” would sound like if it were hosted by two people whose parents read to them as children. New episodes Monday through Friday at 5 a.m. EST.", "link": "https://podcasts.apple.com/us/podcast/what-a-day/id1483692776"}, {"title": "Snacks Daily", "producer": "Robinhood Financial, LLC", "genre": "News", "rating": 4.6, "num_ratings": 8200, "num_episodes": 537, "description": "Digestible financial news. Get smarter fast with an entertaining breakdown of our top 3 business stories in 15 minutes. Pairs perfectly with your commute, workout, or morning oatmeal ritual. Hosted by Jack Kramer and Nick Martell.", "link": "https://podcasts.apple.com/us/podcast/snacks-daily/id1386234384"}, {"title": "John Solomon Reports", "producer": "John Solomon", "genre": "News", "rating": 4.8, "num_ratings": 4300, "num_episodes": 279, "description": "Award-winning investigative journalist John Solomon, who helped unravel the bogus Russia collusion scandal, gives you his exclusive reporting and big newsmaker interviews every Tuesday and Thursday. To get the unvarnished truth about what’s really going on in Washington, subscribe today to John Solomon Reports.", "link": "https://podcasts.apple.com/us/podcast/john-solomon-reports/id1495251160"}, {"title": "Pivot", "producer": "Recode", "genre": "News", "rating": 4.3, "num_ratings": 3800, "num_episodes": 232, "description": "Every Tuesday and Friday, Recode’s Kara Swisher and NYU Professor Scott Galloway offer sharp, unfiltered insights into the biggest stories in tech, business, and politics. They make bold predictions, pick winners and losers, and bicker and banter like no one else. After all, with great power comes great scrutiny. From New York Magazine and the Vox Media Podcast Network.", "link": "https://podcasts.apple.com/us/podcast/pivot/id1073226719"}, {"title": "Embedded", "producer": "NPR", "genre": "News", "rating": 4.7, "num_ratings": 11000, "num_episodes": 81, "description": "Host Kelly McEvers takes a story from the news and goes deep. Whether that means digging into the Trump administration's past, the stories behind police shootings caught on video, or visiting a town ravaged by the opioid epidemic, Embedded takes you where the news is happening.", "link": "https://podcasts.apple.com/us/podcast/embedded/id1091709555"}, {"title": "Unchained", "producer": "Laura Shin", "genre": "News", "rating": 4.6, "num_ratings": 978, "num_episodes": 261, "description": "Crypto assets and blockchain technology are about to transform every trust-based interaction of our lives, from financial services to identity to the Internet of Things. In this podcast, host Laura Shin, an independent journalist covering all things crypto, talks with industry pioneers about how crypto assets and blockchains will change the way we earn, spend and invest our money. Tune in to find out how Web 3.0, the decentralized web, will revolutionize our world. Disclosure: I'm a nocoiner.", "link": "https://podcasts.apple.com/us/podcast/unchained/id1123922160"}, {"title": "The Dan Bongino Show", "producer": "Westwood One", "genre": "News", "rating": 4.7, "num_ratings": 44500, "num_episodes": 1138, "description": "He’s a former Secret Service Agent, former NYPD officer, and New York Times best-selling author. Join Dan Bongino each weekday as he tackles the hottest political issues, debunking both liberal and Republican establishment rhetoric.", "link": "https://podcasts.apple.com/us/podcast/the-dan-bongino-show/id965293227"}, {"title": "The Five", "producer": "FOX News Channel", "genre": "News", "rating": 4.3, "num_ratings": 2200, "num_episodes": 4, "description": "The hot topics that have everyone talking from the five voices that will have everyone listening. Don't miss 'The Five' as they discuss, debate and at times debunk the hot news stories, controversies and issues of the day.", "link": "https://podcasts.apple.com/us/podcast/the-five/id1212380212"}, {"title": "The Dishcast with Andrew Sullivan", "producer": "Andrew Sullivan", "genre": "News", "rating": 4.7, "num_ratings": 335, "num_episodes": 33, "description": "Unafraid conversations about anything andrewsullivan.substack.com", "link": "https://podcasts.apple.com/us/podcast/the-dishcast-with-andrew-sullivan/id1536984072"}, {"title": "WSJ What’s News", "producer": "The Wall Street Journal", "genre": "News", "rating": 4.2, "num_ratings": 2600, "num_episodes": 20, "description": "What's News brings you the headlines and business news that move markets and the world—twice every weekday. In 10-12 minutes, get caught up on the best Wall Street Journal scoops and exclusives, with insight and analysis from the award-winning reporters that broke the stories. Hosted by Annmarie Fertoli and Marc Stewart.", "link": "https://podcasts.apple.com/us/podcast/wsj-whats-news/id152016440"}, {"title": "BreakPoint", "producer": "Colson Center", "genre": "Religion & Spirituality", "rating": 4.7, "num_ratings": 1500, "num_episodes": 94, "description": "Join John Stonestreet for a daily dose of sanity—applying a Christian worldview to culture, politics, movies, and more. And be a part of God's work restoring all things.", "link": "https://podcasts.apple.com/us/podcast/breakpoint/id324173353"}, {"title": "The Lawfare Podcast", "producer": "The Lawfare Institute", "genre": "News", "rating": 4.8, "num_ratings": 5400, "num_episodes": 912, "description": "The Lawfare Podcast features discussions with experts, policymakers, and opinion leaders at the nexus of national security, law, and policy. On issues from foreign policy, homeland security, intelligence, and cybersecurity to governance and law, we have doubled down on seriousness at a time when others are running away from it. Visit us at www.lawfareblog.com. See acast.com/privacy for privacy and opt-out information.", "link": "https://podcasts.apple.com/us/podcast/the-lawfare-podcast/id498897343"}, {"title": "Part Of The Problem", "producer": "Gas Digital Network", "genre": "News", "rating": 4.8, "num_ratings": 3100, "num_episodes": 20, "description": "Dave Smith expounds upon current events, our government, foreign policy, and all things Libertarian. He is part of the new generation of pundits. He'll educate you and open your eyes to the possibility of a truly free nation. The newest 15 episodes are always free, but if you want access to all the archives, watch live, chat live, access to the forums, and get the show a week before it comes out everywhere else - you can subscribe now at gasdigitalnetwork.com and use the code POTP to save 15% on the entire network.", "link": "https://podcasts.apple.com/us/podcast/part-of-the-problem/id833706616"}, {"title": "Relatable with Allie Beth Stuckey", "producer": "Blaze Podcast Network", "genre": "News", "rating": 4.8, "num_ratings": 11400, "num_episodes": 460, "description": "Upbeat and in-depth, Relatable with Allie Beth Stuckey breaks down the latest in culture, news, theology & politics from a Christian, conservative perspective. Allie’s fresh analysis of the most important issues provides an entertaining and effective way to stay in the know.", "link": "https://podcasts.apple.com/us/podcast/relatable-with-allie-beth-stuckey/id1359249098"}, {"title": "Un(re)solved", "producer": "FRONTLINE PBS", "genre": "News", "rating": 4.6, "num_ratings": 60, "num_episodes": 4, "description": "What prompted the FBI to reinvestigate over one hundred unsolved civil rights era murders? And what does justice look like for families whose loved ones were killed? Reporter James Edwards seeks answers to these questions, reflecting on his own family’s experiences along the way. Hear episode 1 on June 11.", "link": "https://podcasts.apple.com/us/podcast/un-re-solved/id1570266180"}, {"title": "POLITICO Playbook Daily Briefing", "producer": "POLITICO", "genre": "News", "rating": 4.3, "num_ratings": 418, "num_episodes": 600, "description": "POLITICO Playbook's must-listen briefing on what's driving the day in Washington.", "link": "https://podcasts.apple.com/us/podcast/politico-playbook-daily-briefing/id1169056746"}, {"title": "Chapo Trap House", "producer": "Chapo Trap House", "genre": "News", "rating": 4.6, "num_ratings": 7800, "num_episodes": 500, "description": "Podcast by Chapo Trap House", "link": "https://podcasts.apple.com/us/podcast/chapo-trap-house/id1097417804"}, {"title": "Revolutionary Left Radio", "producer": "Revolutionary Left Radio", "genre": "News", "rating": 4.8, "num_ratings": 2300, "num_episodes": 267, "description": "Discussing political philosophy, current events, activism, and the inevitable historical downfall of capitalism from a revolutionary leftist perspective.", "link": "https://podcasts.apple.com/us/podcast/revolutionary-left-radio/id1218054701"}, {"title": "Start Here", "producer": "ABC News", "genre": "News", "rating": 4.6, "num_ratings": 4600, "num_episodes": 50, "description": "A straightforward look at the day's top news in 20 minutes. Powered by ABC News. Hosted by Brad Mielke. Winner of the 2019 Edward R. Murrow Award for Excellence in Innovation.", "link": "https://podcasts.apple.com/us/podcast/start-here/id1355180130"}, {"title": "Up First", "producer": "NPR", "genre": "News", "rating": 4.6, "num_ratings": 46100, "num_episodes": 7, "description": "NPR's Up First is the news you need to start your day. The three biggest stories of the day, with reporting and analysis from NPR News — in 10 minutes. Available weekdays by 6 a.m. ET, with hosts Rachel Martin, Noel King and Steve Inskeep. Now available on Saturdays by 8 a.m. ET, with hosts Lulu Garcia-Navarro and Scott Simon. Subscribe and listen, then support your local NPR station at donate.npr.org.", "link": "https://podcasts.apple.com/us/podcast/up-first/id1222114325"}, {"title": "Dennis Prager Podcasts", "producer": "Salem Podcast Network", "genre": "News", "rating": 4.8, "num_ratings": 1100, "num_episodes": 101, "description": "Dennis Prager is one of the most respected and influential thinkers, writers, and speakers in America. Each day, he tackles topics of politics, faith, and culture with ease and expertise. His motto is, \"I prefer clarity to agreement.” He is deeply passionate about preserving America, the West, and the Judeo-Christian value system.", "link": "https://podcasts.apple.com/us/podcast/dennis-prager-podcasts/id1517302239"}, {"title": "The Stew Peters Show", "producer": "Stew Peters", "genre": "News", "rating": 4.9, "num_ratings": 122, "num_episodes": 100, "description": "Interviews, insight and patriotic perspective on American culture and politics. Stew Peter’s quick wit, candid opinions and engaging conversation have made this one of the most popular radio programs in America. Watch/listen to The PCRadio Show!• Political Analysis• Uncensored Content• Dynamic Interviews• Relentless Seekers of Truth", "link": "https://podcasts.apple.com/us/podcast/the-stew-peters-show/id1546652394"}, {"title": "5 Things", "producer": "USA TODAY", "genre": "News", "rating": 4.2, "num_ratings": 515, "num_episodes": 7, "description": "The news you need to know to start your day. Five top news stories and why they matter. Seven days a week, with deep-dive Sunday episodes. Powered by the USA TODAY Network and hosted by Taylor Wilson and Claire Thornton.", "link": "https://podcasts.apple.com/us/podcast/5-things/id975311694"}, {"title": "Mark Levin Podcast", "producer": "Westwood One", "genre": "News", "rating": 4.6, "num_ratings": 18500, "num_episodes": 984, "description": "Mark Levin is one of the hottest properties in Talk radio today. He is also one of the leading authors in the conservative political arena. Mark's radio show on WABC in New York City skyrocketed to Number 1 on the AM dial in his first 18 months on the air in the competitive 6:00 PM - 8:00 PM time slot. Mark's latest book, \"American Marxism,\" is out July 13, 2021. When your books are endorsed by Rush Limbaugh and Sean Hannity, you know you have a winner on your hands. In a short period of time, Mark has become one of the most listened to local radio Talk show hosts in the nation.", "link": "https://podcasts.apple.com/us/podcast/mark-levin-podcast/id209377688"}, {"title": "BardsFM", "producer": "Scott Kesterson", "genre": "News", "rating": 4.9, "num_ratings": 953, "num_episodes": 790, "description": "War is the teacher, soldiers its students. Faith and Knowledge the greatest weapons of war. Through stories, we reshape the narratives to strengthen our resolve, awaken the truth, expand our vision beyond the limits of the Matrix and bring us closer to God. In the end, God wins.", "link": "https://podcasts.apple.com/us/podcast/bardsfm/id1526915967"}, {"title": "VICE News Reports", "producer": "iHeartRadio", "genre": "News", "rating": 4.6, "num_ratings": 289, "num_episodes": 31, "description": "We bring you to the news, week by week. VICE News Reports takes you to the story as it unfolds, giving you the unfiltered sounds of the world today.", "link": "https://podcasts.apple.com/us/podcast/vice-news-reports/id1525769448"}, {"title": "Don Lemon Tonight", "producer": "CNN", "genre": "News", "rating": 2.9, "num_ratings": 62, "num_episodes": 29, "description": "Don Lemon Tonight brings in-depth analysis of the day's top news stories, and Don’s take on the stories that will get you talking.", "link": "https://podcasts.apple.com/us/podcast/don-lemon-tonight/id1568312326"}, {"title": "Pat Gray Unleashed", "producer": "Blaze Podcast Network", "genre": "News", "rating": 4.9, "num_ratings": 3400, "num_episodes": 937, "description": "Pat Gray pulls no punches, restoring common sense to a senseless world. Join Pat for unique analysis, insight, and fun. Watch Pat Gray Unleashed, Live Mon - Fri, 7- 9am ET on BlazeTV. www.BlazeTV.com/Pat", "link": "https://podcasts.apple.com/us/podcast/pat-gray-unleashed/id1280961263"}, {"title": "The Andrew Klavan Show", "producer": "The Daily Wire", "genre": "News", "rating": 4.8, "num_ratings": 17200, "num_episodes": 1111, "description": "End of Western Civilization got you down? All is tickety-boo on The Andrew Klavan Show as Andrew laughs his way though Armageddon with political satire, cultural commentary, interviews and relentless mockery of racial pieties, sexual perversities, and feminist absurdities. Fridays at 8:30pm ET | 5:30pm PT.", "link": "https://podcasts.apple.com/us/podcast/the-andrew-klavan-show/id1045171376"}, {"title": "SGT Report's The Propaganda Antidote", "producer": "realsgtreport", "genre": "News", "rating": 4.7, "num_ratings": 607, "num_episodes": 100, "description": "New podcast wSGT Report's new podcast titled \"The Propaganda Antidote\". Providing exclusive interviews and the very latest breaking REAL news & information from the world’s most trusted alternative media sources, SGT Report is your daily source for truth in a time of universal deceit.", "link": "https://podcasts.apple.com/us/podcast/sgt-reports-the-propaganda-antidote/id1502568407"}, {"title": "Common Sense with Dan Carlin", "producer": "Wizzard Media", "genre": "News", "rating": 4.7, "num_ratings": 10100, "num_episodes": 22, "description": "Common Sense with Dan Carlin is an independent look at politics and current events from popular New Media personality Dan Carlin.Carlin's self-described \"Martian\" viewpoints infuse each episode with a political alien's take on the world around us and the problems it faces. It's a smart, unique (and admittedly U.S.-centric) program that doesn't dumb down the information or analysis for the slowest person in the room.Carlin's rapid-fire staccato voice has been compared to William Shatner after too many espressos. That, plus his penchant for making everyone in the audience mad at him eventually, makes for a witch's brew of a podcast that is not for everyone. But for those craving a deeper intellectual analysis, a less partisan approach and unpredictable outside-the-box revelations, Common Sense with Dan Carlin is a feast for the mind.", "link": "https://podcasts.apple.com/us/podcast/common-sense-with-dan-carlin/id155974141"}, {"title": "The Weeds", "producer": "Vox", "genre": "News", "rating": 4.4, "num_ratings": 7300, "num_episodes": 545, "description": "In politics, you’re often told not to get lost in the weeds. But we love the weeds! That’s where politics becomes policy – the stuff that shapes our lives. Every Tuesday and Friday, host Matthew Yglesias is joined by Vox reporters and editors, ProPublica's Dara Lind, and some of the leading minds in policy to dig into the weeds on important national issues, including healthcare, immigration, housing, and everything else that matters. Produced by Vox and the Vox Media Podcast Network.", "link": "https://podcasts.apple.com/us/podcast/the-weeds/id1042433083"}, {"title": "Rush Limbaugh: The Man Behind the Golden EIB Microphone", "producer": "iHeartRadio", "genre": "News", "rating": 4.9, "num_ratings": 1100, "num_episodes": 8, "description": "Narrated by James Golden, Limbaugh’s long-time call screener and “official show observer” known to listeners as “Bo Snerdley”, the 12-episode series will detail legendary radio host Rush Limbaugh’s award-winning, 30-plus year career in radio that revitalized the spoken-word format, and provided a platform for him to develop and lead modern conservatism in America. Featuring Limbaugh’s own words and never-before-heard stories shared by colleagues, friends and family, the series will give listeners a guided tour of the five-time Marconi Award winner’s historic journey from Cape Girardeau, Mo., to becoming the No. 1 talk radio host in America.  The series will also highlight Limbaugh’s lasting legacy, which includes “The Rush Limbaugh Show’s” continued dominance as the most-listened-to talk radio program in the U.S.", "link": "https://podcasts.apple.com/us/podcast/rush-limbaugh-the-man-behind-the-golden-eib-microphone/id1564134812"}, {"title": "Squawk on the Street", "producer": "CNBC", "genre": "News", "rating": 4.2, "num_ratings": 336, "num_episodes": 552, "description": "The opening hour of CNBC’s “Squawk on the Street” with Carl Quintanilla, Jim Cramer and David Faber is broadcast from the floor of the New York Stock Exchange, on site at the opening bell with the up-to-the-minute news investors need to know and interviews with the most influential Chief Executive Officers and greatest market minds.", "link": "https://podcasts.apple.com/us/podcast/squawk-on-the-street/id1475116211"}, {"title": "CoinDesk Podcast Network", "producer": "CoinDesk.com", "genre": "News", "rating": 4.8, "num_ratings": 358, "num_episodes": 658, "description": "The top stories and best shows in the blockchain world, delivered daily from the team at CoinDesk.", "link": "https://podcasts.apple.com/us/podcast/coindesk-podcast-network/id1414384043"}, {"title": "Pod Save America", "producer": "Crooked Media", "genre": "News", "rating": 4.5, "num_ratings": 72600, "num_episodes": 450, "description": "Four former aides to President Obama—Jon Favreau, Jon Lovett, Dan Pfeiffer and Tommy Vietor—are joined by journalists, politicians, activists, and more for a no-b******t conversation about politics. They cut through the noise to break down the week’s news, and help people figure out what matters and how they can help. New episodes Mondays and Thursdays.", "link": "https://podcasts.apple.com/us/podcast/pod-save-america/id1192761536"}, {"title": "The Axe Files with David Axelrod", "producer": "The Institute of Politics & CNN", "genre": "News", "rating": 4.5, "num_ratings": 6600, "num_episodes": 462, "description": "David Axelrod, the founder and director of the University of Chicago Institute of Politics, and CNN bring you The Axe Files, a series of revealing interviews with key figures in the political world. Go beyond the soundbites and get to know some of the most interesting players in politics.", "link": "https://podcasts.apple.com/us/podcast/the-axe-files-with-david-axelrod/id1043593599"}, {"title": "World News Tonight with David Muir", "producer": "ABC News", "genre": "News", "rating": 3.9, "num_ratings": 1100, "num_episodes": 182, "description": "With unparalleled resources, World News Tonight with David Muir provides the latest information and analysis of major events from around the country and the world.", "link": "https://podcasts.apple.com/us/podcast/world-news-tonight-with-david-muir/id218916008"}, {"title": "Sunday Sitdown with Willie Geist", "producer": "NBC News", "genre": "News", "rating": 4.5, "num_ratings": 2700, "num_episodes": 165, "description": "NBC's \"Sunday TODAY with Willie Geist\" provides sharp, conversational coverage of the day's news, along with in-depth profiles of the people and ideas shaping our culture. In his “Sunday Sitdowns,” Geist chats with some of the biggest names in news and pop culture, from actors and musicians to presidents and CEOs, about the stories behind their success. This podcast features the full, unedited versions of those conversations for an even deeper look at the names in the headlines. \"Sunday TODAY\" airs live on NBC from 8 a.m. - 9 a.m. ET. Check your local listings.", "link": "https://podcasts.apple.com/us/podcast/sunday-sitdown-with-willie-geist/id1370507232"}, {"title": "TrueAnon", "producer": "TrueAnon", "genre": "News", "rating": 4.6, "num_ratings": 1900, "num_episodes": 188, "description": "The only non-pedophile podcast focused on uncovering the truth of the Epstein conspiracy. Join unlicensed private investigators Liz Franczak, Brace Belden, & @yung-chomsky in their journey digging through the Ep-Files. Perverts: Your Pizza Order (Small Cheese) has been cancelled", "link": "https://podcasts.apple.com/us/podcast/trueanon/id1474001390"}, {"title": "Opening Arguments", "producer": "Opening Arguments Media LLC", "genre": "News", "rating": 4.8, "num_ratings": 2200, "num_episodes": 518, "description": "Every episode, legal expert Andrew and comic relief Thomas will tackle a popular legal topic and give you all the tools you need to understand the issue and win every argument you have on Facebook, with your Uncle Frank, or wherever someone is wrong on the Internet. It's law.  It's politics.  It's fun.  We don't tell you what to think, we just set up the Opening Arguments.", "link": "https://podcasts.apple.com/us/podcast/opening-arguments/id1147092464"}, {"title": "The New Yorker Radio Hour", "producer": "WNYC", "genre": "News", "rating": 4.3, "num_ratings": 3700, "num_episodes": 150, "description": "David Remnick is joined by The New Yorker’s award-winning writers, editors and artists to present a weekly mix of profiles, storytelling, and insightful conversations about the issues that matter — plus an occasional blast of comic genius from the magazine’s legendary Shouts and Murmurs page. The New Yorker has set a standard in journalism for generations and The New Yorker Radio Hour gives it a voice on public radio for the first time. Produced by The New Yorker and WNYC Studios.  WNYC Studios is a listener-supported producer of other leading podcasts including Radiolab, On the Media, Snap Judgment, Death, Sex & Money, Here’s the Thing with Alec Baldwin, Nancy and many more.   © WNYC Studios", "link": "https://podcasts.apple.com/us/podcast/the-new-yorker-radio-hour/id1050430296"}, {"title": "America First with Sebastian Gorka Podcast", "producer": "Salem Podcast Network", "genre": "News", "rating": 4.4, "num_ratings": 1700, "num_episodes": 100, "description": "\"America First\" was created by Dr. Sebastian Gorka (\"Dr.G\"), former Special Advisor to the President of the United States and Fox News National Security Strategist, to be the new front lines in the ongoing Culture War against the Left. In each episode, Dr.G will inform you about the Leftist assault on our traditional values and he will define how we win against them. Every episode features a retinue of amazing guests who augment the basic message that we must put our country first and we must be willing to fight for the values that made this country great.", "link": "https://podcasts.apple.com/us/podcast/america-first-with-sebastian-gorka-podcast/id1451874289"}, {"title": "The Will Cain Podcast", "producer": "FOX News Channel", "genre": "News", "rating": 4.8, "num_ratings": 915, "num_episodes": 26, "description": "Join FOX & Friends Weekend host Will Cain as he returns with his one of a kind style to the podcast platform. The Will Cain Podcast merges the worlds of news and sports, with a spotlight on listener interaction. Look for a double dose of Will each week on the FOX News Podcast Network.", "link": "https://podcasts.apple.com/us/podcast/the-will-cain-podcast/id1561365870"}, {"title": "FiveThirtyEight Politics", "producer": "ABC News", "genre": "News", "rating": 4.5, "num_ratings": 18700, "num_episodes": 201, "description": "Nate Silver and the FiveThirtyEight team cover the latest in politics, tracking the issues and \"game-changers\" every week.", "link": "https://podcasts.apple.com/us/podcast/fivethirtyeight-politics/id1077418457"}, {"title": "The John Batchelor Show", "producer": "John Batchelor", "genre": "News", "rating": 4.6, "num_ratings": 2100, "num_episodes": 400, "description": "The John Batchelor Show is a hard news-analysis radio program on current events, world history, global politics and natural sciences. Based in New York City for two decades, the show has travelled widely to report, from the Middle East to the South Caucasus to the Arabian Peninsula and East Asia.", "link": "https://podcasts.apple.com/us/podcast/the-john-batchelor-show/id589864479"}, {"title": "The Michael Savage Show", "producer": "Michael Savage", "genre": "News", "rating": 4.4, "num_ratings": 9600, "num_episodes": 335, "description": "Dr. Michael Savage earned his PhD in epidemiology and nutrition sciences from the Univ. of Cal. at Berkeley. Inducted into the National Radio Hall of Fame after over 26 years at the top of the talk radio format. Borders, Language and Culture are his pillars. A NY Times Best Selling author of over 30 books and novels, he was appointed by the President of the United States to the Board of the Presidio Trust. Not your father's conservative show! Animal rights activist. he converses about politics, science, films, mysticism, nutrition, cooking, cars and boats. News, views and reviews you can trust.", "link": "https://podcasts.apple.com/us/podcast/the-michael-savage-show/id635045292"}, {"title": "1619", "producer": "The New York Times", "genre": "News", "rating": 4.4, "num_ratings": 28600, "num_episodes": 7, "description": "In August of 1619, a ship carrying more than 20 enslaved Africans arrived in the English colony of Virginia. America was not yet America, but this was the moment it began. No aspect of the country that would be formed here has been untouched by the 250 years of slavery that followed. On the 400th anniversary of this fateful moment, it is time to tell the story.“1619” is a New York Times audio series hosted by Nikole Hannah-Jones. You can find more information about it at nytimes.com/1619podcast.", "link": "https://podcasts.apple.com/us/podcast/1619/id1476928106"}, {"title": "TODAY with Hoda & Jenna", "producer": "TODAY", "genre": "News", "rating": 5.0, "num_ratings": 5, "num_episodes": 3, "description": "Friendship, fun, and laughs! America’s feel-good morning show with big stars and sweet surprises. Hoda and Jenna inspire and empower with their impactful stories and heartfelt connection.", "link": "https://podcasts.apple.com/us/podcast/today-with-hoda-jenna/id1573273113"}, {"title": "The Majority Report with Sam Seder", "producer": "Sam Seder", "genre": "News", "rating": 4.7, "num_ratings": 2800, "num_episodes": 25, "description": "Entertaining Daily Politics, Award Winning Long-Form Interviews and Irreverent, Independent Analysis.  For more info see Majority.FM", "link": "https://podcasts.apple.com/us/podcast/the-majority-report-with-sam-seder/id402306412"}, {"title": "Dark To Light with Frank & Beanz", "producer": "Tracy Beanz and Frank Val", "genre": "News", "rating": 4.8, "num_ratings": 1200, "num_episodes": 151, "description": "“Dark To Light with Frank & Beanz” is a new podcast which seeks to transform how in depth reporting about complicated political topics reaches an audience who wishes they knew but can’t take the monotony of the mainstream media. By combining cutting edge investigative journalism, with sharp wit and pop culture punditry, “Dark To Light with Frank & Beanz” promises to enlighten about corruption in government, while allowing the audience to take a deep breath and have a laugh once in a while.", "link": "https://podcasts.apple.com/us/podcast/dark-to-light-with-frank-beanz/id1378104251"}, {"title": "Rush Limbaugh - Timeless Wisdom", "producer": "The Rush Limbaugh Show", "genre": "News", "rating": 4.4, "num_ratings": 4600, "num_episodes": 1176, "description": "Timeless words from Rush Limbaugh. Each day a timeless piece of wisdom from the archives of The Rush Limbaugh Show. Timeless wisdom....forever relevant. .", "link": "https://podcasts.apple.com/us/podcast/rush-limbaugh-timeless-wisdom/id1155318497"}, {"title": "Conspiracy Unlimited: Following The Truth Wherever It Leads", "producer": "Richard Syrett", "genre": "News", "rating": 4.5, "num_ratings": 1200, "num_episodes": 30, "description": "Three times a week, Richard Syrett delivers in-depth conversations with independent researchers and alternative media investigators, whistleblowers, eyewitnesses, former intelligence and military personnel. After twenty years covering conspiracies and the unexplained on a major-market radio station, plus time spent in the air-chair on Coast to Coast AM, the most-listened-late night radio program in the world, Richard has earned the trust, respect and admiration of the very best people in their respective fields. Get your consciousness updated three times a week and prepare to have your mind blown while you drive, exercise, cook, or walk the dog. Conspiracy Unlimited is here because it's later than we think, and there's no time to waste!", "link": "https://podcasts.apple.com/us/podcast/conspiracy-unlimited-following-truth-wherever-it-leads/id1320704694"}, {"title": "Daily Pop", "producer": "E! News", "genre": "News", "rating": 4.2, "num_ratings": 284, "num_episodes": 389, "description": "E!'s Justin Sylvester and Morgan Stewart deliver fun, insightful and relatable conversations on the biggest, most fascinating pop culture stories of the day. \"Daily Pop\" is the destination for daytime entertainment fun.", "link": "https://podcasts.apple.com/us/podcast/daily-pop/id1484422226"}, {"title": "What Next | Daily News and Analysis", "producer": "Slate Magazine", "genre": "News", "rating": 4.4, "num_ratings": 1900, "num_episodes": 656, "description": "The problem with the news right now? It’s everywhere. And each day, it can feel like we’re all just mindlessly scrolling. It’s why we created What Next. This short daily show is here to help you make sense of things. When the news feels overwhelming, we’re here to help you answer: What next? Look for new episodes every weekday morning.", "link": "https://podcasts.apple.com/us/podcast/what-next-daily-news-and-analysis/id1438906889"}, {"title": "#SistersInLaw", "producer": "Politicon LLC", "genre": "News", "rating": 4.9, "num_ratings": 3300, "num_episodes": 23, "description": "Politicon brings the brilliant team of political and legal masterminds together for Politicon's #SistersInLaw.Joyce Vance, Jill Wine-Banks, Barb McQuade, and Kimberly Atkins will pull back the curtain on how our government actually works, take on the corrupt, share their wisdom and give us their rulings on the latest in politics, law, and culture.", "link": "https://podcasts.apple.com/us/podcast/sistersinlaw/id1551206847"}, {"title": "No Agenda", "producer": "Adam Curry & John C. Dvorak", "genre": "News", "rating": 4.6, "num_ratings": 4100, "num_episodes": 15, "description": "A show about politics with No Agenda, by Adam Curry and John C. Dvorak", "link": "https://podcasts.apple.com/us/podcast/no-agenda/id269169796"}, {"title": "Politics War Room with James Carville & Al Hunt", "producer": "Politicon LLC", "genre": "News", "rating": 4.8, "num_ratings": 2200, "num_episodes": 93, "description": "Master political strategist James Carville and revered journalist Al Hunt convenes a war room each week to discuss the battle for the soul of the nation!  Join them as they gather the sharpest minds from across the country to see who has the most compelling case for the American people on the issues that matter most.", "link": "https://podcasts.apple.com/us/podcast/politics-war-room-with-james-carville-al-hunt/id1484862164"}, {"title": "CBS Sunday Morning with Jane Pauley", "producer": "Radio.com", "genre": "News", "rating": 4.3, "num_ratings": 637, "num_episodes": 290, "description": "CBS SUNDAY MORNING is the top-rated Sunday morning news program in all the key demos, and features stories on the arts, music, nature, entertainment, sports, history, science, Americana and highlights unique human accomplishments and achievements", "link": "https://podcasts.apple.com/us/podcast/cbs-sunday-morning-with-jane-pauley/id1010738108"}, {"title": "Tim Pool Daily Show", "producer": "Tim Pool", "genre": "News", "rating": 4.7, "num_ratings": 4800, "num_episodes": 1057, "description": "The Tim Pool Daily Show brings you breaking news from around the world and commentary on top news topics in The Culture War, Politics, And Global Conflict", "link": "https://podcasts.apple.com/us/podcast/tim-pool-daily-show/id1362265400"}, {"title": "Morning Announcements", "producer": "Betches Media", "genre": "News", "rating": 4.8, "num_ratings": 876, "num_episodes": 128, "description": "Morning Announcements is a daily show brought to you by the Betches Sup, here to help you make sense of the world in the wake of 2020’s chaos. Every morning, Betches co-founder and host Sami Sage gives you quick daily updates with the most important info you need to know about politics and current events.", "link": "https://podcasts.apple.com/us/podcast/morning-announcements/id1546267644"}, {"title": "Advisory Opinions", "producer": "The Dispatch", "genre": "News", "rating": 4.8, "num_ratings": 1600, "num_episodes": 147, "description": "Advisory Opinions is a new podcast from The Dispatch. Hosts David French and Sarah Isgur have a weekly conversation about the law, culture, and why it matters.", "link": "https://podcasts.apple.com/us/podcast/advisory-opinions/id1490993194"}, {"title": "That Trippi Show", "producer": "Joe Trippi", "genre": "News", "rating": 4.9, "num_ratings": 433, "num_episodes": 53, "description": "If you're looking for someone who actually knows how presidential and national politics works to explain what's going on in 30 minutes or less, this is the show for you. Joe Trippi is a longtime Democratic campaign manager who ran the progressive Howard Dean presidential campaign in 2004 and the historic Doug Jones Senate campaign to defeat Roy Moore in 2017. He's seen it all and isn't bogged down by the viral tweets or hot takes du jour. He's looking past the headlines to answer the questions that matter: How do Democrats win key races moving forward? How do we convince voters to make Republicans pay for January 6th and its aftermath? What's happening with the campaigns for '22 and (gulp) '24? Don't just listen to the talking heads. Learn from an expert. subscribe now to That Trippi Show. New episodes every Friday (at least!).", "link": "https://podcasts.apple.com/us/podcast/that-trippi-show/id1523896927"}, {"title": "TODAY", "producer": "TODAY", "genre": "News", "rating": 5.0, "num_ratings": 19, "num_episodes": 7, "description": "NBC’s TODAY is the news program that informs, entertains, inspires and sets the agenda each morning for Americans. The daily live broadcast provides current news headlines, weather reports, interviews with newsmakers from the worlds of politics, business, media, entertainment and sports, and stories that help viewers with their finances, health and wellbeing.", "link": "https://podcasts.apple.com/us/podcast/today/id1573272310"}, {"title": "Fever Dreams", "producer": "The Daily Beast", "genre": "News", "rating": 4.2, "num_ratings": 384, "num_episodes": 16, "description": "Inside the right’s push to retake power, from the conspiracy-slingers to the MAGA acolytes to the straight-up grifters. Thought the Trump era was crazy? Wait ’til you hear what they have planned next. Hosted by Asawin Suebsaeng and Will Sommer. New episodes every Wednesday. Subscribe on your favorite podcast app today.", "link": "https://podcasts.apple.com/us/podcast/fever-dreams/id1558716930"}, {"title": "The Al Franken Podcast", "producer": "District Productive", "genre": "News", "rating": 4.7, "num_ratings": 5700, "num_episodes": 123, "description": "A five-time Emmy winning SNL comedy writer/producer, joins a four-time #1 NYT bestselling author, a three-time highest-rated national progressive radio host, a two-time Grammy winning artist, and a former US Senator. So, it gets a little crowded in the booth when Al talks public policy and sometimes political comedy with notable guests. Think “The Daily” without the resources of the NYTimes.", "link": "https://podcasts.apple.com/us/podcast/the-al-franken-podcast/id1462195742"}, {"title": "The Realignment", "producer": "The Realignment", "genre": "News", "rating": 4.9, "num_ratings": 2000, "num_episodes": 141, "description": "The United States is in the midst of a dramatic political realignment with shifting views on national security, economics, technology, and the role of government in our lives. Saagar Enjeti and Marshall Kosloff explore this with thinkers, policymakers, and more.", "link": "https://podcasts.apple.com/us/podcast/the-realignment/id1474687988"}, {"title": "No Lie with Brian Tyler Cohen", "producer": "Brian Tyler Cohen", "genre": "News", "rating": 4.9, "num_ratings": 4300, "num_episodes": 60, "description": "No Lie covers the most important and breaking political stories of the week, hosted by progressive commentator Brian Tyler Cohen. He sits down with major players in the world of politics, bringing you right into the heart of the action. No bad faith talking points, no disinformation, and no lies.", "link": "https://podcasts.apple.com/us/podcast/no-lie-with-brian-tyler-cohen/id1515399733"}, {"title": "The Argument", "producer": "The New York Times", "genre": "News", "rating": 4.1, "num_ratings": 5500, "num_episodes": 138, "description": "Strongly-held opinions. Open-minded debates. A weekly ideas show, hosted by Jane Coaston.", "link": "https://podcasts.apple.com/us/podcast/the-argument/id1438024613"}, {"title": "Debunked", "producer": "The Daily Wire", "genre": "News", "rating": 4.8, "num_ratings": 403, "num_episodes": 8, "description": "You know and love him as host of the most savagely irreverent conservative podcast on the web. Watch Ben Shapiro expose leftist fallacies every Friday in 15 minutes or less.", "link": "https://podcasts.apple.com/us/podcast/debunked/id1558940738"}, {"title": "Economist Radio", "producer": "The Economist", "genre": "News", "rating": 4.4, "num_ratings": 2800, "num_episodes": 2154, "description": "The Economist was founded in 1843 \"to throw white light on the subjects within its range\". For more from The Economist visit http://shop.economist.com/collections/audio", "link": "https://podcasts.apple.com/us/podcast/economist-radio/id151230264"}, {"title": "Today in Focus", "producer": "The Guardian", "genre": "News", "rating": 4.8, "num_ratings": 451, "num_episodes": 624, "description": "Hosted by Anushka Asthana and Rachel Humphreys, Today in Focus brings you closer to Guardian journalism. Combining personal storytelling with insightful analysis, this podcast takes you behind the headlines for a deeper understanding of the news, every weekday", "link": "https://podcasts.apple.com/us/podcast/today-in-focus/id1440133626"}, {"title": "Global News Podcast", "producer": "BBC", "genre": "News", "rating": 4.4, "num_ratings": 5400, "num_episodes": 53, "description": "The day’s top stories from BBC News. Delivered twice a day on weekdays, daily at weekends", "link": "https://podcasts.apple.com/us/podcast/global-news-podcast/id135067274"}, {"title": "Holding Court with Eboni K. Williams", "producer": "iHeartRadio", "genre": "News", "rating": 4.9, "num_ratings": 711, "num_episodes": 41, "description": "When law & order is the headline, what does it mean for us? Holding Court with Eboni K. Williams cross-examines news-making cases and famous faces to peer into the court of law. Each week attorney Eboni K. Williams and cultural observer Dustin Ross break down what’s on the docket in American justice and what’s not, with savvy legal analysis and commonsense commentary to provide teachable moments for us all to navigate a rigged system.Discussions in this podcast are for general information and entertainment purposes only and should not be considered legal advice. Always consult a lawyer for your individual circumstances.", "link": "https://podcasts.apple.com/us/podcast/holding-court-with-eboni-k-williams/id1534027647"}, {"title": "CNN 5 Things", "producer": "CNN", "genre": "News", "rating": 3.5, "num_ratings": 477, "num_episodes": 20, "description": "We bring you 5 stories that will get you up to speed and on with your day. Mornings and evenings, every weekday.", "link": "https://podcasts.apple.com/us/podcast/cnn-5-things/id1436719991"}, {"title": "Hacks On Tap", "producer": "Hacks On Tap", "genre": "News", "rating": 4.8, "num_ratings": 6500, "num_episodes": 127, "description": "When David Axelrod, Mike Murphy and Robert Gibbs get together to talk politics, it’s not academic. They speak from the perspective gained through hundreds of campaigns for offices from City Hall to the White House. So if you want to know what’s really going on behind the scenes, where strategic decisions are being made, pull up a stool for Hacks on Tap. Incisive, sometimes uproarious and always entertaining, these political warhorses and their guests will give you insights you’ll only get from folks who have spent a lifetime in the political trenches of both parties.", "link": "https://podcasts.apple.com/us/podcast/hacks-on-tap/id1467297559"}, {"title": "Worldly", "producer": "Vox", "genre": "News", "rating": 4.3, "num_ratings": 1700, "num_episodes": 210, "description": "We live in a confusing time, bombarded every day with news from around the world that can be hard to follow, or fully understand. Let Worldly be your guide. Every Thursday, senior writer Zack Beauchamp, senior foreign editor Jennifer Williams, and staff defense writer Alex Ward give you the history and context you need to make sense of the moment and navigate the world around you. Produced by Vox and the Vox Media Podcast Network.", "link": "https://podcasts.apple.com/us/podcast/worldly/id1248862589"}, {"title": "Why Is This Happening? with Chris Hayes", "producer": "NBC News", "genre": "News", "rating": 4.6, "num_ratings": 7500, "num_episodes": 175, "description": "Every week Chris Hayes asks the big questions that keep him up at night. How do we make sense of this unprecedented moment in world history? Why is this (all) happening?This podcast starts to answer these questions. Writers, experts, and thinkers who are also trying to get to the bottom of them join Chris to break it all down and help him get a better night’s rest. “Why is this Happening?” is presented by MSNBC and NBCNews Think.", "link": "https://podcasts.apple.com/us/podcast/why-is-this-happening-with-chris-hayes/id1382983397"}, {"title": "Fox News Sunday Audio Podcast", "producer": "FOX News Channel", "genre": "News", "rating": 3.2, "num_ratings": 1400, "num_episodes": 194, "description": "From the policy debates to the political fights, today's top newsmakers make sure they sit down with Chris Wallace on Fox News Sunday, which airs weekly on Fox News Channel.", "link": "https://podcasts.apple.com/us/podcast/fox-news-sunday-audio-podcast/id418152882"}, {"title": "Quillette Podcast", "producer": "Quillette", "genre": "News", "rating": 4.6, "num_ratings": 516, "num_episodes": 157, "description": "Quillette is an online magazine founded by Australian writer Claire Lehmann. The publication has a primary focus on science, technology, news, culture, and politics.", "link": "https://podcasts.apple.com/us/podcast/quillette-podcast/id1441708286"}, {"title": "Louder with Crowder", "producer": "Blaze Podcast Network", "genre": "News", "rating": 4.7, "num_ratings": 29000, "num_episodes": 330, "description": "Steven Crowder brings you news, entertainment and politics with the most politically incorrect show on the web. Guests, rants, sketches, your calls ... it's whatever.", "link": "https://podcasts.apple.com/us/podcast/louder-with-crowder/id929121341"}, {"title": "Axios Today", "producer": "Axios", "genre": "News", "rating": 4.4, "num_ratings": 1300, "num_episodes": 280, "description": "Start your morning with news that matters in just 10 minutes. Our host Niala Boodhoo and a team of award-winning journalists will bring you the latest scoops from the White House and Congress, analysis on the economy and insight into the trends shaping your world -- from China to AI, and all the forces shaping the next five years. And it’s all delivered in Smart Brevity® - a clinical, concise coverage style that respects your time. About Axios: Axios is a digital media company launched in 2017. Axios - which means “worthy” in Greek - helps you become smarter, faster with news and information across politics, tech, business, media, science and the world. Subscribe to our newsletters at axios.com/newsletters and download our mobile app at axios.com/app. About Pushkin Industries: Pushkin Industries is the audio production company co-founded by Malcolm Gladwell and Jacob Weisberg and is home to hit shows such as Against the Rules with Michael Lewis, Cautionary Tales, The Happiness Lab, The Last Archive, and Gladwell's own Revisionist History. Visit pushkin.fm for a full lineup of shows. About Niala Boodhoo: Niala Boodhoo is the host of Axios Today. She was the host and executive producer of the award-winning news program The 21st, a Knight-Wallace fellow and a board member for the AAJA.", "link": "https://podcasts.apple.com/us/podcast/axios-today/id1514235382"}, {"title": "Brian Kilmeade Show", "producer": "FOX News Channel", "genre": "News", "rating": 4.2, "num_ratings": 1300, "num_episodes": 1005, "description": "Brian Kilmeade from FOX & Friends and his guests team up for lively debate and discussion of the news and issues that all Americans are talking about. For a fresh and unique morning wake-up call, join Brian Kilmeade weekdays 9am Eastern on FoxNewsTalk.com.", "link": "https://podcasts.apple.com/us/podcast/brian-kilmeade-show/id219258773"}, {"title": "No Compromise", "producer": "NPR", "genre": "News", "rating": 4.3, "num_ratings": 1500, "num_episodes": 8, "description": "Winner of the 2021 Pulitzer Prize for Audio Reporting. Discover a social media empire with an unapologetic vision of gun rights—generating millions of likes, follows, and dollars. From WAMU's Guns & America, reporters Lisa Hagen of WABE and Chris Haxel of KCUR expose how three brothers from the most uncompromising corner of the gun debate are turning hot-button issues into donations and controversy.", "link": "https://podcasts.apple.com/us/podcast/no-compromise/id1529632122"}, {"title": "State of the Union", "producer": "CNN", "genre": "News", "rating": 3.6, "num_ratings": 948, "num_episodes": 151, "description": "Hosted by CNN's Jake Tapper and Dana Bash, State of the Union features interviews with top newsmakers on politics and policy—covering Washington, the country, and the world.", "link": "https://podcasts.apple.com/us/podcast/state-of-the-union/id309575412"}, {"title": "The Rachel Maddow Show", "producer": "NBC News", "genre": "News", "rating": 4.4, "num_ratings": 28500, "num_episodes": 13, "description": "Rachel Maddow works with unmatched rigor and resolve to explain our complex world and deliver news in a way that's illuminating and dynamic, connecting the dots to make sense of complex issues. Join her every weeknight as she provides in-depth reporting to illuminate the current state of political affairs and reveals the importance of transparency and accountability from our leaders.", "link": "https://podcasts.apple.com/us/podcast/the-rachel-maddow-show/id294055449"}, {"title": "The Bulwark Podcast", "producer": "The Bulwark", "genre": "News", "rating": 4.6, "num_ratings": 3500, "num_episodes": 634, "description": "Charlie Sykes and guests discuss the latest news from inside Washington and around the world. No shouting, grandstanding, or sloganeering. Conservative, conscientious, and civil.", "link": "https://podcasts.apple.com/us/podcast/the-bulwark-podcast/id1447684472"}, {"title": "Hold These Truths with Dan Crenshaw", "producer": "Dan Crenshaw", "genre": "News", "rating": 4.8, "num_ratings": 13000, "num_episodes": 157, "description": "Congressman Dan Crenshaw joins the world's leading experts for deep and insightful conversations about the most important issues facing us today.", "link": "https://podcasts.apple.com/us/podcast/hold-these-truths-with-dan-crenshaw/id1498149200"}, {"title": "Sara Carter Show", "producer": "Radio America", "genre": "News", "rating": 4.8, "num_ratings": 2800, "num_episodes": 179, "description": "Sara A. Carter is an award-winning investigative reporter who is taking back the story. Each week, Carter shares her unique perspective as a mom, a wife to a wounded war hero, and a reporter who’s told stories from the darkest corners of the world. Join her as she takes you on a journey taking listeners inside exclusive stories and interviews you won’t hear anywhere else.This is where the story begins.", "link": "https://podcasts.apple.com/us/podcast/sara-carter-show/id1468559046"}, {"title": "The World and Everything In It", "producer": "WORLD Radio", "genre": "News", "rating": 4.8, "num_ratings": 4100, "num_episodes": 50, "description": "The World and Everything in It is an Apple Podcasts top 100 News program delivering essential headlines, field reporting, interviews, and expert analysis. Find original coverage you can't get elsewhere, such as a weekly overview of every Supreme Court case, biblical cultural analysis, and key international stories. This podcast is a product of listener-supported WORLD Radio, which provides sound journalism grounded in God's Word.", "link": "https://podcasts.apple.com/us/podcast/the-world-and-everything-in-it/id454755642"}, {"title": "The Highwire with Del Bigtree", "producer": "The Highwire with Del Bigtree", "genre": "News", "rating": 4.9, "num_ratings": 1700, "num_episodes": 465, "description": "High above the circus of mainstream media spin, death-defying talk without the safety net of corporate influence… this is HIGH WIRE.", "link": "https://podcasts.apple.com/us/podcast/the-highwire-with-del-bigtree/id1227863378"}, {"title": "Software Engineering Daily", "producer": "Software Engineering Daily", "genre": "News", "rating": 4.7, "num_ratings": 514, "num_episodes": 100, "description": "Technical interviews about software topics.", "link": "https://podcasts.apple.com/us/podcast/software-engineering-daily/id1019576853"}, {"title": "Confessions Of A Crappy Christian Podcast", "producer": "the Girl Named Blake", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 1400, "num_episodes": 135, "description": "The Crappy Christian Podcast strives to shed a light on the topics the church often forgets. In this space, you'll find conversations with people who have gone through the fire and come back with buckets of water for the people still in it. Hosted by @thegirlnamedblake, this podcast packs a punch (the good kind) and touches on everything from mental health to sex to divorce to the everyday life of a Christian, & the good news that God in the midst of it all.", "link": "https://podcasts.apple.com/us/podcast/confessions-of-a-crappy-christian-podcast/id1440149171"}, {"title": "Bethel Church Sermon of the Week", "producer": "Bethel Church", "genre": "Religion & Spirituality", "rating": 4.7, "num_ratings": 3600, "num_episodes": 20, "description": "Bethel Church is a community of believers led by pastor Bill Johnson in Redding, California. We are passionate about God and people.", "link": "https://podcasts.apple.com/us/podcast/bethel-church-sermon-of-the-week/id76583739"}, {"title": "We're Going There with Bianca Juarez Olthoff", "producer": "That Sounds Fun Network", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 511, "num_episodes": 40, "description": "Author, speaker, and Christian leader, Bianca Juarez Olthoff invites guests to discuss relevant topics affecting all aspects of our lives. From relationships to race relations, faith to fashion, the conversations will leave you with practical tips, fun ways to talk about tough topics, and stories with amazing people to impact your life. No topic is off the table and faith will always be at the forefront of the conversation. So... WE'RE GOING THERE! For more on Bianca like her books Play With Fire and How To Have Your Life Not Suck, visit BiancaOlthoff.com", "link": "https://podcasts.apple.com/us/podcast/were-going-there-with-bianca-juarez-olthoff/id1529509063"}, {"title": "Sarah Jakes Roberts Sermons", "producer": "Sarah Jakes Roberts Sermons", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 42, "num_episodes": 22, "description": "Sermons by Sarah Jakes Roberts who is a bestselling author, businesswoman, and media personality who balances career, ministry, and family.", "link": "https://podcasts.apple.com/us/podcast/sarah-jakes-roberts-sermons/id1562863134"}, {"title": "Leading Saints Podcast", "producer": "Leading Saints", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 712, "num_episodes": 300, "description": "Leading Saints is a nonprofit organization with a mission to help Latter-day Saints (LDS, Mormon) be better prepared to lead.Here are 4 ways Leading Saints accomplishes the above mission statement:1. Connect Latter-day Saint Leaders2. Enhance Leadership Ability3. Present Leadership Scholarship & Research4. Celebrate Divine GuidancePodcast Host:Kurt Francom is the founder and executive director of Leading Saints, a nonprofit organization helping Latter-day Saints be better prepared to lead. He manages the day-to-day efforts of Leading Saints and is the host of the podcast by the same name. Leading Saints has reached individuals internationally and has received over 2 million downloads. Kurt currently lives in Utah with his lovely wife Alanna. They are blessed to have three children. He enjoys drawing caricatures, playing basketball, reading, and watching college football. Kurt has served as a full-time missionary (California Sacramento), as a bishop, 1st counselor in a stake presidency, and elders quorum president.", "link": "https://podcasts.apple.com/us/podcast/leading-saints-podcast/id869421445"}, {"title": "Love & Light Live Crystal Healing Podcast", "producer": "Ashley Leavy", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 368, "num_episodes": 137, "description": "Learn all about the energy of healing crystals (and how to work with them in your day to day life) with this weekly podcast hosted by Ashley Leavy of the Love & Light School of Crystal Therapy.", "link": "https://podcasts.apple.com/us/podcast/love-light-live-crystal-healing-podcast/id1236360826"}, {"title": "Daily Grace", "producer": "The Daily Grace Co.", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 1700, "num_episodes": 135, "description": "Daily Grace exists to encourage and equip women to seek God in His Word. Our goal is for women to know that deep Bible study, sound doctrine, and rich theology are not just for the seminary student or pastor, but are accessible and transformational for all believers. We want to invite women to join us in our conversation about our great God, and be encouraged to seek a deeper knowledge of God that leads them to live their lives for God glory as they grow in love and awe in response to who He is.Daily Grace is a weekly podcast brought to you by The Daily Grace Co. and hosted by Joanna Kimbrel and Stefanie Boyles.", "link": "https://podcasts.apple.com/us/podcast/daily-grace/id1450011728"}, {"title": "You Can Heal Your Life‪®‬", "producer": "Hay House", "genre": "Religion & Spirituality", "rating": 4.6, "num_ratings": 740, "num_episodes": 101, "description": "You Can Heal Your Life is your connection to today’s most influential thought-leaders. Elevate your morning coffee, afternoon walk, or evening commute into an inspirational, motivational, and transformational personal growth experience.We invite you to take a step back from life’s stress and anxieties and replace any negativity with life-changing insights and real-world solutions. Learn from some of the world’s greatest teachers in spirituality, health and wellness, and more—like Louise Hay, Dr. Wayne W. Dyer, Gabrielle Bernstein, Marianne Williamson, Dr. Joe Dispenza, Anthony William, Radleigh Valentine, Pam Grout, and more.From careers to crystals, happiness to health, money to manifesting—Hay House’s inspiring authors join the podcast twice a week (or more!) to teach new skills, share powerful stories, and encourage you to take the next step towards living your best life. After all, as Louise Hay always reminded us: You Can Heal Your Life", "link": "https://podcasts.apple.com/us/podcast/you-can-heal-your-life/id1490922665"}, {"title": "The Poco a Poco Podcast with the Franciscan Friars of the Renewal", "producer": "Franciscan Friars of the Renewal", "genre": "Religion & Spirituality", "rating": 5.0, "num_ratings": 2300, "num_episodes": 62, "description": "Join Fr. Innocent, Fr. Angelus, Fr. Pierre Toussaint, and Fr. Mark-Mary, priests of the Franciscan Friars of the Renewal, each week to discuss authentic faith in today's world as they share stories and wisdom from years of prayer, community life, and work with the poor.It all comes back to this: finding deep friendship with Jesus. Seeing him work in our lives everyday. Through topics as varied as mental health, the confessional, and NYC neighbors, the Poco A Poco Podcast is here to accompany all pilgrims as they walk step by step, little by little, poco a poco on their pilgrimage to the Father's house.The Franciscan Friars of the Renewal are a Catholic religious order founded in the South Bronx, NY.  Learn more or subscribe to their updates at www.franciscanfriars.com", "link": "https://podcasts.apple.com/us/podcast/poco-poco-podcast-franciscan-friars-renewal/id1508820894"}, {"title": "Mama Bear Apologetics", "producer": "Hillary Morgan Ferrer & Amy Davison", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 462, "num_episodes": 62, "description": "Mama Bear Apologetics is a podcast for mothers of biological, adopted, or spiritual children who want to learn about how to defend the Christian faith, help give their children reasons for faith, and understand the worldviews that challenge Christian faith in the first place.", "link": "https://podcasts.apple.com/us/podcast/mama-bear-apologetics/id1178373026"}, {"title": "Passion City Church Podcast", "producer": "Passion City Church", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 1800, "num_episodes": 511, "description": "Messages from Passion City Church, visit us at passioncitychurch.com", "link": "https://podcasts.apple.com/us/podcast/passion-city-church-podcast/id400379025"}, {"title": "This Cultural Moment", "producer": "Bridgetown Church & Red Church", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 2500, "num_episodes": 28, "description": "A podcast about following Jesus in the post-christian world. This Cultural Moment is a collaboration of Bridgetown Church in Portland, USA and Red Church in Melbourne, Australia.", "link": "https://podcasts.apple.com/us/podcast/this-cultural-moment/id1342868490"}, {"title": "Quick to Listen", "producer": "Christianity Today", "genre": "Religion & Spirituality", "rating": 4.5, "num_ratings": 488, "num_episodes": 284, "description": "Each week the editors of Christianity Today go beyond hashtags and hot-takes and set aside time to explore the reality behind a major cultural event.", "link": "https://podcasts.apple.com/us/podcast/quick-to-listen/id1094878688"}, {"title": "Ask NT Wright Anything", "producer": "Premier", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 1200, "num_episodes": 72, "description": "The fortnightly podcast that connects you to NT (Tom) Wright’s thought and theology by allowing you to ask the questions. Presented by Premier in partnership with SPCK and NTWrightOnline. Hosted by Justin Brierley.", "link": "https://podcasts.apple.com/us/podcast/ask-nt-wright-anything/id1441656192"}, {"title": "The Next Right Thing with Emily P. Freeman", "producer": "That Sounds Fun Network", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 4400, "num_episodes": 194, "description": "For the second-guessers, the chronically hesitant, or anyone who suffers from decision fatigue, best-selling author and host Emily P. Freeman helps create a little space for your soul to breathe so you can discern your next right thing in love. Because out of the thousands of decisions you make everyday, chances are a few of them threaten to keep you up at night. If you're in a season of transition, waiting, general fogginess or if you've ever searched \"how to make a decision\" on the internet, listen in.", "link": "https://podcasts.apple.com/us/podcast/the-next-right-thing-with-emily-p-freeman/id1268826768"}, {"title": "Your Enneagram Coach, the Podcast", "producer": "Beth and Jeff McCord", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 476, "num_episodes": 88, "description": "So, you know your Enneagram Type, now what? Hosts Beth and Jeff McCord help you answer that question by sharing the heartfelt and amusing stories of their journey and their guests. Dive deep into the Enneagram from a Biblical perspective and experience the freedom that comes from understanding yourself and others, with clarity and compassion.", "link": "https://podcasts.apple.com/us/podcast/your-enneagram-coach-the-podcast/id1504530276"}, {"title": "VOMRadio", "producer": "The Voice of the Martyrs", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 796, "num_episodes": 345, "description": "Welcome to The Voice of the Martyrs Radio Network! Join host Todd Nettleton each week as we share testimonies of brothers and sisters suffering for their faith in Christ. The Voice of the Martyrs (VOM) is a nonprofit, interdenominational missions organization that offers practical and spiritual help to persecuted Christians around the world.", "link": "https://podcasts.apple.com/us/podcast/vomradio/id920807796"}, {"title": "Sermons – Voddie Baucham Ministries", "producer": "Voddie Baucham", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 125, "num_episodes": 10, "description": "Biblical Teaching and Resources for the Church", "link": "https://podcasts.apple.com/us/podcast/sermons-voddie-baucham-ministries/id1494689323"}, {"title": "Friendly Atheist Podcast", "producer": "Friendly Atheist Podcast", "genre": "Religion & Spirituality", "rating": 4.6, "num_ratings": 992, "num_episodes": 399, "description": "This is the podcast for http://FriendlyAtheist.com", "link": "https://podcasts.apple.com/us/podcast/friendly-atheist-podcast/id888637335"}, {"title": "The Bible Binge", "producer": "The Popcast Media Group LLC", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 4300, "num_episodes": 105, "description": "Talking about Bible stories is often fraught with scholarly nerd alerts about ancient linguistics and inaccessible theological discussions centered around hermeneutics. But what if there was a way to use your pop culture literacy to enhance your biblical literacy. What if you could recap the Bible like you recapped your favorite TV show? Welcome to the Bible Binge hosted by Knox McCoy and Jamie Golden of The Popcast.", "link": "https://podcasts.apple.com/us/podcast/the-bible-binge/id1347735219"}, {"title": "The Atheist Experience", "producer": "Atheist Community of Austin", "genre": "Religion & Spirituality", "rating": 4.7, "num_ratings": 2100, "num_episodes": 436, "description": "The Atheist Experience is a weekly show in Austin, Texas geared at a non-atheist  and atheist audience. The Atheist Experience is produced by the Atheist Community of Austin.The Atheist Community of Austin is organized as a nonprofit educational corporation to develop and support the atheist community, to provide opportunities for socializing and friendship, to promote secular viewpoints, to encourage positive atheist culture, to defend the first amendment principle of state-church separation, to oppose discrimination against atheists and to work with other organizations in pursuit of common goals.We define atheism as the lack of belief in gods. This definition also encompasses what most people call agnosticism.", "link": "https://podcasts.apple.com/us/podcast/the-atheist-experience/id118720919"}, {"title": "The Bible in a Year (with Fr. Mike Schmitz‪)‬", "producer": "Ascension - The Leader in Catholic Faith Formation", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 30800, "num_episodes": 192, "description": "In The Bible in a Year podcast, Fr. Mike Schmitz walks you through the entire Bible in 365 episodes, providing commentary, reflection, and prayer along the way.Unlike any other Bible podcast, Ascension’s Bible in a Year podcast follows a reading plan inspired by The Great Adventure Bible Timeline, a ground-breaking approach to understanding salvation history developed by renowned Catholic Bible scholar Jeff Cavins. For each period in the timeline, Jeff will join Fr. Mike for a special episode that will help you understand the context of each reading.With this podcast, you won’t just read the Bible in a year … you’ll finally understand how all the pieces of the Bible fit together to tell an amazing story that continues in your life today!Listen and…Read the ENTIRE BibleFeel more confident about your understanding of ScriptureExperience the transformative power of God’s Word in your daily lifeStart seeing the world through the lens of ScriptureEach 20-25 minute episode includes:Two to three scripture readingsA reflection from Fr. Mike SchmitzA guided prayer to help you hear God’s voice in his WordThe Bible contains adult themes that may not be suitable for children - parental discretion is advised.", "link": "https://podcasts.apple.com/us/podcast/the-bible-in-a-year-with-fr-mike-schmitz/id1539568321"}, {"title": "Help Me Teach The Bible", "producer": "The Gospel Coalition, Nancy Guthrie", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 535, "num_episodes": 266, "description": "Help Me Teach the Bible is a podcast hosted by Nancy Guthrie. In each episode, she talks to the best Bible teachers and preachers of our day to find out how they teach through specific books of the Bible.", "link": "https://podcasts.apple.com/us/podcast/help-me-teach-the-bible/id1032089864"}, {"title": "The Messy Masterpiece with Tori & Chad", "producer": "Tori & Chad", "genre": "Religion & Spirituality", "rating": 5.0, "num_ratings": 472, "num_episodes": 182, "description": "In the same way we need food, water and sleep on a daily basis to function properly we also need encouragement. Tune in daily for devotionals that Tori and I will be sharing! Our Patreon: https://www.patreon.com/themastersfamOur Instagrams: Tori's- https://www.instagram.com/torimasters/Chad's- https://www.instagram.com/chadmasters/Podcast- https://www.instagram.com/themessymasterpiecepodcast/", "link": "https://podcasts.apple.com/us/podcast/the-messy-masterpiece-with-tori-chad/id1545841764"}, {"title": "Truth Seekers: Bible Stories for Kids", "producer": "Sherilyn R. Grant", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 612, "num_episodes": 136, "description": "Truth Seekers: Bible Stories for Kids is a podcast for children (and adults) of all ages that journeys through the stories of the Bible. My name is Sherilyn Grant, and I am the host of the podcast. We start our way at the very beginning and walk our way through the Old and New Testament. The mission of the podcast is to help children see the individual stories of the Bible as part of one large story that reveals God's redemptive plan to rescue and restore us back to Himself. I pray that through the telling and reading of God's Word, you and your family will understand more clearly God's plan for salvation, His deep love for us, and how we can apply His truth to our lives. You can follow Truth Seekers on Facebook and Instagram at @truth.seekers.podcast.for.kids", "link": "https://podcasts.apple.com/us/podcast/truth-seekers-bible-stories-for-kids/id1347649088"}, {"title": "Risen Motherhood", "producer": "Emily Jensen & Laura Wifler", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 5600, "num_episodes": 194, "description": "A weekly podcast for moms.  A space to remember we are not alone in our experiences, be challenged to have joy among the chaos, remember grace covers guilt, and seek the truth of the gospel above all else. This is a podcast for the imperfect mother, still learning, still growing and still fully recognizing she doesn’t have it all together - but comes everyday, to the base of the cross, to seek the one who does.", "link": "https://podcasts.apple.com/us/podcast/risen-motherhood/id1072833310"}, {"title": "T.D. Jakes Sermons", "producer": "T.D. Jakes Sermons", "genre": "Religion & Spirituality", "rating": 4.7, "num_ratings": 55, "num_episodes": 20, "description": "Sermons by T.D. Jakes who is the bishop of The Potter's House, an author, and filmmaker.", "link": "https://podcasts.apple.com/us/podcast/t-d-jakes-sermons/id1562606296"}, {"title": "Unbelievable‪?‬", "producer": "Premier", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 1500, "num_episodes": 770, "description": "Unbelievable?' engages in fundamental questions on Christianity with the intention to openly discuss different opinions between Christians and non-believers.", "link": "https://podcasts.apple.com/us/podcast/unbelievable/id267142101"}, {"title": "The Bible For Normal People", "producer": "Peter Enns and Jared Byas", "genre": "Religion & Spirituality", "rating": 4.7, "num_ratings": 2300, "num_episodes": 177, "description": "A weekly podcast talk show having serious talks about the sacred book. Hosted by Peter Enns and Jared Byas.", "link": "https://podcasts.apple.com/us/podcast/the-bible-for-normal-people/id1215420422"}, {"title": "Joyce Meyer's Talk It Out Podcast", "producer": "Joyce Meyer", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 1100, "num_episodes": 63, "description": "Joyce’s Talk It Out podcast is a fun weekly Bible study with three friends in different stages of life who take Joyce’s teaching and talk out real life application. It’s fun, heartfelt, and so applicable. So, consider yourself one of the girls and let’s talk it out together.", "link": "https://podcasts.apple.com/us/podcast/joyce-meyers-talk-it-out-podcast/id1470422004"}, {"title": "The Jeff Cavins Show (Your Catholic Bible Study Podcast‪)‬", "producer": "Ascension - The Leader in Catholic Faith Formation", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 1200, "num_episodes": 224, "description": "In his weekly Catholic Bible study podcast, Jeff shares faith tips and scripture truths to help you live as a modern-day disciple of Jesus Christ.", "link": "https://podcasts.apple.com/us/podcast/the-jeff-cavins-show-your-catholic-bible-study-podcast/id1201282412"}, {"title": "Sermon of the Day", "producer": "Desiring God", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 742, "num_episodes": 50, "description": "One classic John Piper sermon or conference message for each day of the year, based on listeners’ recommendations and feedback. Piper is founder and teacher of desiringGod.org and is author of more than 50 books. His sermons, books, articles, and more are available free of charge at desiringGod.org.", "link": "https://podcasts.apple.com/us/podcast/sermon-of-the-day/id955100693"}, {"title": "Fresh Life Church", "producer": "Pastor Levi Lusko", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 1200, "num_episodes": 408, "description": "Welcome to the Fresh Life Church podcast! We are a church led by Pastor Levi and Jennie Lusko and exist to see those stranded in sin find life and liberty in Christ. For more information visit freshlife.church or download our app.", "link": "https://podcasts.apple.com/us/podcast/fresh-life-church/id214017745"}, {"title": "Omar Suleiman", "producer": "Muslim Central", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 685, "num_episodes": 896, "description": "Omar Suleiman, FREE Audio Podcast brought to you by Muslim Central. Muslim Central is a private Audio Podcast Publisher. Our Audio Library consists of Islamic Lectures, Interviews, Debates and more, with over 100 Speakers and Shows from around the World.", "link": "https://podcasts.apple.com/us/podcast/omar-suleiman/id1017074168"}, {"title": "Anaya Ivy", "producer": "Anaya", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 2100, "num_episodes": 65, "description": "Anaya Ivy podcast is about being a young millennial woman learning how to balance out her social media life and her personal/ love life in hopes to helping other woman. Anaya has a girl talk segment. Anaya shares tips, advice and more.", "link": "https://podcasts.apple.com/us/podcast/anaya-ivy/id1460830128"}, {"title": "Tara Brach", "producer": "Tara Brach", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 6800, "num_episodes": 1080, "description": "Tara Brach, Ph.D is an internationally known meditation teacher and author of bestselling Radical Acceptance and True Refuge. Tara shares a weekly guided meditation and talk that blend Western psychology and Eastern spiritual practices. The podcast addresses the value of mindfulness meditation and self-compassion in relieving emotional suffering, serving spiritual awakening and bringing healing to our world.", "link": "https://podcasts.apple.com/us/podcast/tara-brach/id265264862"}, {"title": "The Counsel of Trent", "producer": "Catholic Answers", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 1500, "num_episodes": 468, "description": "In this podcast, Trent Horn gives you an entertaining, informative, and practical explanation of the Catholic faith as well as interviews with the best writers and speakers in the Church today.", "link": "https://podcasts.apple.com/us/podcast/the-counsel-of-trent/id1354647807"}, {"title": "I just want to talk about the Bible", "producer": "Christian", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 115, "num_episodes": 19, "description": "Everything we discuss on this podcast is in some way connected to the Scriptures, and will hopefully encourage you with your walk with the Lord and also answer questions you may have.", "link": "https://podcasts.apple.com/us/podcast/i-just-want-to-talk-about-the-bible/id1521537280"}, {"title": "Thirty Minutes with The Perrys", "producer": "The Perrys", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 4300, "num_episodes": 22, "description": "30 Minutes with The Perrys is a podcast with a whole lot of truth given in a short amount of time. Preston Perry and Jackie Hill Perry will bring their humor, honesty, and insight into conversations on everything from relationships, theology, politics, race, and parenting.", "link": "https://podcasts.apple.com/us/podcast/thirty-minutes-with-the-perrys/id1458672189"}, {"title": "Turning to The Mystics with James Finley", "producer": "Center for Action and Contemplation", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 1100, "num_episodes": 55, "description": "Turning to the Mystics is a podcast for people searching for something more meaningful, intimate and richly present in the divine gift of their lives. James Finley, clinical psychologist and Living School faculty, offers a modern take on the historical contemplative practices of Christian mystics like Teresa of Avila, Thomas Merton, John of the Cross among others. Leaning into their experiences can become a gateway to hope, healing and oneness. Together with Kirsten Oates from the Center for Action and Contemplation, they explore listener questions and examine their own paths as modern contemplatives in this beautiful and broken world.", "link": "https://podcasts.apple.com/us/podcast/turning-to-the-mystics-with-james-finley/id1494041647"}, {"title": "Love. Period. with Rev. Dr. Jacqui Lewis", "producer": "Center for Action and Contemplation", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 62, "num_episodes": 11, "description": "Do you yearn for a new vision of Christianity—one with love and justice at the core of its practice? Rev. Dr. Jacqui Lewis animates a renewed faith for our times in her new podcast Love. Period. Writer, scholar, activist, and leader of a radically accepting congregation in New York City, Rev. Jacqui brings her devotion, clarity, and energy to this conversational podcast. In conversation with artists, activists, and faith leaders, such as actor Titus Burgess, Rev. Barbara Brown Taylor, Wajahat Ali, and many others, Rev. Jacqui reveals the transformative potential—and urgent need—for radical love in our times.", "link": "https://podcasts.apple.com/us/podcast/love-period-with-rev-dr-jacqui-lewis/id1559937758"}, {"title": "Catholic Answers Focus", "producer": "Catholic Answers", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 1000, "num_episodes": 263, "description": "Catholic Answers Focus, the world's premier podcast on Catholic apologetics, helps you explain and defend the Catholic Faith. If you want to take a deep dive into the reasons behind Church teaching, Catholic Answers Focus is for you.", "link": "https://podcasts.apple.com/us/podcast/catholic-answers-focus/id955874270"}, {"title": "Behold Israel", "producer": "Amir Tsarfati", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 736, "num_episodes": 65, "description": "Behold Israel is a non-profit organization led by native Israeli Amir Tsarfati. Our mission is to provide reliable and accurate reporting on developments in Israel and the region. Amir’s live updates and teachings, based on God’s Written Word, sift out the truth on current events amidst global media bias against Israel.Through our website, free app, social media and Amir’s teachings in multiple languages, we are able to reach communities worldwide. His teachings abroad and in the land explain the central role of Israel in the Bible as a blessing to the nations and a way to bring them to the Word of God and the Mes", "link": "https://podcasts.apple.com/us/podcast/behold-israel/id1502481411"}, {"title": "Heaven In Your Home", "producer": "Francie Winslow", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 132, "num_episodes": 69, "description": "This podcast is a place where we unpack God's heart on sex, marriage, and His mission on the earth.", "link": "https://podcasts.apple.com/us/podcast/heaven-in-your-home/id1493541368"}, {"title": "North Point Community Church", "producer": "North Point Community Church", "genre": "Religion & Spirituality", "rating": 4.6, "num_ratings": 1600, "num_episodes": 100, "description": "Welcome to the weekly audio podcast for North Point Community Church in Alpharetta, GA where our mission is to lead people into a growing relationship with Jesus Christ. Our desire is that this podcast will encourage you in your relationship with God. Visit us at northpoint.org.", "link": "https://podcasts.apple.com/us/podcast/north-point-community-church/id262317288"}, {"title": "Kids Bible Stories", "producer": "Jessica White", "genre": "Religion & Spirituality", "rating": 4.7, "num_ratings": 945, "num_episodes": 131, "description": "Enjoy these engaging and short Bible stories that help teach young children about Jesus. My hope is that the application section helps connect the dots of how the Bible applies to their lives. The Bible says \"Faith comes by hearing, and hearing by the Word of God.\" Romans 10:17. May your children hear the word through this podcast. Simply click play and enjoy listening during car rides, quiet times, school etc. Become a Paid Subscriber and enjoy listening Ad free :https://anchor.fm/kids-bible-stories/subscribe", "link": "https://podcasts.apple.com/us/podcast/kids-bible-stories/id1261515078"}, {"title": "Journeywomen", "producer": "Hunter Beless", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 2500, "num_episodes": 149, "description": "Life’s a journey we were never meant to walk alone. We all need friends along the way! On the Journeywomen podcast we’ll chat with Christian leaders about gracefully navigating the seasons and challenges we face on our journeys to glorify God.", "link": "https://podcasts.apple.com/us/podcast/journeywomen/id1244331156"}, {"title": "Go and Tell Gals", "producer": "Jess Connolly and Kennesha Buycks", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 496, "num_episodes": 95, "description": "Join hosts Jess Connolly and Kennesha Buycks as they interview women using what they've got to run on mission today. It is the mission of Go + Tell Gals to equip women to take their place in the Kingdom, using what they've been given, for His glory and the good of others.", "link": "https://podcasts.apple.com/us/podcast/go-and-tell-gals/id1437912225"}, {"title": "Follow Him: A Come, Follow Me Podcast featuring Hank Smith & John Bytheway", "producer": "Hank Smith & John Bytheway", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 2200, "num_episodes": 65, "description": "Do you ever feel that preparing for your weekly Come, Follow Me lesson falls short? Join hosts Hank Smith and John Bytheway as they interview experts to make your study for The Church of Jesus Christ of Latter-day Saints’ Come, Follow Me course not only enjoyable but original and educational. If you are looking for resources to make your study fresh, faithful, and fun--no matter your age--then join us every Friday at 6:00 PM MST for Part I and Saturday at 6:00 PM MST for Part II.  Show notes: https://followhim.co/episodes/   YouTube: https://www.youtube.com/c/FollowHimOfficialChannel   Instagram: Instagram.com/followhimpodcast      Facebook: Facebook.com/followhimpodcast", "link": "https://podcasts.apple.com/us/podcast/follow-him-come-follow-me-podcast-featuring-hank-smith/id1545433056"}, {"title": "John Eldredge and Wild at Heart (Audio‪)‬", "producer": "John Eldredge and Ransomed Heart", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 1100, "num_episodes": 632, "description": "Wild at Heart Podcasts", "link": "https://podcasts.apple.com/us/podcast/john-eldredge-and-wild-at-heart-audio/id260843816"}, {"title": "The Astrology Podcast", "producer": "Chris Brennan", "genre": "Religion & Spirituality", "rating": 4.7, "num_ratings": 896, "num_episodes": 302, "description": "A weekly podcast on topics related to astrology, hosted by professional astrologer Chris Brennan. The purpose of the show is to provide discussions ranging from explorations of specific astrological techniques, to treatments of issues pertaining to the history and philosophy of astrology.", "link": "https://podcasts.apple.com/us/podcast/the-astrology-podcast/id541401108"}, {"title": "Cooper Stuff Podcast", "producer": "John Cooper", "genre": "Religion & Spirituality", "rating": 5.0, "num_ratings": 1600, "num_episodes": 82, "description": "Cooper Stuff Podcast is an in depth look at what drives John Cooper (lead singer of Skillet); a commentary on culture from a traditional Biblical paradigm: Has modern culture stolen your world view?  With all the screaming voices, who do you trust?   How much have you been subversively influenced?  Cooper Stuff aims to point out subtle and not so subtle influences on culture with a traditional, Biblical world view/emphasis... while boiling complex issues down to simple language.", "link": "https://podcasts.apple.com/us/podcast/cooper-stuff-podcast/id1457739485"}, {"title": "Theology in the Raw", "producer": "Preston Sprinkle", "genre": "Religion & Spirituality", "rating": 4.6, "num_ratings": 547, "num_episodes": 300, "description": "In quick and dirty 20-25 minute episodes, Preston takes a fresh look at what the Bible really says, as he challenges opinions and traditions--yes, even his own. Homosexuality, sex, porn, drinking, immigration, racial tensions, violence, ISIS, Trump, guns, patriotism, you name it. If it's of interest, you can expect Preston to address it.   Think of it as theology for the rest of us.If you have any questions you'd like him to address on the show, email them to chris@prestonsprinkle.com. Hate mail and tirades will be discarded or mocked.", "link": "https://podcasts.apple.com/us/podcast/theology-in-the-raw/id1018952191"}, {"title": "Cultivated: A podcast about faith and work", "producer": "Christianity Today", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 499, "num_episodes": 63, "description": "Cultivated, hosted by Mike Cosper, is a conversational podcast that explores the connection between vocation and faith in the lives of individuals who are working to shape and influence the world around them. Guests range include artists, athletes, writers, academics, entrepreneurs, and business leaders.", "link": "https://podcasts.apple.com/us/podcast/cultivated-a-podcast-about-faith-and-work/id1165528200"}, {"title": "Spiritual Shit", "producer": "Alea Lovely", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 310, "num_episodes": 118, "description": "The down and dirty on modern spirituality. Follow Alea @thelovelyalea or visit her site thelovelyalea.com Remember to like and subscribe to never miss an episode and so can connect! Become a Patreon Supporter at patreon.com/thelovelyalea to get access to behind the scenes of our guests, Freebies, early access to new episodes, discounts on merch, and more.  Support this podcast: https://anchor.fm/alealovely/support", "link": "https://podcasts.apple.com/us/podcast/spiritual-shit/id1484110017"}, {"title": "As For Me And My House", "producer": "Jordan & Milena Ciciotti", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 3700, "num_episodes": 79, "description": "Husband and wife duo Jordan and Milena Ciciotti take you on a raw and unfiltered journey through their lives as followers of Jesus and parents of two. Whether they are sharing truth and Biblical wisdom, giving relationship advice, or telling funny stories of their dogs, Samson and Delilah, Jordan and Milena seek to exist as a platform for encouragement, love, and support for all who listen. Support this podcast: https://anchor.fm/asformeandmyhousepodcast/support", "link": "https://podcasts.apple.com/us/podcast/as-for-me-and-my-house/id1455909213"}, {"title": "Life.Church with Craig Groeschel", "producer": "Life.Church", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 1800, "num_episodes": 510, "description": "Each week on the Life.Church podcast, you’ll hear teaching from senior pastor Craig Groeschel or a Life.Church pastor. Get practical, relevant, biblical perspectives on topics that matter to you. Visit us at www.life.church or download the Life.Church app.", "link": "https://podcasts.apple.com/us/podcast/life-church-with-craig-groeschel/id73802266"}, {"title": "The Beautifully Enough Podcast - a weekly devotional for Christian women", "producer": "Valarie Reynolds", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 230, "num_episodes": 87, "description": "Are you tired of going through the motions? You know you should have a deeper more intimate relationship with God, but you just don’t know where to start? You want to hear His voice louder, clearer. Trust me, I have been there, sister. I know what it’s like to say you’re a Christian, but your quiet time and actions reflect something totally different. You know He loves you. You know you love Him. But you want to know Him as a deeper level. You want to know Jesus like the back of your hand. You want to understand His word, to read your Bible more, and to be a living example of the fruit of the spirit! I want to help you dive deeper into that journey and the truths in your life, God’s truths. To live, not as the world tells us to live, but to live fiercely as Godly women who fear the Lord! The Beautifully Enough Podcast is weekly devotional for Christian women. It is for any Christian woman who wants to develop more self confidence, courage and self esteem by restoring their belief back into God's truth and tearing down the lies they once believed about themselves! We grow our faith even stronger, study the Bible so you are armed with knowledge of what God’s truths are for your life, and we talk about every day pain points that every Christian woman struggles with.", "link": "https://podcasts.apple.com/us/podcast/beautifully-enough-podcast-weekly-devotional-for-christian/id1490628056"}, {"title": "Sounds True: Insights at the Edge", "producer": "Tami Simon", "genre": "Religion & Spirituality", "rating": 4.6, "num_ratings": 1100, "num_episodes": 300, "description": "Spiritual Teachings, where Tami Simon, Founder and Publisher of Sounds True interviews spiritual teachers, visionary writers, and living luminaries about their newest work and current challenges—the growing edge of their inner inquiry and outer contribution to the world.", "link": "https://podcasts.apple.com/us/podcast/sounds-true-insights-at-the-edge/id307934313"}, {"title": "The Happy Hour with Jamie Ivey", "producer": "Jamie Ivey", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 6600, "num_episodes": 481, "description": "The Happy Hour Podcast is hosted by Jamie Ivey, and each week she brings a guest to the show. During the happy hour they will discuss anything and everything just as if you were around the table with your own girlfriends. Jamie loves to connect with women and encourage them as they journey through life. These conversations will make you laugh and cry all in one. The Happy Hour will be something you look forward to each week.  You will be encouraged as you listen to other women talk about the simplest things in life to the grandest. Grab a cup of coffee and enjoy the conversation!", "link": "https://podcasts.apple.com/us/podcast/the-happy-hour-with-jamie-ivey/id880741976"}, {"title": "WHOA That's Good Podcast", "producer": "Sadie Robertson", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 7800, "num_episodes": 78, "description": "The \"WHOA That's Good\" podcast welcomes you into meaningful conversations with authors, athletes, musicians, speakers, and stars of film and television in search of the answer to just one question: What is the best advice you have ever been given? Hosted by Sadie Robertson, best-selling author, founder of Live Original, and star of A&E's \"Duck Dynasty\" & season 19 of ABC's \"Dancing with the Stars,\" this fun and lighthearted podcast is sure to leave you saying, \"WHOA That's Good!\"", "link": "https://podcasts.apple.com/us/podcast/whoa-thats-good-podcast/id1433974017"}, {"title": "Talking Scripture", "producer": "Talking Scripture", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 916, "num_episodes": 109, "description": "Mike Day and Bryce Dunford are members of the Church of Jesus Christ of Latter-day Saints who love to teach the scriptures. They explain and illustrate relevance in the text and discuss ideas for understanding and applying Come Follow Me and beyond.", "link": "https://podcasts.apple.com/us/podcast/talking-scripture/id1481923946"}, {"title": "Mufti Menk", "producer": "Muslim Central", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 1100, "num_episodes": 1896, "description": "Mufti Menk, FREE Audio Podcast brought to you by Muslim Central. Muslim Central is a private Audio Podcast Publisher. Our Audio Library consists of Islamic Lectures, Interviews, Debates and more, with over 100 Speakers and Shows from around the World.", "link": "https://podcasts.apple.com/us/podcast/mufti-menk/id592746186"}, {"title": "Verity by Phylicia Masonheimer", "producer": "Phylicia Masonheimer", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 582, "num_episodes": 54, "description": "The Verity podcast is hosted by author, speaker and public theologian Phylicia Masonheimer. Covering topics of faith and culture from a biblical perspective, through a historical lens, the podcast is designed to inspire you to ask better questions, go deeper in faith, and defend your beliefs with both grace and logic.", "link": "https://podcasts.apple.com/us/podcast/verity-by-phylicia-masonheimer/id1495210734"}, {"title": "Heart Wisdom with Jack Kornfield", "producer": "Be Here Now Network", "genre": "Religion & Spirituality", "rating": 4.7, "num_ratings": 965, "num_episodes": 131, "description": "The Jack Kornfield Heart Wisdom hour celebrates Jack’s ability to mash up his long established Buddhist practices with many other mystical traditions, revealing the poignancy of life’s predicaments and the path to finding freedom from self-interest, self-judgment and unhappiness.", "link": "https://podcasts.apple.com/us/podcast/heart-wisdom-with-jack-kornfield/id923017416"}, {"title": "Everyday Buddhism: Making Everyday Better", "producer": "Wendy Shinyo Haylett", "genre": "Religion & Spirituality", "rating": 4.3, "num_ratings": 180, "num_episodes": 58, "description": "Wendy Shinyo Haylett, an author, Buddhist teacher, lay minister, behavioral and spiritual coach shares the \"tips and tricks\" found in Buddhist teachings to make your professional and personal life better ... everyday!", "link": "https://podcasts.apple.com/us/podcast/everyday-buddhism-making-everyday-better/id1402257437"}, {"title": "Secular Buddhism", "producer": "Noah Rasheta", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 1900, "num_episodes": 154, "description": "A podcast for secular-minded people interested in learning about Buddhist philosophy and teachings.", "link": "https://podcasts.apple.com/us/podcast/secular-buddhism/id1071578260"}, {"title": "Understanding the Times", "producer": "Jan Markell", "genre": "Religion & Spirituality", "rating": 4.7, "num_ratings": 1200, "num_episodes": 14, "description": "To support this ministry financially, visit: https://www.oneplace.com/donate/407A compelling look at current events, Bible Prophecy and apologetics with interviews of well-known authors and prominent leaders from around the world.", "link": "https://podcasts.apple.com/us/podcast/understanding-the-times/id94661257"}, {"title": "The BEMA Podcast", "producer": "BEMA Discipleship", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 1800, "num_episodes": 229, "description": "The BEMA Podcast is a walk-through of the context of the Bible and the Text itself, as well as surrounding history.", "link": "https://podcasts.apple.com/us/podcast/the-bema-podcast/id1148115183"}, {"title": "The Village Church - Sermons", "producer": "The Village Church", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 2400, "num_episodes": 98, "description": "The Village Church exists to bring glory to God by making disciples through gospel-centered worship, gospel-centered community, gospel-centered service and gospel-centered multiplication.", "link": "https://podcasts.apple.com/us/podcast/the-village-church-sermons/id82014403"}, {"title": "Ask Father Josh (Your Catholic Question and Answer Podcast‪)‬", "producer": "Ascension - The Leader in Catholic Faith Formation", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 1900, "num_episodes": 162, "description": "Ask Fr. Josh is the podcast where I hear you out and do my best to help you navigate the tricky times in life when our Catholic Faith doesn’t give you an easy “fill-in-the blank” answer. On this show, we’ll listen to one another, problem solve together, and ultimately entrust everything to our Lord. If this is your first time tuning in, here’s how the show goes: Each episode, I'll address three to four of your questions. I’ll cover everything from Catholic teaching to moral dilemmas to relationship advice. I'm not perfect, and I can’t guarantee that my advice is going to make things easy, but I'll do my best to share what I've learned during my time as a priest, pastor, and friend. Email me your questions at  ascensionpress.com/askfatherjosh", "link": "https://podcasts.apple.com/us/podcast/ask-father-josh-your-catholic-question-and-answer-podcast/id1392010699"}, {"title": "Elevation with Steven Furtick", "producer": "Elevation Church", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 12400, "num_episodes": 165, "description": "Welcome to the weekly podcast of Elevation Church led by Pastor Steven Furtick. To learn more visit our website at http://elevationchurch.org or download the Elevation App. To support this ministry and help us continue to reach people all around the world click here: http://ele.vc/TI55jR", "link": "https://podcasts.apple.com/us/podcast/elevation-with-steven-furtick/id216015753"}, {"title": "Just Thinking Podcast", "producer": "Darrell Harrison & Virgil Walker", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 3200, "num_episodes": 113, "description": "The Just Thinking Podcast boldly confronts cultural, social, political, and theological issues through a biblically orthodox worldview.  Support this podcast: https://anchor.fm/podcast-just/support", "link": "https://podcasts.apple.com/us/podcast/just-thinking-podcast/id1328733796"}, {"title": "FamilyLife Today‪®‬", "producer": "FamilyLife Podcast Network", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 1100, "num_episodes": 121, "description": "FamilyLife Today® is a weekday podcast featuring fun, engaging conversations that help families grow together with Jesus while pursuing the relationships that matter most.", "link": "https://podcasts.apple.com/us/podcast/familylife-today/id212174303"}, {"title": "Heart of Dating", "producer": "Kait Warman", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 1400, "num_episodes": 177, "description": "The purpose of this podcast, The Heart of Dating, is to unmask the ever so ambiguous world of dating in the Christian world. While there are resources spread out across the years, there are not many centralized areas where Christians can access dating advice, help, and guidance easily and in a fashion that is accessible. The ultimate hope is that the HeART of Dating Podcast will start a healthy conversation for men and women and provide wise input and direction as we answer some tough questions and uncover some transformative ways to develop a healthy attitude and approach to dating as a Christian.", "link": "https://podcasts.apple.com/us/podcast/heart-of-dating/id1358733969"}, {"title": "Timothy Keller Sermons Podcast by Gospel in Life", "producer": "Tim Keller", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 8700, "num_episodes": 100, "description": "Classic sermons by Tim Keller, Pastor Emeritus of Redeemer Presbyterian Church in New York City and NY Times best-selling author of \"The Reason for God: Belief in an Age of Skepticism.\" For the latest sermons and additional resources, please visit https://www.GospelinLife.com", "link": "https://podcasts.apple.com/us/podcast/timothy-keller-sermons-podcast-by-gospel-in-life/id352660924"}, {"title": "The Enneagram Journey", "producer": "Suzanne Stabile", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 1800, "num_episodes": 100, "description": "Using the wisdom of the Enneagram, and ongoing discussion and conversation, we will grow compassion for ourselves and others, as well as a better understanding for why we do what we do!", "link": "https://podcasts.apple.com/us/podcast/the-enneagram-journey/id1292950516"}, {"title": "Life with Lisa Harper", "producer": "Lisa Harper", "genre": "Religion & Spirituality", "rating": 5.0, "num_ratings": 1300, "num_episodes": 8, "description": "Join Lisa Harper as she dives into stories that will help strengthen your back & soften your heart. In each episode, Lisa will interview a guest about their story, and occasionally Lisa will teach on a relevant topic. Prepare to laugh deeply and lean in, as Lisa and her guests explore the light and heavy stories of walking in faith. Episodes release on the second and fourth Thursday each month.", "link": "https://podcasts.apple.com/us/podcast/life-with-lisa-harper/id1497816177"}, {"title": "The Real Life Podcast", "producer": "Jefferson & Alyssa Bethke", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 1800, "num_episodes": 100, "description": "Jeff and Alyssa are a married couple with two toddlers running around their home talking about faith, culture, and take listener's questions with a little dash of random sprinkled in.", "link": "https://podcasts.apple.com/us/podcast/the-real-life-podcast/id954046496"}, {"title": "Angels and Awakening", "producer": "Julie Jancius: Spiritual Guide, Intuitive Reiki Healer, Psychic Medium, Teacher (God, Intuition, Manifest, Soul, Higher + Highest Self, Spirit Guides, Grief, Consciousness, Life After Death)", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 975, "num_episodes": 234, "description": "Learn to clear your energy (Mind | Body | Soul | Chakras) and communicate with your Angels, Spirit Guides and loved ones on the Other Side (Heaven) → Julie Jancius @angelpodcast is an Angel Medium + Reiki Master who heard her dad talking to her from Heaven, a month before family called to let her know he’d passed away. She’ll teach you how to shed your anxiety + live in a high yummy vibration of love, joy, peace, bliss, ease and grace. Start w/ episodes 1, 2 + 3. → → → BOOK A SESSION @ WWW.JANCIUS.COM: For a private reading or to book Julie to give readings at your next party, please visit www.jancius.com. → → → WIN A FREE SESSION!!! When you leave 5 Stars ✩✩✩✩✩ and a Positive Review, we enter your name into a monthly drawing to win a free 25 min reading with Julie (your name stays in until you win). It is best to email your review to juliejancius@gmail.com so we have a way to let you know you won! → → → PRAYER JAR: Want Julie to include you, your friends/family in her daily prayers? Add your name to her prayer jar by subscribing for FREE on her website: www.jancius.com (scroll to the very bottom). → → → FOLLOW JULIE ON FACEBOOK + INSTAGRAM + YOUTUBE → → → INSTAGRAM: @angelpodcast or www.instagram.com/angelpodcast/  → → → FACEBOOK: www.facebook.com/angelpodcast/ → → → YOUTUBE: https://www.youtube.com/channel/UCLOL5Dgsssv7A4C7SLvyqWg?view_as=subscriber", "link": "https://podcasts.apple.com/us/podcast/angels-and-awakening/id1451424894"}, {"title": "Growing Together with Kaelin & Kyrah Edwards", "producer": "Kaelin and Kyrah Edwards", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 547, "num_episodes": 2, "description": "A coming-of-age podcast that candidly explores and documents the obstacles, trials, and decisions that come with growing into adulthood. Kaelin and Kyrah dig into long-form, honest conversations about their experience growing together as partners, parents, business owners, and individuals.Set to the backdrop of their shared Christian faith, the podcast provides a closer look at a marriage committed to ongoing growth. Weekly episodes will feature Q&As from audience members, interviews with thought leaders, social commentary, or personal conversations on a dedicated theme that Kaelin and Kyrah are learning about.It’s confessional-style storytelling, shared experiences, and wisdom from the friends you trust with all of your questions.", "link": "https://podcasts.apple.com/us/podcast/growing-together-with-kaelin-kyrah-edwards/id1573314088"}, {"title": "The Carey Nieuwhof Leadership Podcast", "producer": "Carey Nieuwhof", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 1400, "num_episodes": 410, "description": "The Carey Nieuwhof Leadership Podcast is a podcast all about leadership, change and personal growth. The goal? To help you lead like never before—in your church or in your business.Carey interviews top business and church leaders like Seth Godin, Adam Grant, Nancy Duarte, Simon Sinek, Cal Newport, Patrick Lencioni, Tim Keller, Annie F. Downs, Andy Stanley, Craig Groeschel, Rob Pelinka, Michael Hyatt, Christine Caine, John Mark Comer, Henry Cloud,  Gordon MacDonald, Francis Chan, Lysa TerKeurst, Ian Morgan Cron and many more.For insightful posts on leadership, change and personal growth, episode transcripts and podcast show notes, go to www.careynieuwhof.com.", "link": "https://podcasts.apple.com/us/podcast/carey-nieuwhof-leadership-podcast-lead-like-never-before/id912753163"}, {"title": "The Briefing - AlbertMohler.com", "producer": "R. Albert Mohler, Jr.", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 5900, "num_episodes": 34, "description": "For more resources, including articles, The Briefing, Thinking in Public, and archived editions of his nationally-syndicated radio show, The Albert Mohler Program, be sure to visit albertmohler.com.", "link": "https://podcasts.apple.com/us/podcast/the-briefing-albertmohler-com/id390278738"}, {"title": "Living on the Edge with Chip Ingram Daily Podcast", "producer": "Chip Ingram", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 1300, "num_episodes": 174, "description": "Discovering the Bible's answers is the focus of Living on the Edge, the broadcast ministry of Chip Ingram. Each weekday, Chip will take you to God's Word for advice on topics like strengthening your marriage, understanding love and sex, raising moral children, and overcoming painful emotions. Chip also shares honestly from his own experiences. Visit us online at https://LivingontheEdge.org.", "link": "https://podcasts.apple.com/us/podcast/living-on-the-edge-with-chip-ingram-daily-podcast/id271206562"}, {"title": "Revive Our Hearts", "producer": "Nancy DeMoss Wolgemuth", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 1100, "num_episodes": 300, "description": "Are you a woman who wants to know God and live life His way? If so, Revive Our Hearts can help you. The host, Nancy DeMoss Wolgemuth, has an incredible passion and love for Jesus Christ and for women. Listen in to this nationally syndicated radio program heard each weekday on nearly 1,000 radio station outlets as Nancy interviews guests and teaches directly from God's Word. This is more than just a program--get ready for a personal, counter-cultural revolution in your heart and home!", "link": "https://podcasts.apple.com/us/podcast/revive-our-hearts/id1181154045"}, {"title": "Latter-day Saint Women Podcast", "producer": "The Church of Jesus Christ of Latter-day Saints", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 402, "num_episodes": 69, "description": "The Latter-day Saint Women podcast shares the legacy of women of The Church of Jesus Christ of Latter-day Saints. Get to know the faithful women who shaped our past, and hear from inspiring women of faith today as they address gospel topics.", "link": "https://podcasts.apple.com/us/podcast/latter-day-saint-women-podcast/id1491361653"}, {"title": "The Holy Post", "producer": "Phil Vischer", "genre": "Religion & Spirituality", "rating": 4.7, "num_ratings": 2200, "num_episodes": 464, "description": "Join VeggieTales and What's in the Bible? creator Phil Vischer and co-host Skye Jethani (author, speaker, pastor) for a fast-paced and often funny conversation about pop culture, media, theology, and the fun, fun, fun of living a thoughtful Christian life in an increasingly post-Christian culture.", "link": "https://podcasts.apple.com/us/podcast/the-holy-post/id591157388"}, {"title": "Ram Dass Here And Now", "producer": "Ram Dass / Love Serve Remember", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 1700, "num_episodes": 182, "description": "Ram Dass shares his heart-centered wisdom in each episode featuring excerpted lectures given throughout the last 40 years, with an introduction from Raghu Markus of Ram Dass' Love Serve Remember Foundation.", "link": "https://podcasts.apple.com/us/podcast/ram-dass-here-and-now/id518366323"}, {"title": "Pastor Rick's Daily Hope", "producer": "PastorRick.com", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 4600, "num_episodes": 150, "description": "Rick Warren is an innovative pastor, renowned author, and global influencer.", "link": "https://podcasts.apple.com/us/podcast/pastor-ricks-daily-hope/id631094342"}, {"title": "Sheologians", "producer": "Summer White", "genre": "Religion & Spirituality", "rating": 4.5, "num_ratings": 1800, "num_episodes": 246, "description": "Join Joy the Girl from Apologia Radio and Summer White as they discuss the Christian worldview in this micro-podcast. Men, be entertained. Women, learn something!", "link": "https://podcasts.apple.com/us/podcast/sheologians/id1160066385"}, {"title": "The Elisabeth Elliot Podcast", "producer": "The Elisabeth Elliot Foundation", "genre": "Religion & Spirituality", "rating": 5.0, "num_ratings": 220, "num_episodes": 40, "description": "Visit www.ElisabethElliot.org for more lectures and talks, devotionals, videos, Gateway to Joy programs, and other resources.", "link": "https://podcasts.apple.com/us/podcast/the-elisabeth-elliot-podcast/id1537596556"}, {"title": "Joseph Prince Audio Podcast", "producer": "Joseph Prince", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 2200, "num_episodes": 12, "description": "With more than two decades of full-time ministry behind him, Joseph Prince is today a leading voice in proclaiming the gospel of grace around the world through his books, teaching resources, and television ministry. The author of best sellers such as The Power of Right Believing, Destined To Reign, and Unmerited Favor, Joseph is also a highly sought-after conference speaker. He has impacted church leaders worldwide by preaching the unadulterated gospel of Jesus with boldness. He is known for teaching God's Word in a fresh, practical, and revelatory way that always unveils Jesus. His humorous, dynamic, and engaging style of preaching has also endeared him to a wide spectrum of viewers who tune in to his daily television program. His broadcast currently reaches millions of homes across North America, Europe, Africa, Australia, and Israel on both secular and Christian networks. A founding member of New Creation Church, Joseph initially served as an elder and associate pastor. However, his unanimous appointment as senior pastor in 1990 marked a turning point in the history of the church, which started experiencing phenomenal growth. Under Joseph's leadership, the church congregation has grown by more than a hundredfold—from about 150 to more than 31,000 attendees. Joseph believes the best in people and is committed to helping them discover how they can reign in life through the abundance of grace and gift of righteousness. His desire is to help this generation of believers understand the new covenant of grace and realize how greatly blessed, highly favored, and deeply loved they are by their heavenly Father. For more information, please visit www.josephprince.org", "link": "https://podcasts.apple.com/us/podcast/joseph-prince-audio-podcast/id334204277"}, {"title": "Changing Your World Podcast with Creflo Dollar", "producer": "World Changers Church International", "genre": "Religion & Spirituality", "rating": 4.7, "num_ratings": 1200, "num_episodes": 22, "description": "Creflo Dollar's revolutionary teaching, Favor Revealed by the Cross, reveals the two aspects of Jesus' ministry.  Many of the things Jesus said were directed toward the Jews, who were subject to the Law at the time. However, the second part of His ministry focused on the freedom we would all experience in the new covenant after His death. Be free because Jesus never intended a Christian to strive to live by law!  Please fill out our survey - https://survey.libsyn.com/cdmaudio", "link": "https://podcasts.apple.com/us/podcast/changing-your-world-podcast-with-creflo-dollar/id493151356"}, {"title": "VOUS Church", "producer": "Rich and Dawncheré Wilkerson", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 1800, "num_episodes": 100, "description": "Messages from Rich and Dawncheré Wilkerson, lead pastors of VOUS Church in Miami, FL — New episodes every Monday! Our vision is to reach our city and beyond with the life transforming message of Jesus. We hope that you are encouraged by this podcast. For more information about VOUS Church, please visit vouschurch.com.", "link": "https://podcasts.apple.com/us/podcast/vous-church/id1042709241"}, {"title": "The Fr. Mike Schmitz Catholic Podcast", "producer": "Ascension - The Leader in Catholic Faith Formation", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 4500, "num_episodes": 314, "description": "Faith, pop culture, and headline reflections from Fr. Mike Schmitz.", "link": "https://podcasts.apple.com/us/podcast/the-fr-mike-schmitz-catholic-podcast/id1200915759"}, {"title": "ESV Old Testament (Dramatized) - English Standard Version Bible", "producer": "Bible", "genre": "Religion & Spirituality", "rating": 4.5, "num_ratings": 228, "num_episodes": 929, "description": "The English Audio Drama New Testament (ESV) is a unique presentation of the Audio Bible with approximately 180 different characters and a digitally recorded sound track with full sound effects. For a list of other available languages go to our website at http://FaithComesByHearing.com. The mission of Faith Comes By Hearing is to bring His Church together and make disciples from every nation, tribe, language, and people: to give every person the opportunity to listen completely through the New Testament in their heart language.", "link": "https://podcasts.apple.com/us/podcast/esv-old-testament-dramatized-english-standard-version/id560588096"}, {"title": "BibleProject", "producer": "BibleProject", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 11700, "num_episodes": 257, "description": "The creators of BibleProject have in-depth conversations about the Bible and theology. A companion podcast to BibleProject videos found at bibleproject.com", "link": "https://podcasts.apple.com/us/podcast/bibleproject/id1050832450"}, {"title": "Bridgetown Audio Podcast", "producer": "Bridgetown Church", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 2200, "num_episodes": 496, "description": "In Portland as it is in Heaven. All teachings are available to stream and download at bridgetown.church.", "link": "https://podcasts.apple.com/us/podcast/bridgetown-audio-podcast/id84246334"}, {"title": "The Tipping Point with Jimmy Evans", "producer": "XO Podcast Network", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 219, "num_episodes": 23, "description": "The End is Here. Take a deep breath, and let best-selling author, Jimmy Evans show you—through his forty-five years of end times knowledge—the truth about what the Scriptures say about the times we are living in. In this timely podcast, you'll learn how to have hope and peace in the midst of it all. Jimmy Evans, draws on decades of study, experience, and biblical expertise to answer questions, expound on world events, and offer unparalleled insight into prophetic scripture.", "link": "https://podcasts.apple.com/us/podcast/the-tipping-point-with-jimmy-evans/id1547694701"}, {"title": "Radical with David Platt", "producer": "Radical", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 1200, "num_episodes": 295, "description": "Radical with David Platt is a podcast that highlights sermons weekly from teacher, author, and pastor David Platt.", "link": "https://podcasts.apple.com/us/podcast/radical-with-david-platt/id929751982"}, {"title": "Joyce Meyer Enjoying Everyday Life® TV Audio Podcast", "producer": "Joyce Meyer Ministries", "genre": "Religion & Spirituality", "rating": 4.7, "num_ratings": 3600, "num_episodes": 21, "description": "Enjoying Everyday Life® is a daily TV and radio broadcast provided by Joyce Meyer Ministries.", "link": "https://podcasts.apple.com/us/podcast/joyce-meyer-enjoying-everyday-life-tv-audio-podcast/id152564324"}, {"title": "Going Beyond Ministries with Priscilla Shirer", "producer": "Going Beyond Ministries with Priscilla Shirer", "genre": "Religion & Spirituality", "rating": 4.7, "num_ratings": 1500, "num_episodes": 7, "description": "Official ITunes page of Going Beyond Ministries with @PriscillaShirer. Follow for spiritual growth and encouragement. Ephesians 3:20-21", "link": "https://podcasts.apple.com/us/podcast/going-beyond-ministries-with-priscilla-shirer/id840242536"}, {"title": "Becoming Something with Jonathan Pokluda", "producer": "Harris Creek Baptist Church", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 2400, "num_episodes": 144, "description": "We’re all becoming something. What are you becoming? It's our goal for you to intentionally become the person God has called you to be. We'll release an episode each week with answers to real questions that college students and young adults are asking us. Listen in as Jonathan Pokluda, Nate Hilgenkamp, and Kathy Davidson help you navigate life in your 20's and 30's!", "link": "https://podcasts.apple.com/us/podcast/becoming-something-with-jonathan-pokluda/id1454045768"}, {"title": "The Digital Sisterhood", "producer": "Beautiful Light Studios", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 91, "num_episodes": 12, "description": "Welcome, Friends. Storytelling has the power to not only create connections but provide universal truths about ourselves and the world. When listening to this podcast, I ask that you honor these stories and the rawness, transparency, and vulnerability that they invoke. Invite them with an open heart and you will see that all stories share a universal message. I pray that each anecdote leaves you inspired to share as the Prophet (ﷺ) said, \"It is also charity to utter a good word.”  But more importantly, I pray that you allow yourself to find comfort in the good, wisdom in the hardship, and the courage to trust Allah.", "link": "https://podcasts.apple.com/us/podcast/the-digital-sisterhood/id1562999893"}, {"title": "Restore The Glory Podcast", "producer": "Jake Khym & Bob Schuchts", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 338, "num_episodes": 33, "description": "A practical discussion where two former therapists share what they learned professionally and experienced personally about the healing and restoration of our God-given glory", "link": "https://podcasts.apple.com/us/podcast/restore-the-glory-podcast/id1505423615"}, {"title": "Tony Evans' Sermons on Oneplace.com", "producer": "Dr. Tony Evans", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 5600, "num_episodes": 14, "description": "To support this ministry financially, visit: https://www.oneplace.com/donate/222The Urban Alternative is the national ministry of Dr. Tony Evans and is dedicated to restoring hope and transforming lives through the proclamation and application of the Word of God.", "link": "https://podcasts.apple.com/us/podcast/tony-evans-sermons-on-oneplace-com/id406782386"}, {"title": "BibleThinker", "producer": "Mike Winger", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 800, "num_episodes": 411, "description": "Learn to think biblically about everything. Teaching theology, apologetics or verse by verse Bible Studies. Mike Winger teaches with clarity, doesn't shy away from controversial topics and always seeks to teach the Bible accurately.  This will equip you to know and defend the Christian faith and understand the Bible in a deeper way.", "link": "https://podcasts.apple.com/us/podcast/biblethinker/id1358056327"}, {"title": "The Proverbs 31 Ministries Podcast", "producer": "Proverbs 31 Ministries", "genre": "Religion & Spirituality", "rating": 4.7, "num_ratings": 3500, "num_episodes": 91, "description": "For over 25 years Proverbs 31 Ministries' mission has been to intersect God's Word in the real, hard places we all struggle with. That's why we started this podcast. Every episode will feature a variety of teachings from president Lysa TerKeurst, staff members or friends of the ministry who can teach you something valuable from their vantage point. We hope that regardless of your age, background or stage of life, it's something you look forward to listening to each month!", "link": "https://podcasts.apple.com/us/podcast/the-proverbs-31-ministries-podcast/id757953988"}, {"title": "Have You Heard? with Emma Mae Jenkins", "producer": "Emma Mae Jenkins & Converge Podcast Network", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 751, "num_episodes": 52, "description": "Faith comes by hearing. Join Emma Mae Jenkins on the Have You Heard? podcast! Emma will be sharing messages straight from Scripture and having fun conversations with some special guests, as she seeks to grow in her faith with you! So thanks for tuning in to this podcast and finding hope in the Word of God.", "link": "https://podcasts.apple.com/us/podcast/have-you-heard-with-emma-mae-jenkins/id1521140959"}, {"title": "Equip and Empower with Christine Caine", "producer": "AccessMore", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 1000, "num_episodes": 118, "description": "GET FREE ACCESS TO CHRISTINE'S NEW ONLINE COURSE - ANCHOREDChristine's new book, How Did I Get Here? Finding Your Way Back to God When Everything is Pulling Your Away, is avaiable for pre-order now! Anyone who pre-orders will receive access to Christine's online course, Anchored, for FREE! Details at www.HowDidIGetHereBook.com ABOUT THE PODCASTWe live in a world that whispers that you’re not enough. That you are defeated. That you are disqualified because of your past. These lies are everywhere, everyday. You read about them, hear about them, and interact with them. But Christine Caine is here to speak above that noise with the truth of how God sees you, and who he’s created you to be, so you can make his name famous! She will equip and empower you to create change in this world and live out your God given destiny! If you desire to bring hope, create change, and see yourself the way God sees you, this podcast is for you.", "link": "https://podcasts.apple.com/us/podcast/equip-and-empower-with-christine-caine/id1512546904"}, {"title": "The Porch", "producer": "The Porch", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 2600, "num_episodes": 300, "description": "Welcome to the sermon podcast of The Porch, a young adult ministry of Watermark Community Church in Dallas, Texas. The Porch is a gathering of 3,000+ young adults who meet every Tuesday night at 7 PM CST. Each week we address challenges that face twenty and thirty-somethings and what The Bible has to say about them. For more information, visit www.theporch.live or download The Porch app: https://apple.co/2MlYc1P.", "link": "https://podcasts.apple.com/us/podcast/the-porch/id325418914"}, {"title": "Apologia Radio", "producer": "Apologia Radio, Jeff Durbin", "genre": "Religion & Spirituality", "rating": 4.7, "num_ratings": 1300, "num_episodes": 154, "description": "Gospel Driven, Hard Hitting, Culturally Relevant", "link": "https://podcasts.apple.com/us/podcast/apologia-radio/id579948407"}, {"title": "Wretched Radio", "producer": "Wretched Radio", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 2200, "num_episodes": 16, "description": "TV and Radio", "link": "https://podcasts.apple.com/us/podcast/wretched-radio/id1292370916"}, {"title": "The Lord of Spirits", "producer": "Fr. Andrew Stephen Damick, Fr. Stephen De Young, and Ancient Faith Ministries", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 475, "num_episodes": 22, "description": "The modern world does not acknowledge but is nevertheless haunted by spirits - angels, demons and saints. Fathers Andrew Stephen Damick and Stephen De Young focus on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history.", "link": "https://podcasts.apple.com/us/podcast/the-lord-of-spirits/id1531206254"}, {"title": "Daily Radio Program with Charles Stanley - In Touch Ministries", "producer": "Dr. Charles Stanley", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 6300, "num_episodes": 937, "description": "Dr. Charles Stanley and In Touch Ministries' daily radio program.", "link": "https://podcasts.apple.com/us/podcast/daily-radio-program-charles-stanley-in-touch-ministries/id117752146"}, {"title": "Dr. Wayne W. Dyer Podcast", "producer": "Hay House", "genre": "Religion & Spirituality", "rating": 4.6, "num_ratings": 1000, "num_episodes": 199, "description": "Discover the wisdom and remarkable insights of Dr. Wayne W. Dyer, world-renowned spiritual teacher and foremost authority on how the power of your mind creates your world. Dr. Dyer’s weekly talk show on HayHouseRadio.com explores the power we have as individuals to create and manifest events in our lives. Hear lively discussions on how you can move past fear and into love.  For more from Dr. Dyer, visit www.drwaynedyer.com.", "link": "https://podcasts.apple.com/us/podcast/dr-wayne-w-dyer-podcast/id988177838"}, {"title": "The Godly Dating 101 Podcast", "producer": "Tovares and Safa Grey", "genre": "Religion & Spirituality", "rating": 5.0, "num_ratings": 3200, "num_episodes": 85, "description": "A podcast designed to encourage believers to live and date in a way that honors Christ. Tovares and Safa’s passion is to see couples maintain godly relationships and honor Christ in all of their actions. There are some topics that seem “taboo”, but that’s why believers stay bound in sin. On this podcast we will address everything the Church may be silent on to encourage you all to see what the Bible says.  Support this podcast: https://anchor.fm/godlydating101/support", "link": "https://podcasts.apple.com/us/podcast/the-godly-dating-101-podcast/id1483086030"}, {"title": "Living Proof with Beth Moore", "producer": "Beth Moore", "genre": "Religion & Spirituality", "rating": 4.6, "num_ratings": 1600, "num_episodes": 129, "description": "Messages by author and speaker Beth Moore, founder of Living Proof Ministries. www.lproof.org", "link": "https://podcasts.apple.com/us/podcast/living-proof-with-beth-moore/id1289289851"}, {"title": "Alpha and Omega Ministries", "producer": "Dr. James White", "genre": "Religion & Spirituality", "rating": 4.7, "num_ratings": 865, "num_episodes": 105, "description": "The newest sermons from Alpha and Omega Ministries on SermonAudio.", "link": "https://podcasts.apple.com/us/podcast/alpha-and-omega-ministries/id1004561753"}, {"title": "Dr Taylor Marshall Catholic Show", "producer": "Taylor Marshall", "genre": "Religion & Spirituality", "rating": 4.7, "num_ratings": 3100, "num_episodes": 250, "description": "Do you have a life full of Christian joy? Jesus said, \"I have told you this so that my joy may be in you and that your joy may be complete.\" Join us every week as Dr. Taylor Marshall provides tips and lessons on how to have a life full of meaning, hope, and encouragement through the message of Our Lord Jesus Christ. Dr. Marshall draws from the Bible, the Church Fathers, and Medieval Philosophy to provide a podcast that is full of energy and information.He blogs at www.TaylorMarshall.com.", "link": "https://podcasts.apple.com/us/podcast/dr-taylor-marshall-catholic-show/id689871918"}, {"title": "The Gospel Truth", "producer": "Andrew Wommack Ministries", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 803, "num_episodes": 686, "description": "This podcast features the daily Gospel Truth TV broadcasts from Andrew Wommack Ministries.", "link": "https://podcasts.apple.com/us/podcast/the-gospel-truth/id293048667"}, {"title": "Conspirituality", "producer": "Derek Beres, Matthew Remski, Julian Walker", "genre": "Religion & Spirituality", "rating": 4.2, "num_ratings": 582, "num_episodes": 93, "description": "A weekly study of converging right-wing conspiracy theories and faux-progressive wellness utopianism. At best, the conspirituality movement attacks public health efforts in times of crisis. At worst, it fronts and recruits for the fever-dream of QAnon. As the alt-right and New Age horseshoe toward each other in a blur of disinformation, clear discourse and good intentions get smothered. Charismatic influencers exploit their followers by co-opting conspiracy theories on a spectrum of intensity ranging from vaccines to child trafficking. In the process, spiritual beliefs that have nurtured creativity and meaning are transforming into memes of a quickly-globalizing paranoia. Conspirituality Podcast attempts to bring understanding to this landscape. A journalist, a cult researcher, and a philosophical skeptic discuss the stories, cognitive dissonances, and cultic dynamics tearing through the yoga, wellness, and new spirituality worlds. Mainstream outlets have noticed the problem. We crowd-source, research, analyze, and dream answers to it.", "link": "https://podcasts.apple.com/us/podcast/conspirituality/id1515827446"}, {"title": "The Potter's Touch on Lightsource.com - Audio", "producer": "Bishop T.D. Jakes", "genre": "Religion & Spirituality", "rating": 4.6, "num_ratings": 100, "num_episodes": 14, "description": "To support this ministry financially, visit: https://www.lightsource.com/donate/973The Potter's Touch, a weekly program, with Bishop T.D. Jakes, tackles today's topics and confronts the hidden issues and invisible scars that go untreated. This broadcast carries healing and restoration into homes of hurting people, unearthing taboo topics and offering practical and spiritual solutions to life's toughest questions. 857311", "link": "https://podcasts.apple.com/us/podcast/the-potters-touch-on-lightsource-com-audio/id1525270188"}, {"title": "Marriage in Transition with Sean & Lanette Reed", "producer": "XO Podcast Network", "genre": "Religion & Spirituality", "rating": 5.0, "num_ratings": 25, "num_episodes": 6, "description": "Your marriage will be shaped by the seasons of change. Transitions can have positive or negative impacts depending on how you navigate them. Sean and Lanette talk about how to see each other through uncontrollable circumstances.This is a podcast designed to help couples find connection through times of uncontrollable change. With humor and wisdom, Sean and Lanette share practical tips that helped them break the cycle of poorly navigated problems in their marriage. Together they have built a strong following, reaching thousands of married couples through their YouTube videos, books, and public speaking. They have three adult children and are Marriage and Family Pastors at Opendoor Church in Greenville, NC.Website: xomarriage.com/marriageintransitionSean & Lanette's book marriageintransition.com.", "link": "https://podcasts.apple.com/us/podcast/marriage-in-transition-with-sean-lanette-reed/id1569906479"}, {"title": "The Witch Bitch Amateur Hour", "producer": "Charlye Michelle, Macy Frazier", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 860, "num_episodes": 159, "description": "Meet Charlye Michelle and Macy Frazier, also known as the hosts of The Witch Bitch Amateur Hour. They invite you to join them as they explore the overly complicated and highly debated world of all that is spiritual. Sit back, relax, an enjoy as these Basic Witches provide you with lots of laughs, and hopefully some learning along the way", "link": "https://podcasts.apple.com/us/podcast/the-witch-bitch-amateur-hour/id1398452484"}, {"title": "Stand to Reason Weekly Podcast", "producer": "Greg Koukl", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 800, "num_episodes": 100, "description": "Our purpose is to help Christians think more clearly about their faith and to help them make an even-handed, incisive, yet gracious defense for classical Christianity. Released every Wednesday and Friday.", "link": "https://podcasts.apple.com/us/podcast/stand-to-reason-weekly-podcast/id370282268"}, {"title": "Hey Spirit! With Theresa Caputo", "producer": "An Evening With Theresa", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 1100, "num_episodes": 37, "description": "A practicing medium for more than 15 years with a fanbase in the millions, Theresa Caputo surged into the mainstream via her hit TV show “The Long Island Medium,” now entering its 10th season. Now she’s sharing her spiritual wisdom and intuitive gifts via audio format for the first time.On HEY SPIRIT!, Theresa will channel the souls of those who have passed, conduct Q&As with people from all over the world, and share feel-good tips from her everyday life on how to enjoy a healthier and happier time on earth. When she connects with angels, loved ones, and guides on the other side—souls she refers to as “Spirit”—Theresa will help guests work through their related grief to help them heal and move forward with peace and self-assurance. This podcast will also allow for Theresa’s fans, callers, and guests—maybe even a few surprise celebs!—to have the rare opportunity to get a reading and receive healing messages. Finally, Theresa will ring in on how to cope with the ongoing pandemic and the related anxiety and sadness we feel over losing our pre-COVID, “normal” world.At least that’s the plan for now. You never know what will happen when Spirit enters the room! If you’d like to ask Theresa a question or have a chance at a reading, you can leave a message at 1 877-TCAPUTO (877 822 7886).", "link": "https://podcasts.apple.com/us/podcast/hey-spirit-with-theresa-caputo/id1534764208"}, {"title": "She Reads Truth Podcast", "producer": "She Reads Truth", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 1800, "num_episodes": 88, "description": "We know reading the Bible every day can be hard. It’s easy to feel stuck, lost, or unsure where to start. We get it. We’ve been there too. Our hope for this podcast is that it will serve as a complement to our reading plans, to encourage you on your commute to work, while you’re out for a walk, or at home making dinner. God’s Word is for you and for now. That's why our community is here and always open to you.", "link": "https://podcasts.apple.com/us/podcast/she-reads-truth-podcast/id1480595648"}, {"title": "The (in)courage Podcast", "producer": "(in)courage", "genre": "Religion & Spirituality", "rating": 5.0, "num_ratings": 19, "num_episodes": 2, "description": "The (in)courage you know and love -- the virtual living room where we pile together on the couch, lounge in comfy chairs, sprawl out on the floor, and create a comfy circle of sisters who are always ready to shift and smoosh together to make space for more -- is now a podcast! Yippee!! Season One will drop soon; subscribe today so you don't miss a minute. Join us daily at incourage.me for a new story from one of our thirty contributing writers. (in)courage is an online community where women gather to build community, celebrate diversity, and become women of courage. We share our unique stories – joys and struggles equally – for the purpose of pointing others to the eternal hope of Jesus Christ. This is what it means to be (in) community. We're always better when we make time to gather in the living room together. . . and now via podcast!", "link": "https://podcasts.apple.com/us/podcast/the-in-courage-podcast/id1570580747"}, {"title": "The Bible Recap", "producer": "D-Group", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 15800, "num_episodes": 960, "description": "The Bible Recap", "link": "https://podcasts.apple.com/us/podcast/the-bible-recap/id1440833267"}, {"title": "Learning How to See with Brian McLaren", "producer": "Center for Action and Contemplation", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 378, "num_episodes": 10, "description": "How do we transform and transcend our biases? From judgments made unconsciously to complacency in systemic evil, we must learn how to see if we are to learn how to transform. Center for Action and Contemplation faculty member Brian McLaren hosts the podcast series Learning How to See. Listen and discover how seeing is social, political, and contemplative.", "link": "https://podcasts.apple.com/us/podcast/learning-how-to-see-with-brian-mclaren/id1532685433"}, {"title": "The Fierce Marriage Podcast", "producer": "Ryan and Selena Frederick", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 3400, "num_episodes": 229, "description": "Show hosts Ryan and Selena Frederick discuss modern marriage issues with their trademark transparency, humor, and gospel-centered discussion. Join them for honest conversations, light-hearted hilarity, and more than enough grace to go around.", "link": "https://podcasts.apple.com/us/podcast/the-fierce-marriage-podcast/id1292084760"}, {"title": "Rhythms for Life", "producer": "Rebekah Lyons and Gabe Lyons", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 1000, "num_episodes": 93, "description": "Are you managing stress or is your stress managing you? What practical steps can you take each day for sustained emotional, spiritual and relational health? In the Rhythms for Life podcast, authors, speakers, and founders of Q Ideas, Gabe Lyons and Rebekah Lyons, invite listeners to journey with them and expert guests into transparent conversations brimming with practical advice. From artists, nutritionists and psychologists to thought leaders, advocates and entrepreneurs, listeners will meet expert guides that will help them keep stress and anxiety at bay and pursue everyday moments of abundance by establishing four life-giving rhythms: rest, restore, connect, and create.", "link": "https://podcasts.apple.com/us/podcast/rhythms-for-life/id1477541494"}, {"title": "Let's Talk", "producer": "Jackie Hill Perry, Melissa Kruger, Jasmine Holmes", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 834, "num_episodes": 23, "description": "Let’s Talk is a podcast for women from The Gospel Coalition Podcast Network. On each episode, Jackie Hill Perry, Melissa Kruger, and Jasmine Holmes talk about a different topic and how to apply biblical wisdom to everyday life.", "link": "https://podcasts.apple.com/us/podcast/lets-talk/id1513728098"}, {"title": "Questions from the Closet", "producer": "Questions from the Closet", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 534, "num_episodes": 61, "description": "Charlie Bird and Ben Schilaty discuss questions they are commonly asked as gay members of The Church of Jesus Christ of Latter-day Saints. Each week they are joined by a guest to talk about a question as it relates to LGBTQ+ topics within the context of faith. To submit a question or share a comment about an episode, you can email questionsfromthecloset@gmail.com.", "link": "https://podcasts.apple.com/us/podcast/questions-from-the-closet/id1504990147"}, {"title": "Transformation Church", "producer": "Transformation Church", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 8000, "num_episodes": 200, "description": "Here at Transformation Church we believe in Representing God to the lost and found for Transformation in Christ. We are a multi-ethnic, multi-generational, and multiplying church committed to progression not perfection. We are led by Lead Pastors Michael and Natalie Todd.", "link": "https://podcasts.apple.com/us/podcast/transformation-church/id1348831124"}, {"title": "Oh No, Ross and Carrie", "producer": "Maximum Fun", "genre": "Religion & Spirituality", "rating": 4.7, "num_ratings": 4400, "num_episodes": 295, "description": "Welcome to Oh No, Ross and Carrie, the show where we don’t just report on fringe science, spirituality, and claims of the paranormal, but take part ourselves. Follow us as we join religions, undergo alternative treatments, seek out the paranormal, and always find the humor in life's biggest mysteries. We show up - so you don’t have to.", "link": "https://podcasts.apple.com/us/podcast/oh-no-ross-and-carrie/id425328515"}, {"title": "The Paul Tripp Podcast", "producer": "Paul David Tripp", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 306, "num_episodes": 197, "description": "Dr. Paul David Tripp is a pastor and best-selling author. This podcast features Paul's new Bible Study, the Ask Paul Tripp Show, sermons, conference messages, radio broadcasts, and other audio resources that connect the transforming power of Jesus Christ to everyday life.", "link": "https://podcasts.apple.com/us/podcast/the-paul-tripp-podcast/id1463769457"}, {"title": "Ultimately with R.C. Sproul", "producer": "Ligonier Ministries", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 706, "num_episodes": 77, "description": "How do you focus on what really matters? Where do you go to regain perspective? Drawn from a lifetime of Bible study and reflections on the nature of truth, Ultimately with R.C. Sproul features unique moments of insight to help you understand what you believe and why you believe it. Renew your mind and grow in your knowledge of God when you listen to biblical teaching every Monday, Wednesday, and Friday. Set your mind on what matters most—what matters ultimately. A podcast from Ligonier Ministries.", "link": "https://podcasts.apple.com/us/podcast/ultimately-with-r-c-sproul/id494316084"}, {"title": "Thinking in Public - AlbertMohler.com", "producer": "R. Albert Mohler, Jr.", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 696, "num_episodes": 155, "description": "For more resources, including articles, The Briefing, Thinking in Public, and archived editions of his nationally-syndicated radio show, The Albert Mohler Program, be sure to visit albertmohler.com.", "link": "https://podcasts.apple.com/us/podcast/thinking-in-public-albertmohler-com/id390278978"}, {"title": "The Place We Find Ourselves", "producer": "Adam Young | LCSW, MDiv", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 1400, "num_episodes": 90, "description": "The Place We Find Ourselves podcast features private practice therapist Adam Young (LCSW, MDiv) and interview guests as they discuss all things related to story, trauma, attachment, and interpersonal neurobiology. Listen in as Adam unpacks how trauma and abuse impact the heart and mind, as well as how to navigate the path toward healing, wholeness, and restoration. Interview episodes give you a sacred glimpse into the real-life stories of guests who have engaged their own experiences of trauma and abuse. Drawing from the work of neuroscientists such as Allan Schore, Dan Siegel, and Bessel van der Kolk, as well as Christian thought leaders Dan Allender and John Eldredge, this podcast will equip and inspire you to engage your own stories of harm in deep, transformative ways.", "link": "https://podcasts.apple.com/us/podcast/the-place-we-find-ourselves/id1373926216"}, {"title": "Prompt Us", "producer": "iHeartRadio", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 739, "num_episodes": 20, "description": "The Prompt Us podcast is the honest conversation about modern faith through the eyes of three gen-z guys. Prompt Us aims to fill the largest gap that is blaring in the media industry today. The giant space where the pendulum swings between practical ambition and spirituality. Through the most humorous yet deeply motivational form of banter, us three best bros will offer insight on topics where faith, relationships, and professional life all intersect, encouraging radical personal growth. Ultimately, the podcast is titled “Prompt Us” because every conversation will be prompted by the audience themselves, offering a format that discusses exactly what the audience is hungry to hear but no one else is talking about. Over the years of friendship, our trio has developed a master skill set at skating the line of humor and light heartedness while filling every conversation with the truth, clarity, and motivation that young adults in this generation so desperately desire.", "link": "https://podcasts.apple.com/us/podcast/prompt-us/id1550666283"}, {"title": "Unashamed with Phil & Jase Robertson", "producer": "Blaze Podcast Network", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 17500, "num_episodes": 303, "description": "The Duck Commander and his sons are unashamed of their Christian faith and want to share the Gospel with everyone, from new believers to longtime followers of Jesus. Phil, Al, Jase, and their special guests go beyond the four walls of the church to share God's Word and study the Bible with you. So pour a glass of tea, and experience fun and inspiring stories of faith and family, straight from West Monroe, Louisiana.", "link": "https://podcasts.apple.com/us/podcast/unashamed-with-phil-jase-robertson/id1460147025"}, {"title": "Pints With Aquinas", "producer": "Matt Fradd", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 4200, "num_episodes": 351, "description": "If you could sit down with St. Thomas Aquinas over a pint of beer and ask him any one question, what would it be? Every episode of Pints With Aquinas revolves around a question, a question that St. Thomas addresses in his most famous work, The Summa Theologica. So get your geek on, pull up a bar stool, and grab a cold one. Here we go!", "link": "https://podcasts.apple.com/us/podcast/pints-with-aquinas/id1097862282"}, {"title": "Solid Joys Daily Devotional", "producer": "Desiring God", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 1700, "num_episodes": 50, "description": "Solid Joys is a daily devotional written and read by John Piper. These short and substantive readings will feed your joy in Jesus every day of the year. Discover more from Piper at desiringGod.org.", "link": "https://podcasts.apple.com/us/podcast/solid-joys-daily-devotional/id1315817340"}, {"title": "The Potter's House At One LA", "producer": "The Potter's House At One LA", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 2400, "num_episodes": 120, "description": "The official Podcast of The Potters House One LA & Denver", "link": "https://podcasts.apple.com/us/podcast/the-potters-house-at-one-la/id1039481487"}, {"title": "The Catholic Current", "producer": "The Station of the Cross Catholic Radio", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 85, "num_episodes": 654, "description": "The Catholic Current: Bringing Christ to the World and the World to Christ", "link": "https://podcasts.apple.com/us/podcast/the-catholic-current/id1332020135"}, {"title": "Joyce Meyer Radio Podcast", "producer": "Joyce Meyer Ministries", "genre": "Religion & Spirituality", "rating": 4.7, "num_ratings": 6000, "num_episodes": 21, "description": "Enjoying Everyday Life® is a daily TV and radio broadcast provided by Joyce Meyer Ministries.", "link": "https://podcasts.apple.com/us/podcast/joyce-meyer-radio-podcast/id152564333"}, {"title": "The Christy Wright Show", "producer": "Ramsey Network", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 1700, "num_episodes": 178, "description": "Life can be overwhelming and the day-to-day grind can leave you feeling stuck, but it doesn't have to be that way. The Christy Wright Show will fire you up so you can break through limitations to create a life you love and are proud of. You will build confidence in yourself and the God who created you.", "link": "https://podcasts.apple.com/us/podcast/the-christy-wright-show/id1138081298"}, {"title": "Come Follow Me for Us podcast", "producer": "Melanie Wellman", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 1900, "num_episodes": 134, "description": "A funny, inspirational, REAL podcast that correlates with the weekly Come Follow Me curriculum of The Church of Jesus Christ of Latter-day Saints.The host, Melanie Stroud, shares her thoughts about the weekly lessons and gives REAL LIFE examples showing how we can apply the scriptures to our lives every dayOne mother wrote that her son said recently, \"Melanie is a big fan of Jesus - you can tell.\"  That's the truth!  She is!  If you want to grow closer to the Savior and the scriptures and want some laughs along the way, this is the podcast for you!", "link": "https://podcasts.apple.com/us/podcast/come-follow-me-for-us-podcast/id1448229352"}, {"title": "Dream Big Podcast with Bob Goff and Friends", "producer": "AccessMore", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 1500, "num_episodes": 100, "description": "Most people never give themselves permission or know how to chase their big ambitions. Our framework helps you discover, declare, and realize yours so you can have a fulfilling life and impact the world for good.", "link": "https://podcasts.apple.com/us/podcast/dream-big-podcast-with-bob-goff-and-friends/id1458376688"}, {"title": "That Sounds Fun with Annie F. Downs", "producer": "That Sounds Fun Network", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 8000, "num_episodes": 482, "description": "Christian author and speaker Annie F. Downs shares with you some of her favorite things: new books, faith conversations, restaurants, travel stories, musicians not to miss, interviews with friends. Pretty much, if it sounds fun to Annie, you're gonna hear about it.", "link": "https://podcasts.apple.com/us/podcast/that-sounds-fun-with-annie-f-downs/id944925529"}, {"title": "Abide Bible Sleep Meditation", "producer": "Abide Christian Meditation App", "genre": "Religion & Spirituality", "rating": 3.9, "num_ratings": 404, "num_episodes": 124, "description": "Christian Bible story sleep meditations by Abide with peaceful water sounds and music to help you fall asleep fast. For more Bible sleep meditations download the Abide app: https://abide.co/awesome", "link": "https://podcasts.apple.com/us/podcast/abide-bible-sleep-meditation/id1488040861"}, {"title": "The Potter's Touch on Lightsource.com", "producer": "Bishop T.D. Jakes", "genre": "Religion & Spirituality", "rating": 4.6, "num_ratings": 3100, "num_episodes": 14, "description": "To support this ministry financially, visit: https://www.lightsource.com/donate/973The Potter's Touch, a weekly program, with Bishop T.D. Jakes, tackles today's topics and confronts the hidden issues and invisible scars that go untreated. This broadcast carries healing and restoration into homes of hurting people, unearthing taboo topics and offering practical and spiritual solutions to life's toughest questions. 857311", "link": "https://podcasts.apple.com/us/podcast/the-potters-touch-on-lightsource-com/id364682371"}, {"title": "5 Minutes in Church History with Stephen Nichols", "producer": "Ligonier Ministries", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 1200, "num_episodes": 444, "description": "This weekly podcast provides an informal and informative look at church history. Join us each week as we take a brief break from the present to go exploring the past. Travel back in time as we look at the people, events, and even the places that have shaped the story of Christianity. Each episode offers an easily digestible glimpse of how the eternal, unchangeable God has worked in the church over prior generations and how this can encourage us today. This is our story—our family history.", "link": "https://podcasts.apple.com/us/podcast/5-minutes-in-church-history-with-stephen-nichols/id684370851"}, {"title": "Mormon Stories - LDS", "producer": "Dr. John Dehlin", "genre": "Religion & Spirituality", "rating": 4.4, "num_ratings": 2600, "num_episodes": 1492, "description": "Mormon Stories is an attempt to build understanding between and about Mormons through the telling of stories in both audio and video formats.", "link": "https://podcasts.apple.com/us/podcast/mormon-stories-lds/id312094772"}, {"title": "The Antithesis", "producer": "Owen Strachan", "genre": "Religion & Spirituality", "rating": 4.6, "num_ratings": 202, "num_episodes": 72, "description": "The Antithesis exists to clarify the difference Christianity and every system, worldview, and religion. Armed with a big vision of God and a passion for divine grace, we help listeners to understand sound biblical doctrine and to distinguish it from ideologies that seek to take us captive (Colossians 2:8). Our burden is defensive but also offensive: we seek the destruction of intellectual and behavioral strongholds in order that we would taste the joy of a mind set free by Christ (2 Corinthians 10:3-6). Ultimately, The Antithesis seeks to aid in theological discipleship; our goal is to set the heart and mind on fire for God, and to stand immoveable in a chaotic and fallen realm.", "link": "https://podcasts.apple.com/us/podcast/the-antithesis/id1152518569"}, {"title": "Go(o)d Mornings with CurlyNikki", "producer": "Nikki Walton", "genre": "Religion & Spirituality", "rating": 5.0, "num_ratings": 434, "num_episodes": 13, "description": "Start your mornings off right with a mini-retreat to feel better, get more done, and live this life confidently, energetically, and abundantly. Each weekday at 7am ET, I'll be sharing easy access doors to help you find Peace in chaos, Love in fear, Silence in noise, and Light in darkness. You’ll start recognizing the Go(o)d in everything, including yourself. Listen anywhere you get your podcasts, and please subscribe, rate, and review Go(o)d Mornings if you enjoy it! ***10% of revenue generated from this podcast will be donated to \"Showering Love\" a non-profit organization that restores good mornings, dignity, hope and health to people experiencing homelessness by providing showers and other supportive services.", "link": "https://podcasts.apple.com/us/podcast/go-o-d-mornings-with-curlynikki/id1570144628"}, {"title": "The Liturgists Podcast", "producer": "The Liturgists", "genre": "Religion & Spirituality", "rating": 4.7, "num_ratings": 3500, "num_episodes": 186, "description": "An artful, mind-expanding, heart-opening, genre-bending exploration of how to live a life full of more love and less suffering.", "link": "https://podcasts.apple.com/us/podcast/the-liturgists-podcast/id903433534"}, {"title": "The Naked Marriage with Dave & Ashley Willis", "producer": "XO Podcast Network", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 2000, "num_episodes": 152, "description": "A podcast dedicated to undressing the truth about sex, intimacy and lifelong love. The concerns and questions most couples have in marriage often go unspoken, until now. Hosts Dave and Ashley Willis bring wisdom, vulnerability, and humor to even the toughest marriage topics. Together they have built a strong following, reaching millions of married couples through their blogs, books, and videos. They have four young sons and live in Augusta, GA.", "link": "https://podcasts.apple.com/us/podcast/the-naked-marriage-with-dave-ashley-willis/id1437213097"}, {"title": "1 Year Daily Audio Bible", "producer": "Brian Hardin", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 7900, "num_episodes": 205, "description": "One year.  Every day.  365 days through the Bible in community with tens of thousands of others around the globe following the same quest.  Broadcast daily from the rolling hills of Tennessee, Nashville based record producer and author Brian Hardin is your guide on the adventure of a lifetime. Also visit our sister programs: 1 Year Daily Audio Proverb, Daily Audio Bible Kids, Daily Audio Bible En Espanol, Daily Audio Bible Japanese and Daily Audio Bible Hindi.  Visit us on the web at www.dailyaudiobible.com", "link": "https://podcasts.apple.com/us/podcast/1-year-daily-audio-bible/id111065122"}, {"title": "WallBuilders Live! with David Barton & Rick Green", "producer": "David Barton, Tim Barton, and Rick Green", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 1200, "num_episodes": 20, "description": "WallBuilders Live! with David Barton and Rick Green is a daily journey into the past to capture the ideas of the Founding Fathers of America and then apply them to the major issues of today. Featured guests will include Congressmen, Senators, and other elected officials, as well as experts, activists, authors, and commentators on a variety of issues facing America.", "link": "https://podcasts.apple.com/us/podcast/wallbuilders-live-with-david-barton-rick-green/id387601688"}, {"title": "Highest Self Podcast‪®‬", "producer": "Sahara Rose", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 4300, "num_episodes": 374, "description": "Highest Self Podcast® is the #1 spirituality podcast on iTunes and for a reason. Sahara Rose makes spirituality fun, diverse, grounded and relatable! With 4 years and over 4000 5-star reviews, Highest Self Podcast will teach you how to Discover Your Dharma™ (soul's purpose), embody your fullest expression and blossom into your highest self. From divine feminine wisdom, to taking action on your dharma (soul's purpose), to manifestation, to past lives, to sacred sensuality, to conscious entrepreneurship, this podcast is the spiritual friend you wish you had, who lifts you up and gets you on all levels. Welcome, sister queen!Discover your Dharma Archetype and Dosha (Ayurvedic mind-body type) with Sahara's unique quizzes www.iamsahararose.com and dive into her latest book Discover Your Dharma. For her monthly Goddess Circles, join Rose Gold Goddesses at www.rosegoldgoddesses.com. Follow her on Instagram, TikTok Facebook and Twitter at @IAmSaharaRose", "link": "https://podcasts.apple.com/us/podcast/highest-self-podcast/id1244644906"}, {"title": "Manifest Daily", "producer": "Dheandra Nicolette", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 71, "num_episodes": 123, "description": "Manifest Daily is a spiritual and lifestyle podcast that provides all the energy and support that you need to return to highest self and live your best life.Yes, girl, (or boy!) I gotchu!Each week, I share lessons learned from my personal experience with manifestation, the akashic records, spiritual laws, everyday life and so much more! I’m here to remind you that you’re here for a purpose and to have fun!So, slap on ya face masks, turn up the volume and let’s dive in - and oh, and don’t forget to share with a friend bb, sharing is caring after all ( ;", "link": "https://podcasts.apple.com/us/podcast/manifest-daily/id1448199035"}, {"title": "Grace to You: Pulpit Podcast", "producer": "John MacArthur", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 1300, "num_episodes": 187, "description": "This powerful broadcast will boost your spiritual growth by helping you understand and apply God's Word to your life and the life of your family and church. John MacArthur, pastor-teacher, has been offering his practical, verse-by-verse Bible teaching through Grace to You for 40 years.", "link": "https://podcasts.apple.com/us/podcast/grace-to-you-pulpit-podcast/id295647558"}, {"title": "Love Worth Finding on Oneplace.com", "producer": "Adrian Rogers", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 1800, "num_episodes": 14, "description": "To support this ministry financially, visit: https://www.oneplace.com/donate/135Love Worth Finding's purpose is to bring people to Christ and mature them in the faith. This happens primarily through efforts in publishing and broadcasting biblical truth.Love Worth Finding began in 1987, as a response to several requests for tapes of messages by pastor and Bible teacher Adrian Rogers. He relates that \"soon the requests began to grow to the point that we knew God was leading us into a wider ministry.\" As an extension of Dr. Rogers' pulpit ministry Love Worth Finding provided that role and continues today. Dr. Rogers stated, \"I believe God wants us to proclaim the message of salvation in the power of the Holy Spirit by every means possible. That’s our commitment at Love Worth Finding.\" In response to many who are asking,has that purpose changed since the home-going of Dr. Rogers? No, God wants us to continue to proclaim the message of salvation. The messenger may be gone, but the message must continue. Millions still have not heard the precious name of Jesus or know His redeeming grace. So our race is not over. We must still rununtil Jesus comes. If you believe in what God has called LWF to do,we invite you to help us proclaim God's truth. Our prayer is that you will join with us in running the race and in broadcasting the Good News that Jesus Christ is truly the greatest Love worth finding.", "link": "https://podcasts.apple.com/us/podcast/love-worth-finding-on-oneplace-com/id288159649"}, {"title": "This is the Gospel Podcast", "producer": "LDS Living", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 2200, "num_episodes": 83, "description": "The stories we tell matter. They can build our faith, help us empathize with others, demonstrate the true power of God in our lives, and help lead us to Christ. This Is the Gospel, a new storytelling podcast from LDS Living, collects and shares personal stories that illustrate the challenges and triumphs of living in the latter days.", "link": "https://podcasts.apple.com/us/podcast/this-is-the-gospel-podcast/id1441843007"}, {"title": "Jesus Calling: Stories of Faith", "producer": "Sarah Young", "genre": "Religion & Spirituality", "rating": 4.5, "num_ratings": 851, "num_episodes": 284, "description": "Millions have been encouraged and inspired by the words of the #1 best-selling 365-day devotional \"Jesus Calling.\" Listen to real-life stories of faith as told by those who have experienced the power of living in His presence.", "link": "https://podcasts.apple.com/us/podcast/jesus-calling-stories-of-faith/id1081967443"}, {"title": "The Catholic Talk Show", "producer": "Ryan DellaCrosse, Ryan Scheel and Fr. Richard Pagano", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 908, "num_episodes": 142, "description": "The Catholic Talk Show is a hilarious, entertaining, and informative Catholic podcast featuring Ryan DellaCrosse, Ryan Scheel, and Fr. Rich Pagano,", "link": "https://podcasts.apple.com/us/podcast/the-catholic-talk-show/id1436358056"}, {"title": "All In", "producer": "LDS Living", "genre": "Religion & Spirituality", "rating": 4.9, "num_ratings": 4600, "num_episodes": 144, "description": "What does it mean to be \"all in\" the Gospel of Jesus Christ in the latter days? The answers might surprise you. All In is a brand new podcast from LDS Living where we explore this question with the help of Latter-day Saints who are striving to live their faith every day—just like you.", "link": "https://podcasts.apple.com/us/podcast/all-in/id1439975046"}, {"title": "Elevation with Steven Furtick", "producer": "Elevation Church", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 1400, "num_episodes": 105, "description": "Welcome to the weekly podcast of Elevation Church led by Pastor Steven Furtick. To learn more visit our website at http://elevationchurch.org or download the Elevation App. To support this ministry and help us continue to reach people all around the world click here: http://ele.vc/WeX3nP", "link": "https://podcasts.apple.com/us/podcast/elevation-with-steven-furtick/id444092800"}, {"title": "Sadhguru", "producer": "Sadhguru Official", "genre": "Religion & Spirituality", "rating": 4.8, "num_ratings": 670, "num_episodes": 586, "description": "Sadhguru, founder of Isha Foundation is a yogi, mystic and spiritual master with a difference. An arresting blend of profundity and pragmatism, his life and work serve as a reminder that inner sciences are not esoteric philosophies from an outdated past, but a contemporary science vitally relevant to our times.", "link": "https://podcasts.apple.com/us/podcast/sadhguru/id347854569"}, {"title": "Annie and Eddie Keep Talking", "producer": "That Sounds Fun Network", "genre": "Religion & Spirituality", "rating": 5.0, "num_ratings": 3100, "num_episodes": 148, "description": "Friends and podcasters Annie F. Downs and Eddie Kaufholz host a 30ish minute show, releasing Tuesdays and Fridays, promising laughs, random topical deep dives and rabbit trails... all the things you've come to expect when Annie and Eddie keep talking.", "link": "https://podcasts.apple.com/us/podcast/annie-and-eddie-keep-talking/id1510645180"}]