[{"title": "The Samuel Andreyev Podcast", "reviews": ""}, {"title": "Broccoli Book Club", "reviews": ""}, {"title": "Decoder with Nilay Patel", "reviews": " Not sure who let Horacio Guiterrez on to Decoder.  He might be a great lawyer, but he made a horrible case against Apple. He sounded like a whiny child, he is missing the point that consumers trust Apple more than Spotify and almost every other tech company.\n\nMore innovation is good, but typical SV attitude, is that Innovtion in itself is positive and want consumers want.. I love vergcast and decoder, and Nilay is my bestfriend in my head. I am an avid and loyal lister. But Nilay, I feel like you are too bias in some interviews and low key mean to some of the guest. Maybe I am sensitive but I think you should be a bit more objective and push for guests to prove their points vs you stating yours. Nonetheless - you as my favorite BFF All around a terrific podcast. The guests are experienced and very knowledgable in thier industries and in business, and Nilay knows how to take advantage of this to get the most takeaways out of them. Always looking forward to the next episode Love the show Nilay! Sometimes I go into an episode thinking it might be boring based off the industry of the guest, but am pleasantly surprised. I enjoy your thoughtful questions and outlook on things. And on top of that you’re in the Vergecast every week too! Thank you for the work you put into these 2 wonderful pods! Amazing insights from some of the biggest names in tech. Nilay does a great job asking thought-provoking and insightful questions I always learn something new listening to this podcast. A must listen for sure. Awesome podcast with some really great insights! Can't wait to hear more! This show has really evolved over the years and the deep dives into new, modern, and necessary topics really make this a timely piece that explores all aspects of problems and ideas. Just started listening to this podcast and have enjoyed every minute. Nilay’s fast-paced discussions and his ability to link business, tech, and current events held my interest through the whole hour. I have now subscribed and look forward to the weekly show. This is a great podcast. Informative, interesting, and timely, delivered in a way that is pleasant and fun to listen to. I’m a long time listener, that previously found the show informative and balanced. Now, that Big Tech is flexing muscles by removing apps, user reviews, etc.. This show sounds like it’s been edited by Google and Facebook’s PR department before getting uploaded. If you’re scared to continue giving honest opinions about technology and the industry, just be transparent. Unfortunately, the show now uses it’s influence to keep listeners in the dark, shameful."}, {"title": "Armchair Expert Mondays with Dax Shepard", "reviews": ""}, {"title": "Experts on Expert with Dax Shepard", "reviews": ""}, {"title": "6 Minute Vocabulary", "reviews": ""}, {"title": "Camp Monsters", "reviews": " Go with Roger Roger roger My son and I listen every night! Well at this point there really isn’t much to think, you better go with him and find out more, otherwise you will always wonder... What if? Night owl forever I’m grabbing my coat and following him into that cold dark night. In tonight’s story, I would totally go with the guy. If you can make it through most of that crazy story you should stick around for the end. Unless it gets weird. Or if it takes a long time and travel is required. Someday I hope to be affluent enough to just leave on a whim without worrying about actual obligations Go with roger so you can help him and find out more Might as well see it, right? Such a creepy and fun podcast! The storytelling is impeccable and the setup and atmosphere of the episode is delightful. Would rate 10 stars if I could. Absolutely nothing wrong. Would love to see a Wendigo episode if possible, though. For goodness sake  Roger, drop deeper into the shadows, stay low and stay quiet.  Keep the suspense going.\n\nGreat storytelling in this podcast.   Nov 18, 2020,  ’The Dark Divide: Sasquatch’ is a great Quinalt tale about Glue-Keek."}, {"title": "Someone Dies In This Elevator", "reviews": ""}, {"title": "Rebel Robin: Surviving Hawkins", "reviews": " This podcast is so far my favorite. I love Robin from Stranger Things and this is also a great way to wait for season 4. AWESOME It’s great for stranger things fans like me! The first episode was so entertaining. Cant wait till the next episodes!❤️ im just so happy we finally we to see more about robin and her backstory. i feel like we barely learned anything about her life in the show so im so excited for this podcast. also (spoiler alert) the fact that robin and barb were potential lovers is literally the best thing ever and the highlight of my day i’ve always kinda thought they would’ve been cute even though barb was dead for most of the show. plus i have literally always known barb was lesbian lol. anyway im so excited for more episodes / chapters!!!"}, {"title": "The Designated Mourner", "reviews": ""}, {"title": "Limelight", "reviews": ""}, {"title": "Electric Easy", "reviews": ""}, {"title": "This Week in Dystopia", "reviews": ""}, {"title": "Capitol Insurrection Report", "reviews": ""}, {"title": "FEDTalk", "reviews": ""}, {"title": "Intelligence is Dope", "reviews": ""}, {"title": "City Planning Matters", "reviews": ""}, {"title": "The Indigenous Approach", "reviews": ""}, {"title": "For Your Benefit", "reviews": ""}, {"title": "Health Equity Forum", "reviews": ""}, {"title": "Dupree, Inspirational Speaker/Entrepreneur‪.‬", "reviews": ""}, {"title": "Red Line", "reviews": ""}, {"title": "China Uncovered", "reviews": ""}, {"title": "New Jersey Globe Power Hour", "reviews": ""}, {"title": "The Great Antidote", "reviews": ""}, {"title": "AshCast", "reviews": ""}, {"title": "The Air Force Podcast", "reviews": ""}, {"title": "Medicaid Leadership Exchange", "reviews": ""}, {"title": "Hypocrats", "reviews": ""}, {"title": "The ASES Podcast", "reviews": ""}, {"title": "Kurdistan in America", "reviews": ""}, {"title": "Life Across Borders: A World Relief Mini-Series", "reviews": ""}, {"title": "Lassen Audio Tours", "reviews": ""}, {"title": "Inside Cyber Diplomacy", "reviews": ""}, {"title": "Rose Heights Church", "reviews": ""}, {"title": "Political Playlist Happy Hour", "reviews": ""}, {"title": "Fully Involved Firefighting", "reviews": ""}, {"title": "I Hate Politics Podcast", "reviews": ""}, {"title": "Western Way of War", "reviews": ""}, {"title": "On Auschwitz", "reviews": ""}, {"title": "5 for 5 Trivia", "reviews": ""}, {"title": "Spike's Car Radio", "reviews": " Spike does NOT like to be interrupted, especially when he’s interrupting! I still listen every week. Love the cars don’t get me wrong, but cmon Spike let Zucc talk about his bug collection. Five stars. My favorite thing to do on Wednesday mornings is have my morning cup of coffee and listen to you guys.I laugh every time Zuckerman mentions\nBlue Chew. They’re getting a great deal. I’ve been listening since the start. Love the Porsche and auto discussion. I thought Lieberman would be a good add.\nBut I gotta turn it off. Lieberman is taking air out of the room, limiting zuckermans antics and politics has steadily taken a lead in the conversation. I don’t even like Tesla, but the latest excoriation of elon musk has soured my enjoyment.  Sorry guys. I really enjoyed it with Earth Wind and Fire and Porsche talk.\nBest of luck with future podcasts. One of my favorite car enthusiast podcasts with hysterical hosts. I have listened to every episode. Spike and his regular and not so regular hosts create a fun listen every time. You never know where Zuckerman will take the conversation sometimes stopping Spike in his tracks. I like the addition of Lieberman and it is always great when Seinfeld joins the crew or calls in. 95% rich guy babble. 5% cars. I love having Jonny on a more of a full time gig. I wish he could finish his sentences more often without being interrupted but still a wonderful show! Love the Show! Something for everybody🚗not a fan of Lieberman.  Zuckerman is King of the F Bomb. Spike is hilarious and a great host. Keep up the good work guys. There just might be some individual in the listing audience that believe in God. I know it’s your podcast but the more I listen it’s very apparent you have no morals towards others. Hey free country to do what ever you want but I can no longer take part in this podcast. Should be rated with explicit language at least bleep it out  glad I didn’t have any young ones around + half the show was nothing car related first episode for me was on future of Lotus should have been future of this show which is not for me-"}, {"title": "The Geto Boys Reloaded", "reviews": ""}, {"title": "Billie Eilish - Instrumental (& a Cover‪)‬", "reviews": ""}, {"title": "Hit Different", "reviews": ""}, {"title": "Francis Chan Sermons", "reviews": ""}, {"title": "Grazing Grass Podcast", "reviews": ""}, {"title": "Planet Visionaries", "reviews": " Thanks for this new, important and super interesting podcast!!!🙏🙏❤️❤️❤️"}, {"title": "After The Island", "reviews": ""}, {"title": "PyTorch Developer Podcast", "reviews": ""}, {"title": "Ship It! DevOps, Infra, Cloud Native", "reviews": ""}, {"title": "The Blockchain.com Podcast", "reviews": ""}, {"title": "Does Not Compute", "reviews": ""}, {"title": "On The Ledger", "reviews": ""}, {"title": "Cloudcast Basics", "reviews": ""}, {"title": "Gamechangers from Economist Radio", "reviews": ""}, {"title": "Thet Tant Cho", "reviews": ""}, {"title": "The ReadME Podcast", "reviews": ""}, {"title": "Bad Bad Thing", "reviews": " The moment Jennair started speaking I got chills.  I’m curious/excited/scared to find out how things ended up the way they did. One episode in and I. Am. Riveted. I’m gonna make all my friends listen because all I want to do is talk about it!! Apple podcast updated their app and it ruined my life. Why can’t I listen to the first episode?? It came out today!"}, {"title": "Fox Hunter", "reviews": ""}, {"title": "Murder in Illinois", "reviews": ""}, {"title": "American Conservative University", "reviews": ""}, {"title": "T.D. Jakes Sermons", "reviews": ""}]